; ModuleID = '4a9g39ij3qp2zfyw'
source_filename = "4a9g39ij3qp2zfyw"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"[closure@std::thread::Builder::spawn_unchecked<[closure@crossbeam::thread::ScopedThreadBuilder::spawn<[closure@src/main.rs:15:27: 20:4], ()>::{closure#1}], ()>::{closure#0}]" = type { [0 x i64], i64*, [0 x i64], i64*, [0 x i64], { i8*, i64* }, [0 x i64], i64*, [0 x i64] }
%"[closure@crossbeam::thread::ScopedThreadBuilder::spawn<[closure@src/main.rs:15:27: 20:4], ()>::{closure#0}]" = type { [0 x i64], { i64*, i64* }, [0 x i64], %"[closure@src/main.rs:15:27: 20:4]", [0 x i64], i64*, [0 x i64] }
%"[closure@src/main.rs:15:27: 20:4]" = type { [0 x i64], i32*, [0 x i64], i32*, [0 x i64], i32*, [0 x i64] }
%"std::vec::Vec<std::boxed::Box<dyn std::any::Any + std::marker::Send>>" = type { [0 x i64], { i64*, i64 }, [0 x i64], i64, [0 x i64] }
%"std::io::Error" = type { [0 x i64], %"std::io::error::Repr", [0 x i64] }
%"std::io::error::Repr" = type { [0 x i8], i8, [15 x i8] }
%"std::fmt::Formatter" = type { [0 x i64], { i64, i64 }, [0 x i64], { i64, i64 }, [0 x i64], { {}*, [3 x i64]* }, [0 x i32], i32, [0 x i32], i32, [0 x i8], i8, [7 x i8] }
%"std::sync::atomic::AtomicUsize" = type { [0 x i64], i64, [0 x i64] }
%"std::result::Result<std::thread::JoinHandle<()>, std::io::Error>" = type { [0 x i64], i64, [4 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !5, identifier: "vtable")
!4 = !{}
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !6, file: !2, size: 320, align: 64, elements: !10, templateParams: !4, identifier: "ea5a8fafa084058e846976e696810a8d")
!6 = !DINamespace(name: "spawn_unchecked", scope: !7)
!7 = !DINamespace(name: "{{impl}}", scope: !8)
!8 = !DINamespace(name: "thread", scope: !9)
!9 = !DINamespace(name: "std", scope: null)
!10 = !{!11, !113, !212, !237}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !5, file: !2, baseType: !12, size: 64, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !8, file: !2, size: 64, align: 64, elements: !13, templateParams: !4, identifier: "15127dee45bf2be32874e7c7bf7c0ae6")
!13 = !{!14}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !12, file: !2, baseType: !15, size: 64, align: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner>", scope: !16, file: !2, size: 64, align: 64, elements: !18, templateParams: !106, identifier: "2087bbdc2002c2dee8ab029616542ef3")
!16 = !DINamespace(name: "sync", scope: !17)
!17 = !DINamespace(name: "alloc", scope: null)
!18 = !{!19, !110}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner>>", scope: !21, file: !2, size: 64, align: 64, elements: !24, templateParams: !108, identifier: "e91db83023a31648ce50af0b38feaff1")
!21 = !DINamespace(name: "non_null", scope: !22)
!22 = !DINamespace(name: "ptr", scope: !23)
!23 = !DINamespace(name: "core", scope: null)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !20, file: !2, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Inner>", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !16, file: !2, size: 384, align: 64, elements: !28, templateParams: !106, identifier: "93ca378ddd27e9561e89c3d2506ac2a8")
!28 = !{!29, !42, !43}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !27, file: !2, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !31, file: !2, size: 64, align: 64, elements: !33, templateParams: !4, identifier: "6111d960802cd765eba1866cb776b357")
!31 = !DINamespace(name: "atomic", scope: !32)
!32 = !DINamespace(name: "sync", scope: !23)
!33 = !{!34}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !30, file: !2, baseType: !35, size: 64, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !36, file: !2, size: 64, align: 64, elements: !37, templateParams: !40, identifier: "fc2aa4ffe8447d5d421ff0563135e87c")
!36 = !DINamespace(name: "cell", scope: !23)
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !35, file: !2, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!40 = !{!41}
!41 = !DITemplateTypeParameter(name: "T", type: !39)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !27, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !27, file: !2, baseType: !44, size: 256, align: 64, offset: 128)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !8, file: !2, size: 256, align: 64, elements: !45, templateParams: !4, identifier: "ca5c69cf62f3a4d6f1fb008d0d334c3d")
!45 = !{!46, !81, !90}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !2, baseType: !47, size: 128, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::ffi::c_str::CString>", scope: !48, file: !2, size: 128, align: 64, elements: !49, identifier: "a7f21f128c6692227724ca30f07bf29")
!48 = !DINamespace(name: "option", scope: !23)
!49 = !{!50}
!50 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 128, align: 64, elements: !51, templateParams: !54, identifier: "a7f21f128c6692227724ca30f07bf29_variant_part", discriminator: !79)
!51 = !{!52, !75}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !50, file: !2, baseType: !53, size: 128, align: 64, extraData: i64 0)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !47, file: !2, size: 128, align: 64, elements: !4, templateParams: !54, identifier: "a7f21f128c6692227724ca30f07bf29::None")
!54 = !{!55}
!55 = !DITemplateTypeParameter(name: "T", type: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !57, file: !2, size: 128, align: 64, elements: !59, templateParams: !4, identifier: "65c3bf023a6b555dfc9cb51543ba37c2")
!57 = !DINamespace(name: "c_str", scope: !58)
!58 = !DINamespace(name: "ffi", scope: !9)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !56, file: !2, baseType: !61, size: 128, align: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !62, templateParams: !67, identifier: "e4a6a6843d910ea2bc51304fe56862c1")
!62 = !{!63, !66}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !61, file: !2, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !61, file: !2, baseType: !39, size: 64, align: 64, offset: 64)
!67 = !{!68, !72}
!68 = !DITemplateTypeParameter(name: "T", type: !69)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: -1, lowerBound: 0)
!72 = !DITemplateTypeParameter(name: "A", type: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !74, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "e4d51af9c1e83fbc6db181ae5bd11b43")
!74 = !DINamespace(name: "alloc", scope: !17)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !50, file: !2, baseType: !76, size: 128, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !47, file: !2, size: 128, align: 64, elements: !77, templateParams: !54, identifier: "a7f21f128c6692227724ca30f07bf29::Some")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !76, file: !2, baseType: !56, size: 128, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, scope: !48, file: !2, baseType: !80, size: 64, align: 64, flags: DIFlagArtificial)
!80 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !44, file: !2, baseType: !82, size: 64, align: 64, offset: 128)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !8, file: !2, size: 64, align: 64, elements: !83, templateParams: !4, identifier: "f6f0259fc13e9ca7ee42c3dba2d790b6")
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !82, file: !2, baseType: !85, size: 64, align: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64", scope: !86, file: !2, size: 64, align: 64, elements: !88, templateParams: !4, identifier: "4cc35938c55db79bf670fe332761a87e")
!86 = !DINamespace(name: "nonzero", scope: !87)
!87 = !DINamespace(name: "num", scope: !23)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !85, file: !2, baseType: !80, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !44, file: !2, baseType: !91, size: 32, align: 32, offset: 192)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !92, file: !2, size: 32, align: 32, elements: !95, templateParams: !4, identifier: "2623f5fbacf1ccb41ebe95392b878648")
!92 = !DINamespace(name: "futex", scope: !93)
!93 = !DINamespace(name: "thread_parker", scope: !94)
!94 = !DINamespace(name: "sys_common", scope: !9)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !91, file: !2, baseType: !97, size: 32, align: 32)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicI32", scope: !31, file: !2, size: 32, align: 32, elements: !98, templateParams: !4, identifier: "12669af73a135436b0f8dfc54de2379e")
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !97, file: !2, baseType: !100, size: 32, align: 32)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<i32>", scope: !36, file: !2, size: 32, align: 32, elements: !101, templateParams: !104, identifier: "e8ec75710d5d461ce19362a0145d2da2")
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !2, baseType: !103, size: 32, align: 32)
!103 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!104 = !{!105}
!105 = !DITemplateTypeParameter(name: "T", type: !103)
!106 = !{!107}
!107 = !DITemplateTypeParameter(name: "T", type: !44)
!108 = !{!109}
!109 = !DITemplateTypeParameter(name: "T", type: !27)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !15, file: !2, baseType: !111, align: 8)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !108, identifier: "8136fd2d487bcd484aa9276f4931545a")
!112 = !DINamespace(name: "marker", scope: !23)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !5, file: !2, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !48, file: !2, size: 64, align: 64, elements: !115, identifier: "3b6a8665413826826b9a4de3e47f2de")
!115 = !{!116}
!116 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 64, align: 64, elements: !117, templateParams: !120, identifier: "3b6a8665413826826b9a4de3e47f2de_variant_part", discriminator: !79)
!117 = !{!118, !208}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !116, file: !2, baseType: !119, size: 64, align: 64, extraData: i64 0)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !114, file: !2, size: 64, align: 64, elements: !4, templateParams: !120, identifier: "3b6a8665413826826b9a4de3e47f2de::None")
!120 = !{!121}
!121 = !DITemplateTypeParameter(name: "T", type: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !16, file: !2, size: 64, align: 64, elements: !123, templateParams: !202, identifier: "c29b7bdbdeda079b91265854d81497cc")
!123 = !{!124, !206}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !122, file: !2, baseType: !125, size: 64, align: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !21, file: !2, size: 64, align: 64, elements: !126, templateParams: !204, identifier: "cc1f269e5b5ddd934da9a40b7040cdd7")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !125, file: !2, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !16, file: !2, size: 448, align: 64, elements: !130, templateParams: !202, identifier: "ebcad4aa09866de8eed60e1ff1f53874")
!130 = !{!131, !132, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !129, file: !2, baseType: !30, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !129, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !129, file: !2, baseType: !134, size: 320, align: 64, offset: 128)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !135, file: !2, size: 320, align: 64, elements: !137, templateParams: !200, identifier: "c4ec2f1661d001d66d537f7f764290b5")
!135 = !DINamespace(name: "mutex", scope: !136)
!136 = !DINamespace(name: "sync", scope: !9)
!137 = !{!138, !165, !178}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !134, file: !2, baseType: !139, size: 64, align: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovableMutex", scope: !140, file: !2, size: 64, align: 64, elements: !141, templateParams: !4, identifier: "2883e54b1a286dd369be8f96b7965cd0")
!140 = !DINamespace(name: "mutex", scope: !94)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !139, file: !2, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::sys::unix::mutex::Mutex, alloc::alloc::Global>", baseType: !144, size: 64, align: 64, dwarfAddressSpace: 0)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !145, file: !2, size: 320, align: 64, elements: !148, templateParams: !4, identifier: "129bcfa7494c9a7f434cb6f79151c373")
!145 = !DINamespace(name: "mutex", scope: !146)
!146 = !DINamespace(name: "unix", scope: !147)
!147 = !DINamespace(name: "sys", scope: !9)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !144, file: !2, baseType: !150, size: 320, align: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<libc::unix::linux_like::linux::pthread_mutex_t>", scope: !36, file: !2, size: 320, align: 64, elements: !151, templateParams: !163, identifier: "63702e9730594c91262bc73577a77ed")
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !150, file: !2, baseType: !153, size: 320, align: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t", scope: !154, file: !2, size: 320, align: 64, elements: !158, templateParams: !4, identifier: "29417aee2c490952729ea37d7fd7956d")
!154 = !DINamespace(name: "linux", scope: !155)
!155 = !DINamespace(name: "linux_like", scope: !156)
!156 = !DINamespace(name: "unix", scope: !157)
!157 = !DINamespace(name: "libc", scope: null)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !153, file: !2, baseType: !160, size: 320, align: 8)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 320, align: 8, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 40, lowerBound: 0)
!163 = !{!164}
!164 = !DITemplateTypeParameter(name: "T", type: !153)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !134, file: !2, baseType: !166, size: 8, align: 8, offset: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !167, file: !2, size: 8, align: 8, elements: !168, templateParams: !4, identifier: "6bfe09f2d6e576f2167d782127901c9c")
!167 = !DINamespace(name: "poison", scope: !94)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !166, file: !2, baseType: !170, size: 8, align: 8)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !31, file: !2, size: 8, align: 8, elements: !171, templateParams: !4, identifier: "9fae9e53727c4d79df9c89c13279ffb8")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !170, file: !2, baseType: !173, size: 8, align: 8)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !36, file: !2, size: 8, align: 8, elements: !174, templateParams: !176, identifier: "2fa8e20d656222adadd60015061cba20")
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !173, file: !2, baseType: !65, size: 8, align: 8)
!176 = !{!177}
!177 = !DITemplateTypeParameter(name: "T", type: !65)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !2, baseType: !179, size: 192, align: 64, offset: 128)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !36, file: !2, size: 192, align: 64, elements: !180, templateParams: !200, identifier: "24e0068c2559bbd99ae1809c0ba20acf")
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !179, file: !2, baseType: !182, size: 192, align: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !183, file: !2, size: 192, align: 64, elements: !184, templateParams: !198, identifier: "1baa0a848530de80e582b4239f7a797b")
!183 = !DINamespace(name: "vec", scope: !17)
!184 = !{!185, !199}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !182, file: !2, baseType: !186, size: 128, align: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !187, file: !2, size: 128, align: 64, elements: !188, templateParams: !198, identifier: "8280176023313cc19e84c8e31f077db8")
!187 = !DINamespace(name: "raw_vec", scope: !17)
!188 = !{!189, !196, !197}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !186, file: !2, baseType: !190, size: 64, align: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !191, file: !2, size: 64, align: 64, elements: !192, templateParams: !176, identifier: "a00903ff63a043f314860ea41133f85")
!191 = !DINamespace(name: "unique", scope: !22)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !190, file: !2, baseType: !64, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !190, file: !2, baseType: !195, align: 8)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !176, identifier: "f1af3433f93ab467340e4a9a1f1aa719")
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !186, file: !2, baseType: !39, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !186, file: !2, baseType: !73, align: 8)
!198 = !{!177, !72}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !182, file: !2, baseType: !39, size: 64, align: 64, offset: 128)
!200 = !{!201}
!201 = !DITemplateTypeParameter(name: "T", type: !182)
!202 = !{!203}
!203 = !DITemplateTypeParameter(name: "T", type: !134)
!204 = !{!205}
!205 = !DITemplateTypeParameter(name: "T", type: !129)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !122, file: !2, baseType: !207, align: 8)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !204, identifier: "10bed538975768c986829c6885a6fb0e")
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !116, file: !2, baseType: !209, size: 64, align: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !114, file: !2, size: 64, align: 64, elements: !210, templateParams: !120, identifier: "3b6a8665413826826b9a4de3e47f2de::Some")
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !209, file: !2, baseType: !122, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !5, file: !2, baseType: !213, size: 128, align: 64, offset: 128)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-1", scope: !214, file: !2, size: 128, align: 64, elements: !218, templateParams: !4, identifier: "b12521a9b6a2590a1e721acb740a1c48")
!214 = !DINamespace(name: "spawn", scope: !215)
!215 = !DINamespace(name: "{{impl}}", scope: !216)
!216 = !DINamespace(name: "thread", scope: !217)
!217 = !DINamespace(name: "crossbeam_utils", scope: null)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !213, file: !2, baseType: !220, size: 128, align: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<FnOnce<()>, alloc::alloc::Global>", scope: !221, file: !2, size: 128, align: 64, elements: !223, templateParams: !231, identifier: "eacb77bd65acd364bf86710b8847d327")
!221 = !DINamespace(name: "function", scope: !222)
!222 = !DINamespace(name: "ops", scope: !23)
!223 = !{!224, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !220, file: !2, baseType: !225, size: 64, align: 64, flags: DIFlagArtificial)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !220, file: !2, baseType: !227, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !228, size: 64, align: 64, dwarfAddressSpace: 0)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, align: 64, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 3, lowerBound: 0)
!231 = !{!232, !72}
!232 = !DITemplateTypeParameter(name: "T", type: !233)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "FnOnce<()>", scope: !221, file: !2, align: 8, elements: !234, templateParams: !4, identifier: "6bca4392909bfe11ff485a13ac32afce")
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !233, file: !2, baseType: !225, size: 64, align: 64, flags: DIFlagArtificial)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !233, file: !2, baseType: !227, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !5, file: !2, baseType: !238, size: 64, align: 64, offset: 256)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>", scope: !16, file: !2, size: 64, align: 64, elements: !239, templateParams: !296, identifier: "9f69d4a4ef5bfc588f581d4ebf813744")
!239 = !{!240, !300}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !238, file: !2, baseType: !241, size: 64, align: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>>", scope: !21, file: !2, size: 64, align: 64, elements: !242, templateParams: !298, identifier: "deb976d1bb0f133e122a9faf82b49a61")
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !241, file: !2, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>", baseType: !245, size: 64, align: 64, dwarfAddressSpace: 0)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>", scope: !16, file: !2, size: 320, align: 64, elements: !246, templateParams: !296, identifier: "7d2738a5786756e64da99362bb82acbf")
!246 = !{!247, !248, !249}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !245, file: !2, baseType: !30, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !245, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !245, file: !2, baseType: !250, size: 192, align: 64, offset: 128)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>", scope: !36, file: !2, size: 192, align: 64, elements: !251, templateParams: !294, identifier: "6a49dbd04fb2d16b9086c9bedbef4dfd")
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !250, file: !2, baseType: !253, size: 192, align: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>", scope: !48, file: !2, size: 192, align: 64, elements: !254, identifier: "dc31879507e16af2bf7b272532e6045f")
!254 = !{!255}
!255 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 192, align: 64, elements: !256, templateParams: !259, identifier: "dc31879507e16af2bf7b272532e6045f_variant_part", discriminator: !79)
!256 = !{!257, !290}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !255, file: !2, baseType: !258, size: 192, align: 64, extraData: i64 0)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !253, file: !2, size: 192, align: 64, elements: !4, templateParams: !259, identifier: "dc31879507e16af2bf7b272532e6045f::None")
!259 = !{!260}
!260 = !DITemplateTypeParameter(name: "T", type: !261)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>", scope: !262, file: !2, size: 128, align: 64, elements: !263, identifier: "28373595b4cd722276284465e2329572")
!262 = !DINamespace(name: "result", scope: !23)
!263 = !{!264}
!264 = !DICompositeType(tag: DW_TAG_variant_part, scope: !262, file: !2, size: 128, align: 64, elements: !265, templateParams: !271, identifier: "28373595b4cd722276284465e2329572_variant_part", discriminator: !289)
!265 = !{!266, !285}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !264, file: !2, baseType: !267, size: 128, align: 64, extraData: i64 0)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !261, file: !2, size: 128, align: 64, elements: !268, templateParams: !271, identifier: "28373595b4cd722276284465e2329572::Ok")
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !267, file: !2, baseType: !270, align: 8)
!270 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!271 = !{!272, !273}
!272 = !DITemplateTypeParameter(name: "T", type: !270)
!273 = !DITemplateTypeParameter(name: "E", type: !274)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<Any, alloc::alloc::Global>", scope: !275, file: !2, size: 128, align: 64, elements: !276, templateParams: !279, identifier: "7a2d7e7761ee0eb44bd8f9a39c252beb")
!275 = !DINamespace(name: "any", scope: !23)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !274, file: !2, baseType: !225, size: 64, align: 64, flags: DIFlagArtificial)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !274, file: !2, baseType: !227, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!279 = !{!280, !72}
!280 = !DITemplateTypeParameter(name: "T", type: !281)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "Any", scope: !275, file: !2, align: 8, elements: !282, templateParams: !4, identifier: "6a6e53963d294fb9bcb67b6a5aee5592")
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !281, file: !2, baseType: !225, size: 64, align: 64, flags: DIFlagArtificial)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !281, file: !2, baseType: !227, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !264, file: !2, baseType: !286, size: 128, align: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !261, file: !2, size: 128, align: 64, elements: !287, templateParams: !271, identifier: "28373595b4cd722276284465e2329572::Err")
!287 = !{!288}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !286, file: !2, baseType: !274, size: 128, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !262, file: !2, baseType: !80, size: 64, align: 64, flags: DIFlagArtificial)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !255, file: !2, baseType: !291, size: 192, align: 64, extraData: i64 1)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !253, file: !2, size: 192, align: 64, elements: !292, templateParams: !259, identifier: "dc31879507e16af2bf7b272532e6045f::Some")
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !291, file: !2, baseType: !261, size: 128, align: 64, offset: 64)
!294 = !{!295}
!295 = !DITemplateTypeParameter(name: "T", type: !253)
!296 = !{!297}
!297 = !DITemplateTypeParameter(name: "T", type: !250)
!298 = !{!299}
!299 = !DITemplateTypeParameter(name: "T", type: !245)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !238, file: !2, baseType: !301, align: 8)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !298, identifier: "8affee3a4ee64d6bb58b62b8041baeef")
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !305, identifier: "vtable")
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !214, file: !2, size: 384, align: 64, elements: !306, templateParams: !4, identifier: "9da7376a42351880fd6c0f9561598859")
!306 = !{!307, !493, !503}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !305, file: !2, baseType: !308, size: 128, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scope", scope: !216, file: !2, size: 128, align: 64, elements: !309, templateParams: !4, identifier: "675761792fa898e083ef85980e5c6114")
!309 = !{!310, !425, !487}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !308, file: !2, baseType: !311, size: 64, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>>", scope: !16, file: !2, size: 64, align: 64, elements: !312, templateParams: !419, identifier: "94b0a0d9a5a2a594a5de5b04f0f5ccdd")
!312 = !{!313, !423}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !311, file: !2, baseType: !314, size: 64, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>>>", scope: !21, file: !2, size: 64, align: 64, elements: !315, templateParams: !421, identifier: "27a304c28f1d91bed221f53840dad85")
!315 = !{!316}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !314, file: !2, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>>", baseType: !318, size: 64, align: 64, dwarfAddressSpace: 0)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>>", scope: !16, file: !2, size: 448, align: 64, elements: !319, templateParams: !419, identifier: "69fd8fe0d175bf97b26557e4af231fd")
!319 = !{!320, !321, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !318, file: !2, baseType: !30, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !318, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !2, baseType: !323, size: 320, align: 64, offset: 128)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>", scope: !135, file: !2, size: 320, align: 64, elements: !324, templateParams: !417, identifier: "c5ab3d9150010eafce464b9083ff7299")
!324 = !{!325, !326, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !323, file: !2, baseType: !139, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !323, file: !2, baseType: !166, size: 8, align: 8, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !323, file: !2, baseType: !328, size: 192, align: 64, offset: 128)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>", scope: !36, file: !2, size: 192, align: 64, elements: !329, templateParams: !417, identifier: "5aaa6e400038c4f3c27666af69727a3")
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !328, file: !2, baseType: !331, size: 192, align: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>", scope: !183, file: !2, size: 192, align: 64, elements: !332, templateParams: !415, identifier: "13592408c7aceeb5396379859170831c")
!332 = !{!333, !416}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !331, file: !2, baseType: !334, size: 128, align: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>", scope: !187, file: !2, size: 128, align: 64, elements: !335, templateParams: !415, identifier: "3167d70d5017d8b9608dea2c15bb2a12")
!335 = !{!336, !413, !414}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !334, file: !2, baseType: !337, size: 64, align: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>>", scope: !191, file: !2, size: 64, align: 64, elements: !338, templateParams: !411, identifier: "5b712f686a44f7f85d0c03d54242ecd1")
!338 = !{!339, !409}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !337, file: !2, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>", baseType: !341, size: 64, align: 64, dwarfAddressSpace: 0)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>", scope: !16, file: !2, size: 64, align: 64, elements: !342, templateParams: !403, identifier: "c34170e2b7397ac2b7aa10138acfeaec")
!342 = !{!343, !407}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !341, file: !2, baseType: !344, size: 64, align: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>>", scope: !21, file: !2, size: 64, align: 64, elements: !345, templateParams: !405, identifier: "97188da856a6b178cafd4dbb643855bb")
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !344, file: !2, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>", baseType: !348, size: 64, align: 64, dwarfAddressSpace: 0)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>", scope: !16, file: !2, size: 512, align: 64, elements: !349, templateParams: !403, identifier: "669a4fc78d1e841d31ec44de757b41cb")
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !348, file: !2, baseType: !30, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !348, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !348, file: !2, baseType: !353, size: 384, align: 64, offset: 128)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<core::option::Option<std::thread::JoinHandle<()>>>", scope: !135, file: !2, size: 384, align: 64, elements: !354, templateParams: !401, identifier: "88f5d84c12b1d925f8c0526533faa393")
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !353, file: !2, baseType: !139, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !353, file: !2, baseType: !166, size: 8, align: 8, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !353, file: !2, baseType: !358, size: 256, align: 64, offset: 128)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<std::thread::JoinHandle<()>>>", scope: !36, file: !2, size: 256, align: 64, elements: !359, templateParams: !401, identifier: "a3a05e3aada23b6e34f61c1de6074804")
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !358, file: !2, baseType: !361, size: 256, align: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::thread::JoinHandle<()>>", scope: !48, file: !2, size: 256, align: 64, elements: !362, identifier: "885b8f095cf62fbae94245c0cde41b5f")
!362 = !{!363}
!363 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 256, align: 64, elements: !364, templateParams: !367, identifier: "885b8f095cf62fbae94245c0cde41b5f_variant_part", discriminator: !79)
!364 = !{!365, !397}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !363, file: !2, baseType: !366, size: 256, align: 64, extraData: i64 2)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !361, file: !2, size: 256, align: 64, elements: !4, templateParams: !367, identifier: "885b8f095cf62fbae94245c0cde41b5f::None")
!367 = !{!368}
!368 = !DITemplateTypeParameter(name: "T", type: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "JoinHandle<()>", scope: !8, file: !2, size: 256, align: 64, elements: !370, templateParams: !396, identifier: "7105ea849023e901e9ff016e54ed4ef2")
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !369, file: !2, baseType: !372, size: 256, align: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "JoinInner<()>", scope: !8, file: !2, size: 256, align: 64, elements: !373, templateParams: !396, identifier: "3ceff58d1fd35a352044c9c981894938")
!373 = !{!374, !391, !392}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "native", scope: !372, file: !2, baseType: !375, size: 128, align: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::sys::unix::thread::Thread>", scope: !48, file: !2, size: 128, align: 64, elements: !376, identifier: "95cf2de7b77abb14442eeeee7cfba55b")
!376 = !{!377}
!377 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 128, align: 64, elements: !378, templateParams: !381, identifier: "95cf2de7b77abb14442eeeee7cfba55b_variant_part", discriminator: !79)
!378 = !{!379, !387}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !377, file: !2, baseType: !380, size: 128, align: 64, extraData: i64 0)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !375, file: !2, size: 128, align: 64, elements: !4, templateParams: !381, identifier: "95cf2de7b77abb14442eeeee7cfba55b::None")
!381 = !{!382}
!382 = !DITemplateTypeParameter(name: "T", type: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !384, file: !2, size: 64, align: 64, elements: !385, templateParams: !4, identifier: "e23938bcdc3b85e56eb075b787625892")
!384 = !DINamespace(name: "thread", scope: !146)
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !383, file: !2, baseType: !80, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !377, file: !2, baseType: !388, size: 128, align: 64, extraData: i64 1)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !375, file: !2, size: 128, align: 64, elements: !389, templateParams: !381, identifier: "95cf2de7b77abb14442eeeee7cfba55b::Some")
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !388, file: !2, baseType: !383, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !372, file: !2, baseType: !12, size: 64, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !372, file: !2, baseType: !393, size: 64, align: 64, offset: 192)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<()>", scope: !8, file: !2, size: 64, align: 64, elements: !394, templateParams: !396, identifier: "14586c47815c9edcd8bbe9c6704fdf9a")
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !393, file: !2, baseType: !238, size: 64, align: 64)
!396 = !{!272}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !363, file: !2, baseType: !398, size: 256, align: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !361, file: !2, size: 256, align: 64, elements: !399, templateParams: !367, identifier: "885b8f095cf62fbae94245c0cde41b5f::Some")
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !398, file: !2, baseType: !369, size: 256, align: 64)
!401 = !{!402}
!402 = !DITemplateTypeParameter(name: "T", type: !361)
!403 = !{!404}
!404 = !DITemplateTypeParameter(name: "T", type: !353)
!405 = !{!406}
!406 = !DITemplateTypeParameter(name: "T", type: !348)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !341, file: !2, baseType: !408, align: 8)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !405, identifier: "750c4b770718988ecf6a78b2b6108fe6")
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !337, file: !2, baseType: !410, align: 8)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !411, identifier: "fb287aa14eaf90af5554ed592d876168")
!411 = !{!412}
!412 = !DITemplateTypeParameter(name: "T", type: !341)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !334, file: !2, baseType: !39, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !334, file: !2, baseType: !73, align: 8)
!415 = !{!412, !72}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !331, file: !2, baseType: !39, size: 64, align: 64, offset: 128)
!417 = !{!418}
!418 = !DITemplateTypeParameter(name: "T", type: !331)
!419 = !{!420}
!420 = !DITemplateTypeParameter(name: "T", type: !323)
!421 = !{!422}
!422 = !DITemplateTypeParameter(name: "T", type: !318)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !311, file: !2, baseType: !424, align: 8)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !421, identifier: "84332033a45ebc5dac6bc152a354c0d9")
!425 = !DIDerivedType(tag: DW_TAG_member, name: "wait_group", scope: !308, file: !2, baseType: !426, size: 64, align: 64, offset: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "WaitGroup", scope: !427, file: !2, size: 64, align: 64, elements: !429, templateParams: !4, identifier: "2acb2cd667a74e584b0af5cccc27a5e7")
!427 = !DINamespace(name: "wait_group", scope: !428)
!428 = !DINamespace(name: "sync", scope: !217)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !426, file: !2, baseType: !431, size: 64, align: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<crossbeam_utils::sync::wait_group::Inner>", scope: !16, file: !2, size: 64, align: 64, elements: !432, templateParams: !481, identifier: "6f926c18b0122b0fcb77a75a52f38876")
!432 = !{!433, !485}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !431, file: !2, baseType: !434, size: 64, align: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<crossbeam_utils::sync::wait_group::Inner>>", scope: !21, file: !2, size: 64, align: 64, elements: !435, templateParams: !483, identifier: "376012d048d94b8a817cb460e80c5dca")
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !434, file: !2, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<crossbeam_utils::sync::wait_group::Inner>", baseType: !438, size: 64, align: 64, dwarfAddressSpace: 0)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<crossbeam_utils::sync::wait_group::Inner>", scope: !16, file: !2, size: 448, align: 64, elements: !439, templateParams: !481, identifier: "376c33fc7e6cb83981a063c18a4341a7")
!439 = !{!440, !441, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !438, file: !2, baseType: !30, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !438, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !438, file: !2, baseType: !443, size: 320, align: 64, offset: 128)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !427, file: !2, size: 320, align: 64, elements: !444, templateParams: !4, identifier: "2dec7db462f2692a33bf9b28e4ca4b11")
!444 = !{!445, !475}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cvar", scope: !443, file: !2, baseType: !446, size: 128, align: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !447, file: !2, size: 128, align: 64, elements: !448, templateParams: !4, identifier: "c8540866219c437de5b41e2316c1433f")
!447 = !DINamespace(name: "condvar", scope: !136)
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !446, file: !2, baseType: !450, size: 128, align: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !451, file: !2, size: 128, align: 64, elements: !452, templateParams: !4, identifier: "b3c0c4e16bb2304b107658b8e54b33d6")
!451 = !DINamespace(name: "condvar", scope: !94)
!452 = !{!453, !470}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !450, file: !2, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::sys::unix::condvar::Condvar, alloc::alloc::Global>", baseType: !455, size: 64, align: 64, dwarfAddressSpace: 0)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !456, file: !2, size: 384, align: 64, elements: !457, templateParams: !4, identifier: "b9fa746dd3044c5ec9fd1cd9c76d358e")
!456 = !DINamespace(name: "condvar", scope: !146)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !455, file: !2, baseType: !459, size: 384, align: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<libc::unix::linux_like::linux::pthread_cond_t>", scope: !36, file: !2, size: 384, align: 64, elements: !460, templateParams: !468, identifier: "6a72a6256ba969b649833968f479da13")
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !459, file: !2, baseType: !462, size: 384, align: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_cond_t", scope: !154, file: !2, size: 384, align: 64, elements: !463, templateParams: !4, identifier: "be881df7d9f03834765f2fd2d1091b08")
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !462, file: !2, baseType: !465, size: 384, align: 8)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 384, align: 8, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 48, lowerBound: 0)
!468 = !{!469}
!469 = !DITemplateTypeParameter(name: "T", type: !462)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !450, file: !2, baseType: !471, size: 64, align: 64, offset: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "SameMutexCheck", scope: !472, file: !2, size: 64, align: 64, elements: !473, templateParams: !4, identifier: "29dd7d84624247479cb3855110d2102b")
!472 = !DINamespace(name: "check", scope: !451)
!473 = !{!474}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !471, file: !2, baseType: !30, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !443, file: !2, baseType: !476, size: 192, align: 64, offset: 128)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<usize>", scope: !135, file: !2, size: 192, align: 64, elements: !477, templateParams: !40, identifier: "921201153a98fe96e4850072306bcc2c")
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !476, file: !2, baseType: !139, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !476, file: !2, baseType: !166, size: 8, align: 8, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !476, file: !2, baseType: !35, size: 64, align: 64, offset: 128)
!481 = !{!482}
!482 = !DITemplateTypeParameter(name: "T", type: !443)
!483 = !{!484}
!484 = !DITemplateTypeParameter(name: "T", type: !438)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !431, file: !2, baseType: !486, align: 8)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<crossbeam_utils::sync::wait_group::Inner>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !483, identifier: "1fa4da035b486f676501881819b3e52a")
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !308, file: !2, baseType: !488, align: 8)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&mut &()>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !489, identifier: "929453621c01625141f9705b71553a00")
!489 = !{!490}
!490 = !DITemplateTypeParameter(name: "T", type: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &()", baseType: !492, size: 64, align: 64, dwarfAddressSpace: 0)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !270, size: 64, align: 64, dwarfAddressSpace: 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !305, file: !2, baseType: !494, size: 192, align: 64, offset: 128)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !495, file: !2, size: 192, align: 64, elements: !498, templateParams: !4, identifier: "8e8868c3d5bbe679f6193617521ac5bd")
!495 = !DINamespace(name: "{{closure}}", scope: !496)
!496 = !DINamespace(name: "main", scope: !497)
!497 = !DINamespace(name: "crossbeam_scope", scope: null)
!498 = !{!499, !501, !502}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !494, file: !2, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut i32", baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !494, file: !2, baseType: !500, size: 64, align: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !494, file: !2, baseType: !500, size: 64, align: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !305, file: !2, baseType: !504, size: 64, align: 64, offset: 320)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<core::option::Option<()>>>", scope: !16, file: !2, size: 64, align: 64, elements: !505, templateParams: !530, identifier: "d27f172346c70bd1e4ac0c2c0c072e5e")
!505 = !{!506, !534}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !504, file: !2, baseType: !507, size: 64, align: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<core::option::Option<()>>>>", scope: !21, file: !2, size: 64, align: 64, elements: !508, templateParams: !532, identifier: "61d9c2506e3f8ce9c7e0111696c19064")
!508 = !{!509}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !507, file: !2, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<core::option::Option<()>>>", baseType: !511, size: 64, align: 64, dwarfAddressSpace: 0)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<core::option::Option<()>>>", scope: !16, file: !2, size: 256, align: 64, elements: !512, templateParams: !530, identifier: "8fa9d921fe8f24514195afbfc370f161")
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !511, file: !2, baseType: !30, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !511, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !511, file: !2, baseType: !516, size: 128, align: 64, offset: 128)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<core::option::Option<()>>", scope: !135, file: !2, size: 128, align: 64, elements: !517, templateParams: !528, identifier: "4491c06e9814d95e8516c1ac86e7b352")
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !516, file: !2, baseType: !139, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !516, file: !2, baseType: !166, size: 8, align: 8, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !516, file: !2, baseType: !521, size: 8, align: 8, offset: 72)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<()>>", scope: !36, file: !2, size: 8, align: 8, elements: !522, templateParams: !528, identifier: "63235a8f0137564925f16613da8663fb")
!522 = !{!523}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !521, file: !2, baseType: !524, size: 8, align: 8)
!524 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Option", scope: !48, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !525)
!525 = !{!526, !527}
!526 = !DIEnumerator(name: "None", value: 0)
!527 = !DIEnumerator(name: "Some", value: 1)
!528 = !{!529}
!529 = !DITemplateTypeParameter(name: "T", type: !524)
!530 = !{!531}
!531 = !DITemplateTypeParameter(name: "T", type: !516)
!532 = !{!533}
!533 = !DITemplateTypeParameter(name: "T", type: !511)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !504, file: !2, baseType: !535, align: 8)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<core::option::Option<()>>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !532, identifier: "2f16a39b1282a58bb2a21b7d34d21ee4")
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !539, identifier: "vtable")
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !540, file: !2, size: 64, align: 64, elements: !542, templateParams: !4, identifier: "45a67288d5b86a44fe74bb43f5c1fa66")
!540 = !DINamespace(name: "lang_start", scope: !541)
!541 = !DINamespace(name: "rt", scope: !9)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !539, file: !2, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !545, size: 64, align: 64, dwarfAddressSpace: 0)
!545 = !DISubroutineType(types: !546)
!546 = !{null}
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !549, isLocal: true, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !550, identifier: "vtable")
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::boxed::Box<Any, alloc::alloc::Global>, alloc::alloc::Global>", scope: !183, file: !2, size: 192, align: 64, elements: !551, templateParams: !566, identifier: "b51b867644ff22a8a0a42020f52ded0b")
!551 = !{!552, !567}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !550, file: !2, baseType: !553, size: 128, align: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::boxed::Box<Any, alloc::alloc::Global>, alloc::alloc::Global>", scope: !187, file: !2, size: 128, align: 64, elements: !554, templateParams: !566, identifier: "bc803f55f1848d47bbb5d3fc9cad10c1")
!554 = !{!555, !564, !565}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !553, file: !2, baseType: !556, size: 64, align: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<alloc::boxed::Box<Any, alloc::alloc::Global>>", scope: !191, file: !2, size: 64, align: 64, elements: !557, templateParams: !562, identifier: "dc3b743e7159d3027244ba75123179b2")
!557 = !{!558, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !556, file: !2, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::boxed::Box<Any, alloc::alloc::Global>", baseType: !274, size: 64, align: 64, dwarfAddressSpace: 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !556, file: !2, baseType: !561, align: 8)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::boxed::Box<Any, alloc::alloc::Global>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !562, identifier: "b848b133fd1699d8c039c85a7072877")
!562 = !{!563}
!563 = !DITemplateTypeParameter(name: "T", type: !274)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !553, file: !2, baseType: !39, size: 64, align: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !553, file: !2, baseType: !73, align: 8)
!566 = !{!563, !72}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !550, file: !2, baseType: !39, size: 64, align: 64, offset: 128)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !571, identifier: "vtable")
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !572, file: !2, size: 128, align: 64, elements: !574, templateParams: !4, identifier: "5a17b0ef287fbce5f29d1ac12e27ed3d")
!572 = !DINamespace(name: "error", scope: !573)
!573 = !DINamespace(name: "io", scope: !9)
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !571, file: !2, baseType: !576, size: 128, align: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !572, file: !2, size: 128, align: 64, elements: !577, identifier: "6bac17bb1ce229d75eed89e4a55bfcf4")
!577 = !{!578}
!578 = !DICompositeType(tag: DW_TAG_variant_part, scope: !572, file: !2, size: 128, align: 64, elements: !579, templateParams: !4, identifier: "6bac17bb1ce229d75eed89e4a55bfcf4_variant_part", discriminator: !628)
!579 = !{!580, !584, !608}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !578, file: !2, baseType: !581, size: 128, align: 64, extraData: i64 0)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !576, file: !2, size: 128, align: 64, elements: !582, templateParams: !4, identifier: "6bac17bb1ce229d75eed89e4a55bfcf4::Os")
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !581, file: !2, baseType: !103, size: 32, align: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !578, file: !2, baseType: !585, size: 128, align: 64, extraData: i64 1)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !576, file: !2, size: 128, align: 64, elements: !586, templateParams: !4, identifier: "6bac17bb1ce229d75eed89e4a55bfcf4::Simple")
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !585, file: !2, baseType: !588, size: 8, align: 8, offset: 8)
!588 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !572, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!590 = !DIEnumerator(name: "NotFound", value: 0)
!591 = !DIEnumerator(name: "PermissionDenied", value: 1)
!592 = !DIEnumerator(name: "ConnectionRefused", value: 2)
!593 = !DIEnumerator(name: "ConnectionReset", value: 3)
!594 = !DIEnumerator(name: "ConnectionAborted", value: 4)
!595 = !DIEnumerator(name: "NotConnected", value: 5)
!596 = !DIEnumerator(name: "AddrInUse", value: 6)
!597 = !DIEnumerator(name: "AddrNotAvailable", value: 7)
!598 = !DIEnumerator(name: "BrokenPipe", value: 8)
!599 = !DIEnumerator(name: "AlreadyExists", value: 9)
!600 = !DIEnumerator(name: "WouldBlock", value: 10)
!601 = !DIEnumerator(name: "InvalidInput", value: 11)
!602 = !DIEnumerator(name: "InvalidData", value: 12)
!603 = !DIEnumerator(name: "TimedOut", value: 13)
!604 = !DIEnumerator(name: "WriteZero", value: 14)
!605 = !DIEnumerator(name: "Interrupted", value: 15)
!606 = !DIEnumerator(name: "Other", value: 16)
!607 = !DIEnumerator(name: "UnexpectedEof", value: 17)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !578, file: !2, baseType: !609, size: 128, align: 64, extraData: i64 2)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !576, file: !2, size: 128, align: 64, elements: !610, templateParams: !4, identifier: "6bac17bb1ce229d75eed89e4a55bfcf4::Custom")
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !609, file: !2, baseType: !612, size: 64, align: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !613, size: 64, align: 64, dwarfAddressSpace: 0)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !572, file: !2, size: 192, align: 64, elements: !614, templateParams: !4, identifier: "4305bec694781162c6b0aa19d9e116f2")
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !613, file: !2, baseType: !588, size: 8, align: 8, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !613, file: !2, baseType: !617, size: 128, align: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<Error, alloc::alloc::Global>", scope: !618, file: !2, size: 128, align: 64, elements: !619, templateParams: !622, identifier: "35b35d15944c826bd8cb869652d3c7e7")
!618 = !DINamespace(name: "error", scope: !9)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !617, file: !2, baseType: !225, size: 64, align: 64, flags: DIFlagArtificial)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !617, file: !2, baseType: !227, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!622 = !{!623, !72}
!623 = !DITemplateTypeParameter(name: "T", type: !624)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !618, file: !2, align: 8, elements: !625, templateParams: !4, identifier: "959a42dde6f89d186f860f7442dc331e")
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !624, file: !2, baseType: !225, size: 64, align: 64, flags: DIFlagArtificial)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !624, file: !2, baseType: !227, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!628 = !DIDerivedType(tag: DW_TAG_member, scope: !572, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagArtificial)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !631, isLocal: true, isDefinition: true)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !632, identifier: "vtable")
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<core::option::Option<std::thread::JoinHandle<()>>>>", scope: !167, file: !2, size: 128, align: 64, elements: !633, templateParams: !644, identifier: "94b952d8c11816ad8ecfcb3983658359")
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !632, file: !2, baseType: !635, size: 128, align: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<core::option::Option<std::thread::JoinHandle<()>>>", scope: !135, file: !2, size: 128, align: 64, elements: !636, templateParams: !401, identifier: "46c2237a960dd6894a2a3659ce9a6cb7")
!636 = !{!637, !639}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !635, file: !2, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>", baseType: !353, size: 64, align: 64, dwarfAddressSpace: 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !635, file: !2, baseType: !640, size: 8, align: 8, offset: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guard", scope: !167, file: !2, size: 8, align: 8, elements: !641, templateParams: !4, identifier: "4e3c4ca40927284c81be83d26d9ac553")
!641 = !{!642}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "panicking", scope: !640, file: !2, baseType: !643, size: 8, align: 8)
!643 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!644 = !{!645}
!645 = !DITemplateTypeParameter(name: "T", type: !635)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !649, identifier: "vtable")
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<core::option::Option<()>>>", scope: !167, file: !2, size: 128, align: 64, elements: !650, templateParams: !657, identifier: "6f74bdc39bbd832bc6e76a43ad53cb87")
!650 = !{!651}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !649, file: !2, baseType: !652, size: 128, align: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<core::option::Option<()>>", scope: !135, file: !2, size: 128, align: 64, elements: !653, templateParams: !528, identifier: "6a9d7759f1d645003f8ae69d6abfe534")
!653 = !{!654, !656}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !652, file: !2, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<core::option::Option<()>>", baseType: !516, size: 64, align: 64, dwarfAddressSpace: 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !652, file: !2, baseType: !640, size: 8, align: 8, offset: 64)
!657 = !{!658}
!658 = !DITemplateTypeParameter(name: "T", type: !652)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !662, identifier: "vtable")
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>>", scope: !167, file: !2, size: 128, align: 64, elements: !663, templateParams: !670, identifier: "a3c88c45d25d26ddd39df69cdc43b79f")
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !662, file: !2, baseType: !665, size: 128, align: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>", scope: !135, file: !2, size: 128, align: 64, elements: !666, templateParams: !417, identifier: "92102d02488eaecbd348a198ec27c48")
!666 = !{!667, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !665, file: !2, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>", baseType: !323, size: 64, align: 64, dwarfAddressSpace: 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !665, file: !2, baseType: !640, size: 8, align: 8, offset: 64)
!670 = !{!671}
!671 = !DITemplateTypeParameter(name: "T", type: !665)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !274, identifier: "vtable")
!675 = !{i32 7, !"PIC Level", i32 2}
!676 = !{i32 7, !"PIE Level", i32 2}
!677 = !{i32 2, !"RtLibUseGOT", i32 1}
!678 = !{i32 2, !"Debug Info Version", i32 3}
!679 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !680, producer: "clang LLVM (rustc version 1.51.0-nightly (e38fb306b 2021-01-14))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !681, globals: !706)
!680 = !DIFile(filename: "src/main.rs", directory: "/home/skeet/Documents/o2_lab/rust/race_examples/crossbeam_scope/target/debug/deps")
!681 = !{!588, !524, !682, !689, !693, !697}
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !31, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !683)
!683 = !{!684, !685, !686, !687, !688}
!684 = !DIEnumerator(name: "Relaxed", value: 0)
!685 = !DIEnumerator(name: "Release", value: 1)
!686 = !DIEnumerator(name: "Acquire", value: 2)
!687 = !DIEnumerator(name: "AcqRel", value: 3)
!688 = !DIEnumerator(name: "SeqCst", value: 4)
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !187, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !690)
!690 = !{!691, !692}
!691 = !DIEnumerator(name: "Uninitialized", value: 0)
!692 = !DIEnumerator(name: "Zeroed", value: 1)
!693 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !262, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !694)
!694 = !{!695, !696}
!695 = !DIEnumerator(name: "Ok", value: 0)
!696 = !DIEnumerator(name: "Err", value: 1)
!697 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !698, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !701)
!698 = !DINamespace(name: "v1", scope: !699)
!699 = !DINamespace(name: "rt", scope: !700)
!700 = !DINamespace(name: "fmt", scope: !23)
!701 = !{!702, !703, !704, !705}
!702 = !DIEnumerator(name: "Left", value: 0)
!703 = !DIEnumerator(name: "Right", value: 1)
!704 = !DIEnumerator(name: "Center", value: 2)
!705 = !DIEnumerator(name: "Unknown", value: 3)
!706 = !{!0, !302, !536, !547, !568, !629, !646, !659, !672}
!707 = distinct !DISubprogram(name: "spawn_unchecked<closure-1,()>", linkageName: "_RINvMNtCs2bNvlddUlXM_3std6threadNtB3_7Builder15spawn_uncheckedNCINvMs1_NtCs48Yq53b35jF_15crossbeam_utils6threadNtB17_19ScopedThreadBuilder5spawnNCNCNvCseZ2WzEtypfB_15crossbeam_scope4main00uEs_0uEB2o_", scope: !709, file: !708, line: 443, type: !739, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !679, templateParams: !779, retainedNodes: !755)
!708 = !DIFile(filename: "/rustc/e38fb306b7f5e65cca34df2dab1f0db15e1defb4/library/std/src/thread/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f26192c994bf4f410829d52b5e501e96")
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "Builder", scope: !8, file: !2, size: 320, align: 64, elements: !710, templateParams: !4, identifier: "b16137263913302cd67d8a5c187f6b38")
!710 = !{!711, !728}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !709, file: !2, baseType: !712, size: 192, align: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::string::String>", scope: !48, file: !2, size: 192, align: 64, elements: !713, identifier: "67027ad9c25424f98f4def2c6ef6fe76")
!713 = !{!714}
!714 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 192, align: 64, elements: !715, templateParams: !718, identifier: "67027ad9c25424f98f4def2c6ef6fe76_variant_part", discriminator: !79)
!715 = !{!716, !724}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !714, file: !2, baseType: !717, size: 192, align: 64, extraData: i64 0)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !712, file: !2, size: 192, align: 64, elements: !4, templateParams: !718, identifier: "67027ad9c25424f98f4def2c6ef6fe76::None")
!718 = !{!719}
!719 = !DITemplateTypeParameter(name: "T", type: !720)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !721, file: !2, size: 192, align: 64, elements: !722, templateParams: !4, identifier: "cfe621014755e10eb2a74f207341053e")
!721 = !DINamespace(name: "string", scope: !17)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !720, file: !2, baseType: !182, size: 192, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !714, file: !2, baseType: !725, size: 192, align: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !712, file: !2, size: 192, align: 64, elements: !726, templateParams: !718, identifier: "67027ad9c25424f98f4def2c6ef6fe76::Some")
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !725, file: !2, baseType: !720, size: 192, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !709, file: !2, baseType: !729, size: 128, align: 64, offset: 192)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !48, file: !2, size: 128, align: 64, elements: !730, identifier: "ea92abe30ac28ff5d83f5e69d0621a6")
!730 = !{!731}
!731 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 128, align: 64, elements: !732, templateParams: !40, identifier: "ea92abe30ac28ff5d83f5e69d0621a6_variant_part", discriminator: !79)
!732 = !{!733, !735}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !731, file: !2, baseType: !734, size: 128, align: 64, extraData: i64 0)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !729, file: !2, size: 128, align: 64, elements: !4, templateParams: !40, identifier: "ea92abe30ac28ff5d83f5e69d0621a6::None")
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !731, file: !2, baseType: !736, size: 128, align: 64, extraData: i64 1)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !729, file: !2, size: 128, align: 64, elements: !737, templateParams: !40, identifier: "ea92abe30ac28ff5d83f5e69d0621a6::Some")
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !736, file: !2, baseType: !39, size: 64, align: 64, offset: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!741, !709, !213}
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<std::thread::JoinHandle<()>, std::io::error::Error>", scope: !262, file: !2, size: 320, align: 64, elements: !742, identifier: "c19e21129de4274471e4d51ffad5d2f8")
!742 = !{!743}
!743 = !DICompositeType(tag: DW_TAG_variant_part, scope: !262, file: !2, size: 320, align: 64, elements: !744, templateParams: !749, identifier: "c19e21129de4274471e4d51ffad5d2f8_variant_part", discriminator: !289)
!744 = !{!745, !751}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !743, file: !2, baseType: !746, size: 320, align: 64, extraData: i64 0)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !741, file: !2, size: 320, align: 64, elements: !747, templateParams: !749, identifier: "c19e21129de4274471e4d51ffad5d2f8::Ok")
!747 = !{!748}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !746, file: !2, baseType: !369, size: 256, align: 64, offset: 64)
!749 = !{!368, !750}
!750 = !DITemplateTypeParameter(name: "E", type: !571)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !743, file: !2, baseType: !752, size: 320, align: 64, extraData: i64 1)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !741, file: !2, size: 320, align: 64, elements: !753, templateParams: !749, identifier: "c19e21129de4274471e4d51ffad5d2f8::Err")
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !752, file: !2, baseType: !571, size: 128, align: 64, offset: 64)
!755 = !{!756, !757, !758, !760, !761, !763, !765, !767, !769, !771, !773, !775, !777}
!756 = !DILocalVariable(name: "self", arg: 1, scope: !707, file: !708, line: 443, type: !709)
!757 = !DILocalVariable(name: "f", arg: 2, scope: !707, file: !708, line: 443, type: !213)
!758 = !DILocalVariable(name: "name", scope: !759, file: !708, line: 449, type: !712, align: 8)
!759 = distinct !DILexicalBlock(scope: !707, file: !708, line: 449, column: 9)
!760 = !DILocalVariable(name: "stack_size", scope: !759, file: !708, line: 449, type: !729, align: 8)
!761 = !DILocalVariable(name: "stack_size", scope: !762, file: !708, line: 451, type: !39, align: 8)
!762 = distinct !DILexicalBlock(scope: !759, file: !708, line: 451, column: 9)
!763 = !DILocalVariable(name: "my_thread", scope: !764, file: !708, line: 453, type: !12, align: 8)
!764 = distinct !DILexicalBlock(scope: !762, file: !708, line: 453, column: 9)
!765 = !DILocalVariable(name: "their_thread", scope: !766, file: !708, line: 454, type: !12, align: 8)
!766 = distinct !DILexicalBlock(scope: !764, file: !708, line: 454, column: 9)
!767 = !DILocalVariable(name: "my_packet", scope: !768, file: !708, line: 456, type: !238, align: 8)
!768 = distinct !DILexicalBlock(scope: !766, file: !708, line: 456, column: 9)
!769 = !DILocalVariable(name: "their_packet", scope: !770, file: !708, line: 457, type: !238, align: 8)
!770 = distinct !DILexicalBlock(scope: !768, file: !708, line: 457, column: 9)
!771 = !DILocalVariable(name: "output_capture", scope: !772, file: !708, line: 459, type: !114, align: 8)
!772 = distinct !DILexicalBlock(scope: !770, file: !708, line: 459, column: 9)
!773 = !DILocalVariable(name: "main", scope: !774, file: !708, line: 462, type: !5, align: 8)
!774 = distinct !DILexicalBlock(scope: !772, file: !708, line: 462, column: 9)
!775 = !DILocalVariable(name: "err", scope: !776, file: !708, line: 503, type: !571, align: 8)
!776 = distinct !DILexicalBlock(scope: !774, file: !708, line: 503, column: 18)
!777 = !DILocalVariable(name: "val", scope: !778, file: !708, line: 498, type: !383, align: 8)
!778 = distinct !DILexicalBlock(scope: !774, file: !708, line: 498, column: 22)
!779 = !{!780, !272}
!780 = !DITemplateTypeParameter(name: "F", type: !213)
!781 = !DILocation(line: 443, column: 45, scope: !707)
!782 = !DILocation(line: 443, column: 51, scope: !707)
!783 = !DILocation(line: 449, column: 23, scope: !759)
!784 = !DILocation(line: 453, column: 13, scope: !764)
!785 = !DILocation(line: 454, column: 13, scope: !766)
!786 = !DILocation(line: 456, column: 13, scope: !768)
!787 = !DILocation(line: 457, column: 13, scope: !770)
!788 = !DILocation(line: 459, column: 13, scope: !772)
!789 = !DILocation(line: 462, column: 13, scope: !774)
!790 = !DILocation(line: 503, column: 18, scope: !776)
!791 = !DILocation(line: 449, column: 23, scope: !707)
!792 = !DILocation(line: 449, column: 29, scope: !707)
!793 = !{i64 0, i64 2}
!794 = !DILocation(line: 449, column: 29, scope: !759)
!795 = !DILocation(line: 451, column: 26, scope: !759)
!796 = !DILocation(line: 451, column: 13, scope: !762)
!797 = !DILocation(line: 453, column: 37, scope: !762)
!798 = !DILocation(line: 453, column: 25, scope: !762)
!799 = !DILocation(line: 454, column: 28, scope: !764)
!800 = !DILocation(line: 454, column: 44, scope: !764)
!801 = !DILocation(line: 456, column: 86, scope: !766)
!802 = !DILocation(line: 456, column: 70, scope: !766)
!803 = !DILocation(line: 456, column: 61, scope: !766)
!804 = !DILocation(line: 457, column: 28, scope: !768)
!805 = !DILocation(line: 457, column: 44, scope: !768)
!806 = !DILocation(line: 459, column: 60, scope: !770)
!807 = !DILocation(line: 459, column: 30, scope: !770)
!808 = !DILocation(line: 459, column: 64, scope: !770)
!809 = !DILocation(line: 460, column: 39, scope: !772)
!810 = !DILocation(line: 460, column: 9, scope: !772)
!811 = !DILocation(line: 460, column: 62, scope: !772)
!812 = !DILocation(line: 462, column: 20, scope: !772)
!813 = !DILocation(line: 501, column: 34, scope: !774)
!814 = !DILocalVariable(name: "x", arg: 1, scope: !815, file: !816, line: 183, type: !5)
!815 = distinct !DISubprogram(name: "new<closure-0>", linkageName: "_RNvMNtCs8RW06R9lH2S_5alloc5boxedINtB2_3BoxNCINvMNtCs2bNvlddUlXM_3std6threadNtBK_7Builder15spawn_uncheckedNCINvMs1_NtCs48Yq53b35jF_15crossbeam_utils6threadNtB1O_19ScopedThreadBuilder5spawnNCNCNvCseZ2WzEtypfB_15crossbeam_scope4main00uEs_0uE0E3newB35_", scope: !817, file: !816, line: 183, type: !819, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !679, templateParams: !823, retainedNodes: !822)
!816 = !DIFile(filename: "/rustc/e38fb306b7f5e65cca34df2dab1f0db15e1defb4/library/alloc/src/boxed.rs", directory: "", checksumkind: CSK_MD5, checksum: "642b07ec25e018ad0c5bd5b89a13146f")
!817 = !DINamespace(name: "{{impl}}", scope: !818)
!818 = !DINamespace(name: "boxed", scope: !17)
!819 = !DISubroutineType(types: !820)
!820 = !{!821, !5}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<closure-0, alloc::alloc::Global>", baseType: !5, size: 64, align: 64, dwarfAddressSpace: 0)
!822 = !{!814}
!823 = !{!824}
!824 = !DITemplateTypeParameter(name: "T", type: !5)
!825 = !DILocation(line: 183, column: 16, scope: !815, inlinedAt: !826)
!826 = distinct !DILocation(line: 501, column: 25, scope: !774)
!827 = !DILocation(line: 184, column: 9, scope: !815, inlinedAt: !826)
!828 = !DILocation(line: 184, column: 13, scope: !815, inlinedAt: !826)
!829 = !DILocation(line: 185, column: 6, scope: !815, inlinedAt: !826)
!830 = !DILocation(line: 501, column: 25, scope: !774)
!831 = !DILocation(line: 500, column: 21, scope: !774)
!832 = !DILocation(line: 498, column: 22, scope: !774)
!833 = !DILocation(line: 503, column: 18, scope: !774)
!834 = !DILocation(line: 498, column: 22, scope: !778)
!835 = !DILocation(line: 498, column: 17, scope: !774)
!836 = !DILocation(line: 505, column: 21, scope: !774)
!837 = !DILocation(line: 506, column: 28, scope: !774)
!838 = !DILocation(line: 506, column: 21, scope: !774)
!839 = !DILocation(line: 483, column: 23, scope: !774)
!840 = !DILocation(line: 483, column: 12, scope: !774)
!841 = !DILocation(line: 483, column: 9, scope: !774)
!842 = !DILocation(line: 508, column: 5, scope: !770)
!843 = !DILocation(line: 508, column: 5, scope: !768)
!844 = !DILocation(line: 508, column: 5, scope: !764)
!845 = !DILocation(line: 508, column: 5, scope: !707)
!846 = !DILocation(line: 498, column: 22, scope: !776)
!847 = !DILocation(line: 508, column: 5, scope: !766)
!848 = !DILocation(line: 508, column: 5, scope: !762)
!849 = !DILocation(line: 508, column: 6, scope: !707)
!850 = !{i8 0, i8 2}
!851 = !DILocation(line: 443, column: 5, scope: !707)
!852 = distinct !DISubprogram(name: "spawn<closure-1,()>", linkageName: "_RINvMNtCs2bNvlddUlXM_3std6threadNtB3_7Builder5spawnNCINvMs1_NtCs48Yq53b35jF_15crossbeam_utils6threadNtBW_19ScopedThreadBuilder5spawnNCNCNvCseZ2WzEtypfB_15crossbeam_scope4main00uEs_0uEB2c_", scope: !709, file: !708, line: 375, type: !739, scopeLine: 375, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !679, templateParams: !779, retainedNodes: !853)
!853 = !{!854, !855}
!854 = !DILocalVariable(name: "self", arg: 1, scope: !852, file: !708, line: 375, type: !709)
!855 = !DILocalVariable(name: "f", arg: 2, scope: !852, file: !708, line: 375, type: !213)
!856 = !DILocation(line: 375, column: 24, scope: !852)
!857 = !DILocation(line: 375, column: 30, scope: !852)
!858 = !DILocation(line: 381, column: 18, scope: !852)
!859 = !DILocation(line: 382, column: 6, scope: !852)
!860 = distinct !DISubprogram(name: "map<&alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>,alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>,closure-0>", linkageName: "_RINvMNtCs3p84KrD9aKt_4core6optionINtB3_6OptionRINtNtCs8RW06R9lH2S_5alloc4sync3ArcINtNtNtCs2bNvlddUlXM_3std4sync5mutex5MutexIBw_INtNtB1o_6thread10JoinHandleuEEEEE3mapBJ_NCNvXs3_NtNtBO_3vec5drainINtB2O_5DrainBJ_ENtNtNtNtB5_4iter6traits8iterator8Iterator4next0ECseZ2WzEtypfB_15crossbeam_scope", scope: !862, file: !861, line: 451, type: !875, scopeLine: 451, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !679, templateParams: !896, retainedNodes: !891)
!861 = !DIFile(filename: "/rustc/e38fb306b7f5e65cca34df2dab1f0db15e1defb4/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "bf7fc38cde9f1dd32b300f1d80413818")
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>>", scope: !48, file: !2, size: 64, align: 64, elements: !863, identifier: "ba0c387ba53f1ba3dbd219c51ebdcdd")
!863 = !{!864}
!864 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 64, align: 64, elements: !865, templateParams: !868, identifier: "ba0c387ba53f1ba3dbd219c51ebdcdd_variant_part", discriminator: !79)
!865 = !{!866, !871}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !864, file: !2, baseType: !867, size: 64, align: 64, extraData: i64 0)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !862, file: !2, size: 64, align: 64, elements: !4, templateParams: !868, identifier: "ba0c387ba53f1ba3dbd219c51ebdcdd::None")
!868 = !{!869}
!869 = !DITemplateTypeParameter(name: "T", type: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>", baseType: !341, size: 64, align: 64, dwarfAddressSpace: 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !864, file: !2, baseType: !872, size: 64, align: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !862, file: !2, size: 64, align: 64, elements: !873, templateParams: !868, identifier: "ba0c387ba53f1ba3dbd219c51ebdcdd::Some")
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !872, file: !2, baseType: !870, size: 64, align: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!877, !862, !887}
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>>", scope: !48, file: !2, size: 64, align: 64, elements: !878, identifier: "46f4c6eab037fec09c120b79c1fc119d")
!878 = !{!879}
!879 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 64, align: 64, elements: !880, templateParams: !411, identifier: "46f4c6eab037fec09c120b79c1fc119d_variant_part", discriminator: !79)
!880 = !{!881, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !879, file: !2, baseType: !882, size: 64, align: 64, extraData: i64 0)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !877, file: !2, size: 64, align: 64, elements: !4, templateParams: !411, identifier: "46f4c6eab037fec09c120b79c1fc119d::None")
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !879, file: !2, baseType: !884, size: 64, align: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !877, file: !2, size: 64, align: 64, elements: !885, templateParams: !411, identifier: "46f4c6eab037fec09c120b79c1fc119d::Some")
!885 = !{!886}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !884, file: !2, baseType: !341, size: 64, align: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !888, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "4d6b83ce5c4faa3cae584c8c35a981fd")
!888 = !DINamespace(name: "next", scope: !889)
!889 = !DINamespace(name: "{{impl}}", scope: !890)
!890 = !DINamespace(name: "drain", scope: !183)
!891 = !{!892, !893, !894}
!892 = !DILocalVariable(name: "self", arg: 1, scope: !860, file: !861, line: 451, type: !862)
!893 = !DILocalVariable(name: "f", arg: 2, scope: !860, file: !861, line: 451, type: !887)
!894 = !DILocalVariable(name: "x", scope: !895, file: !861, line: 453, type: !870, align: 8)
!895 = distinct !DILexicalBlock(scope: !860, file: !861, line: 453, column: 13)
!896 = !{!869, !897, !898}
!897 = !DITemplateTypeParameter(name: "U", type: !341)
!898 = !DITemplateTypeParameter(name: "F", type: !887)
!899 = !DILocation(line: 451, column: 38, scope: !860)
!900 = !DILocation(line: 451, column: 44, scope: !860)
!901 = !DILocation(line: 453, column: 13, scope: !860)
!902 = !DILocation(line: 454, column: 21, scope: !860)
!903 = !DILocation(line: 452, column: 9, scope: !860)
!904 = !DILocation(line: 452, column: 15, scope: !860)
!905 = !DILocation(line: 453, column: 18, scope: !860)
!906 = !DILocation(line: 453, column: 18, scope: !895)
!907 = !DILocation(line: 453, column: 29, scope: !895)
!908 = !DILocation(line: 453, column: 24, scope: !895)
!909 = !DILocation(line: 456, column: 5, scope: !860)
!910 = !DILocation(line: 456, column: 6, scope: !860)
!911 = !DILocation(line: 451, column: 5, scope: !860)
!912 = distinct !DISubprogram(name: "unwrap_or_else<usize,closure-0>", linkageName: "_RINvMNtCs3p84KrD9aKt_4core6optionINtB3_6OptionjE14unwrap_or_elseNCNvYNtNtNtB5_3ops5range9RangeFullINtB17_11RangeBoundsjE10assert_len0ECseZ2WzEtypfB_15crossbeam_scope", scope: !729, file: !861, line: 424, type: !913, scopeLine: 424, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !679, templateParams: !924, retainedNodes: !919)
!913 = !DISubroutineType(types: !914)
!914 = !{!39, !729, !915}
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !916, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "a375dc9078ade366f2ed6aaff87bef82")
!916 = !DINamespace(name: "assert_len", scope: !917)
!917 = !DINamespace(name: "RangeBounds", scope: !918)
!918 = !DINamespace(name: "range", scope: !222)
!919 = !{!920, !921, !922}
!920 = !DILocalVariable(name: "self", arg: 1, scope: !912, file: !861, line: 424, type: !729)
!921 = !DILocalVariable(name: "f", arg: 2, scope: !912, file: !861, line: 424, type: !915)
!922 = !DILocalVariable(name: "x", scope: !923, file: !861, line: 426, type: !39, align: 8)
!923 = distinct !DILexicalBlock(scope: !912, file: !861, line: 426, column: 13)
!924 = !{!41, !925}
!925 = !DITemplateTypeParameter(name: "F", type: !915)
!926 = !DILocation(line: 424, column: 45, scope: !912)
!927 = !DILocation(line: 424, column: 51, scope: !912)
!928 = !DILocation(line: 426, column: 13, scope: !912)
!929 = !DILocation(line: 427, column: 21, scope: !912)
!930 = !DILocation(line: 425, column: 15, scope: !912)
!931 = !DILocation(line: 426, column: 18, scope: !912)
!932 = !DILocation(line: 426, column: 18, scope: !923)
!933 = !DILocation(line: 426, column: 24, scope: !923)
!934 = !DILocation(line: 425, column: 9, scope: !912)
!935 = !DILocation(line: 429, column: 6, scope: !912)
!936 = !DILocation(line: 429, column: 5, scope: !912)
!937 = !DILocation(line: 424, column: 5, scope: !912)
!938 = distinct !DISubprogram(name: "unwrap_or_else<usize,closure-1>", linkageName: "_RINvMNtCs3p84KrD9aKt_4core6optionINtB3_6OptionjE14unwrap_or_elseNCNvYNtNtNtB5_3ops5range9RangeFullINtB17_11RangeBoundsjE10assert_lens_0ECseZ2WzEtypfB_15crossbeam_scope", scope: !729, file: !861, line: 424, type: !939, scopeLine: 424, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !679, templateParams: !947, retainedNodes: !942)
!939 = !DISubroutineType(types: !940)
!940 = !{!39, !729, !941}
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-1", scope: !916, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "2fece91d00d841634e3986ed2d6f7c2")
!942 = !{!943, !944, !945}
!943 = !DILocalVariable(name: "self", arg: 1, scope: !938, file: !861, line: 424, type: !729)
!944 = !DILocalVariable(name: "f", arg: 2, scope: !938, file: !861, line: 424, type: !941)
!945 = !DILocalVariable(name: "x", scope: !946, file: !861, line: 426, type: !39, align: 8)
!946 = distinct !DILexicalBlock(scope: !938, file: !861, line: 426, column: 13)
!947 = !{!41, !948}
!948 = !DITemplateTypeParameter(name: "F", type: !941)
!949 = !DILocation(line: 424, column: 45, scope: !938)
!950 = !DILocation(line: 424, column: 51, scope: !938)
!951 = !DILocation(line: 426, column: 13, scope: !938)
!952 = !DILocation(line: 427, column: 21, scope: !938)
!953 = !DILocation(line: 425, column: 15, scope: !938)
!954 = !DILocation(line: 426, column: 18, scope: !938)
!955 = !DILocation(line: 426, column: 18, scope: !946)
!956 = !DILocation(line: 426, column: 24, scope: !946)
!957 = !DILocation(line: 425, column: 9, scope: !938)
!958 = !DILocation(line: 429, column: 6, scope: !938)
!959 = !DILocation(line: 429, column: 5, scope: !938)
!960 = !DILocation(line: 424, column: 5, scope: !938)
!961 = distinct !DISubprogram(name: "unwrap_or_else<usize,fn() -> usize>", linkageName: "_RINvMNtCs3p84KrD9aKt_4core6optionINtB3_6OptionjE14unwrap_or_elseNvNtNtCs2bNvlddUlXM_3std10sys_common6thread9min_stackECseZ2WzEtypfB_15crossbeam_scope", scope: !729, file: !861, line: 424, type: !962, scopeLine: 424, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !679, templateParams: !972, retainedNodes: !967)
!962 = !DISubroutineType(types: !963)
!963 = !{!39, !729, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> usize", baseType: !965, align: 8, dwarfAddressSpace: 0)
!965 = !DISubroutineType(types: !966)
!966 = !{!39}
!967 = !{!968, !969, !970}
!968 = !DILocalVariable(name: "self", arg: 1, scope: !961, file: !861, line: 424, type: !729)
!969 = !DILocalVariable(name: "f", arg: 2, scope: !961, file: !861, line: 424, type: !964)
!970 = !DILocalVariable(name: "x", scope: !971, file: !861, line: 426, type: !39, align: 8)
!971 = distinct !DILexicalBlock(scope: !961, file: !861, line: 426, column: 13)
!972 = !{!41, !973}
!973 = !DITemplateTypeParameter(name: "F", type: !964)
!974 = !DILocation(line: 424, column: 45, scope: !961)
!975 = !DILocation(line: 424, column: 51, scope: !961)
!976 = !DILocation(line: 426, column: 13, scope: !961)
!977 = !DILocation(line: 427, column: 21, scope: !961)
!978 = !DILocation(line: 425, column: 15, scope: !961)
!979 = !DILocation(line: 426, column: 18, scope: !961)
!980 = !DILocation(line: 426, column: 18, scope: !971)
!981 = !DILocation(line: 426, column: 24, scope: !971)
!982 = !DILocation(line: 425, column: 9, scope: !961)
!983 = !DILocation(line: 429, column: 6, scope: !961)
!984 = !DILocation(line: 429, column: 5, scope: !961)
!985 = !DILocation(line: 424, column: 5, scope: !961)
