; ModuleID = 'crossbeam_utils.3h03fk6h-cgu.0'
source_filename = "crossbeam_utils.3h03fk6h-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"std::fmt::Formatter" = type { [0 x i64], { i64, i64 }, [0 x i64], { i64, i64 }, [0 x i64], { {}*, [3 x i64]* }, [0 x i32], i32, [0 x i32], i32, [0 x i8], i8, [7 x i8] }
%"std::alloc::LayoutError" = type { [0 x i8], {}, [0 x i8] }
%"std::thread::AccessError" = type { [0 x i8], {}, [0 x i8] }
%"std::sync::PoisonError<(std::sync::MutexGuard<()>, std::sync::WaitTimeoutResult)>" = type { [0 x i64], { [0 x i64], { i64*, i8 }, [0 x i8], i8, [7 x i8] }, [0 x i64] }
%"std::sync::atomic::AtomicUsize" = type { [0 x i64], i64, [0 x i64] }
%"std::thread::Builder" = type { [0 x i64], %"std::option::Option<std::string::String>", [0 x i64], { i64, i64 }, [0 x i64] }
%"std::option::Option<std::string::String>" = type { [0 x i64], {}*, [2 x i64] }
%"std::alloc::AllocError" = type {}
%"std::result::Result<std::ptr::NonNull<u8>, std::alloc::AllocError>::Err" = type { [0 x i8], %"std::alloc::AllocError", [0 x i8] }
%"std::option::NoneError" = type {}
%"std::result::Result<std::alloc::Layout, std::option::NoneError>::Err" = type { [0 x i8], %"std::option::NoneError", [0 x i8] }
%"std::result::Result<&std::cell::Cell<(u64, u64)>, std::thread::AccessError>::Err" = type { [0 x i8], %"std::thread::AccessError", [0 x i8] }

!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !14, file: !2, size: 64, align: 64, elements: !4, templateParams: !22, identifier: "9d1eb7464482142c42d8721a7d21657d::None")
!22 = !{!23}
!23 = !DITemplateTypeParameter(name: "T", type: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !25, file: !2, size: 64, align: 64, elements: !29, templateParams: !4, identifier: "5d0f1f27c1d58a26b9eab6d767a258e7")
!25 = !DINamespace(name: "get", scope: !26)
!26 = !DINamespace(name: "{{impl}}", scope: !27)
!27 = !DINamespace(name: "lazy", scope: !28)
!28 = !DINamespace(name: "lazy_static", scope: null)
!29 = !{!30, !304}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !24, file: !2, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&lazy_static::lazy::Lazy<std::sync::mutex::Mutex<crossbeam_utils::sync::sharded_lock::ThreadIndices>>", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&lazy_static::lazy::Lazy<std::sync::mutex::Mutex<crossbeam_utils::sync::sharded_lock::ThreadIndices>>", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<std::sync::mutex::Mutex<crossbeam_utils::sync::sharded_lock::ThreadIndices>>", scope: !27, file: !2, size: 832, align: 64, elements: !34, templateParams: !49, identifier: "d1876321776016966398caf63d768b97")
!34 = !{!35, !197}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !33, file: !2, baseType: !36, size: 768, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<core::option::Option<std::sync::mutex::Mutex<crossbeam_utils::sync::sharded_lock::ThreadIndices>>>", scope: !37, file: !2, size: 768, align: 64, elements: !38, templateParams: !195, identifier: "3fba8ec51bb4dd980cd1ef68df44310")
!37 = !DINamespace(name: "cell", scope: !16)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !36, file: !2, baseType: !40, size: 768, align: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<std::sync::mutex::Mutex<crossbeam_utils::sync::sharded_lock::ThreadIndices>>>", scope: !37, file: !2, size: 768, align: 64, elements: !41, templateParams: !195, identifier: "7343819d50d1b38952056f3e4f83e3e6")
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !40, file: !2, baseType: !43, size: 768, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::sync::mutex::Mutex<crossbeam_utils::sync::sharded_lock::ThreadIndices>>", scope: !15, file: !2, size: 768, align: 64, elements: !44, identifier: "f13f55836d38fa9764924dcc8081b41d")
!44 = !{!45}
!45 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 768, align: 64, elements: !46, templateParams: !49, identifier: "f13f55836d38fa9764924dcc8081b41d_variant_part", discriminator: !194)
!46 = !{!47, !190}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !45, file: !2, baseType: !48, size: 768, align: 64, extraData: i64 0)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !43, file: !2, size: 768, align: 64, elements: !4, templateParams: !49, identifier: "f13f55836d38fa9764924dcc8081b41d::None")
!49 = !{!50}
!50 = !DITemplateTypeParameter(name: "T", type: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<crossbeam_utils::sync::sharded_lock::ThreadIndices>", scope: !52, file: !2, size: 768, align: 64, elements: !53, templateParams: !188, identifier: "7f0a9f14d3b6951f89d2b8146f4c7efd")
!52 = !DINamespace(name: "mutex", scope: !9)
!53 = !{!54, !83, !98}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !51, file: !2, baseType: !55, size: 64, align: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovableMutex", scope: !56, file: !2, size: 64, align: 64, elements: !58, templateParams: !4, identifier: "2883e54b1a286dd369be8f96b7965cd0")
!56 = !DINamespace(name: "mutex", scope: !57)
!57 = !DINamespace(name: "sys_common", scope: !10)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !55, file: !2, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::sys::unix::mutex::Mutex, alloc::alloc::Global>", baseType: !61, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !62, file: !2, size: 320, align: 64, elements: !65, templateParams: !4, identifier: "129bcfa7494c9a7f434cb6f79151c373")
!62 = !DINamespace(name: "mutex", scope: !63)
!63 = !DINamespace(name: "unix", scope: !64)
!64 = !DINamespace(name: "sys", scope: !10)
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !61, file: !2, baseType: !67, size: 320, align: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<libc::unix::linux_like::linux::pthread_mutex_t>", scope: !37, file: !2, size: 320, align: 64, elements: !68, templateParams: !81, identifier: "63702e9730594c91262bc73577a77ed")
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !67, file: !2, baseType: !70, size: 320, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t", scope: !71, file: !2, size: 320, align: 64, elements: !75, templateParams: !4, identifier: "29417aee2c490952729ea37d7fd7956d")
!71 = !DINamespace(name: "linux", scope: !72)
!72 = !DINamespace(name: "linux_like", scope: !73)
!73 = !DINamespace(name: "unix", scope: !74)
!74 = !DINamespace(name: "libc", scope: null)
!75 = !{!76}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !2, baseType: !77, size: 320, align: 8)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 320, align: 8, elements: !79)
!78 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!79 = !{!80}
!80 = !DISubrange(count: 40, lowerBound: 0)
!81 = !{!82}
!82 = !DITemplateTypeParameter(name: "T", type: !70)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !51, file: !2, baseType: !84, size: 8, align: 8, offset: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !85, file: !2, size: 8, align: 8, elements: !86, templateParams: !4, identifier: "6bfe09f2d6e576f2167d782127901c9c")
!85 = !DINamespace(name: "poison", scope: !57)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !84, file: !2, baseType: !88, size: 8, align: 8)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !89, file: !2, size: 8, align: 8, elements: !91, templateParams: !4, identifier: "9fae9e53727c4d79df9c89c13279ffb8")
!89 = !DINamespace(name: "atomic", scope: !90)
!90 = !DINamespace(name: "sync", scope: !16)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !88, file: !2, baseType: !93, size: 8, align: 8)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !37, file: !2, size: 8, align: 8, elements: !94, templateParams: !96, identifier: "2fa8e20d656222adadd60015061cba20")
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !93, file: !2, baseType: !78, size: 8, align: 8)
!96 = !{!97}
!97 = !DITemplateTypeParameter(name: "T", type: !78)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !51, file: !2, baseType: !99, size: 640, align: 64, offset: 128)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<crossbeam_utils::sync::sharded_lock::ThreadIndices>", scope: !37, file: !2, size: 640, align: 64, elements: !100, templateParams: !188, identifier: "5026e54ac038ea11c890c73b760a89bc")
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !99, file: !2, baseType: !102, size: 640, align: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadIndices", scope: !103, file: !2, size: 640, align: 64, elements: !106, templateParams: !4, identifier: "522b1b98d45d567f65db764b6ac08eb7")
!103 = !DINamespace(name: "sharded_lock", scope: !104)
!104 = !DINamespace(name: "sync", scope: !105)
!105 = !DINamespace(name: "crossbeam_utils", scope: null)
!106 = !{!107, !161, !187}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !102, file: !2, baseType: !108, size: 384, align: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<std::thread::ThreadId, usize, std::collections::hash::map::RandomState>", scope: !109, file: !2, size: 384, align: 64, elements: !112, templateParams: !157, identifier: "6f1052cf04eda33136e07f35fd60f525")
!109 = !DINamespace(name: "map", scope: !110)
!110 = !DINamespace(name: "hash", scope: !111)
!111 = !DINamespace(name: "collections", scope: !10)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !108, file: !2, baseType: !114, size: 384, align: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<std::thread::ThreadId, usize, std::collections::hash::map::RandomState>", scope: !115, file: !2, size: 384, align: 64, elements: !117, templateParams: !157, identifier: "9c20dce876c3c2a0353d0e4018947e1d")
!115 = !DINamespace(name: "map", scope: !116)
!116 = !DINamespace(name: "hashbrown", scope: null)
!117 = !{!118, !124}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !114, file: !2, baseType: !119, size: 128, align: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "RandomState", scope: !109, file: !2, size: 128, align: 64, elements: !120, templateParams: !4, identifier: "31dc6d908c0560d28c989ac439a7a4b2")
!120 = !{!121, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !119, file: !2, baseType: !122, size: 64, align: 64)
!122 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !119, file: !2, baseType: !122, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !114, file: !2, baseType: !125, size: 256, align: 64, offset: 128)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(std::thread::ThreadId, usize)>", scope: !126, file: !2, size: 256, align: 64, elements: !127, templateParams: !142, identifier: "ba91258920dadac22480f0e57f555d51")
!126 = !DINamespace(name: "raw", scope: !116)
!127 = !{!128, !130, !137, !138, !139}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_mask", scope: !125, file: !2, baseType: !129, size: 64, align: 64)
!129 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !125, file: !2, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !132, file: !2, size: 64, align: 64, elements: !134, templateParams: !96, identifier: "d283ea41dbfdc7dac0f428f32aa77076")
!132 = !DINamespace(name: "non_null", scope: !133)
!133 = !DINamespace(name: "ptr", scope: !16)
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !131, file: !2, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "growth_left", scope: !125, file: !2, baseType: !129, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !125, file: !2, baseType: !129, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !125, file: !2, baseType: !140, align: 8)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(std::thread::ThreadId, usize)>", scope: !141, file: !2, align: 8, elements: !4, templateParams: !142, identifier: "cc845ea5b2eba6d8de269777f0e5eb49")
!141 = !DINamespace(name: "marker", scope: !16)
!142 = !{!143}
!143 = !DITemplateTypeParameter(name: "T", type: !144)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "(std::thread::ThreadId, usize)", file: !2, size: 128, align: 64, elements: !145, templateParams: !4, identifier: "2692d97eac51d8dbc7f87a7011556408")
!145 = !{!146, !156}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !144, file: !2, baseType: !147, size: 64, align: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !148, file: !2, size: 64, align: 64, elements: !149, templateParams: !4, identifier: "f6f0259fc13e9ca7ee42c3dba2d790b6")
!148 = !DINamespace(name: "thread", scope: !10)
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !147, file: !2, baseType: !151, size: 64, align: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64", scope: !152, file: !2, size: 64, align: 64, elements: !154, templateParams: !4, identifier: "4cc35938c55db79bf670fe332761a87e")
!152 = !DINamespace(name: "nonzero", scope: !153)
!153 = !DINamespace(name: "num", scope: !16)
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !151, file: !2, baseType: !122, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !144, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!157 = !{!158, !159, !160}
!158 = !DITemplateTypeParameter(name: "K", type: !147)
!159 = !DITemplateTypeParameter(name: "V", type: !129)
!160 = !DITemplateTypeParameter(name: "S", type: !119)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !102, file: !2, baseType: !162, size: 192, align: 64, offset: 384)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<usize, alloc::alloc::Global>", scope: !163, file: !2, size: 192, align: 64, elements: !165, templateParams: !184, identifier: "f35d4f3721e8cbe9072ac4e0df8ced4")
!163 = !DINamespace(name: "vec", scope: !164)
!164 = !DINamespace(name: "alloc", scope: null)
!165 = !{!166, !186}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !162, file: !2, baseType: !167, size: 128, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<usize, alloc::alloc::Global>", scope: !168, file: !2, size: 128, align: 64, elements: !169, templateParams: !184, identifier: "6902befa072520144b0c703098513a84")
!168 = !DINamespace(name: "raw_vec", scope: !164)
!169 = !{!170, !180, !181}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !167, file: !2, baseType: !171, size: 64, align: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<usize>", scope: !172, file: !2, size: 64, align: 64, elements: !173, templateParams: !178, identifier: "e741d79ff325e460dfe1bc6312c514f0")
!172 = !DINamespace(name: "unique", scope: !133)
!173 = !{!174, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !171, file: !2, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !171, file: !2, baseType: !177, align: 8)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<usize>", scope: !141, file: !2, align: 8, elements: !4, templateParams: !178, identifier: "7c20a7737a7ce3416a6c1a9f4b79696")
!178 = !{!179}
!179 = !DITemplateTypeParameter(name: "T", type: !129)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !167, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !167, file: !2, baseType: !182, align: 8)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !183, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "e4d51af9c1e83fbc6db181ae5bd11b43")
!183 = !DINamespace(name: "alloc", scope: !164)
!184 = !{!179, !185}
!185 = !DITemplateTypeParameter(name: "A", type: !182)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !162, file: !2, baseType: !129, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next_index", scope: !102, file: !2, baseType: !129, size: 64, align: 64, offset: 576)
!188 = !{!189}
!189 = !DITemplateTypeParameter(name: "T", type: !102)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !45, file: !2, baseType: !191, size: 768, align: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !43, file: !2, size: 768, align: 64, elements: !192, templateParams: !49, identifier: "f13f55836d38fa9764924dcc8081b41d::Some")
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !191, file: !2, baseType: !51, size: 768, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, scope: !15, file: !2, baseType: !122, size: 64, align: 64, flags: DIFlagArtificial)
!195 = !{!196}
!196 = !DITemplateTypeParameter(name: "T", type: !43)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !33, file: !2, baseType: !198, size: 64, align: 64, offset: 768)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", scope: !8, file: !2, size: 64, align: 64, elements: !199, templateParams: !4, identifier: "ac096da534e205b3adcb7648171b3d")
!199 = !{!200, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "state_and_queue", scope: !198, file: !2, baseType: !201, size: 64, align: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !89, file: !2, size: 64, align: 64, elements: !202, templateParams: !4, identifier: "6111d960802cd765eba1866cb776b357")
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !201, file: !2, baseType: !204, size: 64, align: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !37, file: !2, size: 64, align: 64, elements: !205, templateParams: !178, identifier: "fc2aa4ffe8447d5d421ff0563135e87c")
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !204, file: !2, baseType: !129, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !198, file: !2, baseType: !208, align: 8)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<*const std::sync::once::Waiter>", scope: !141, file: !2, align: 8, elements: !4, templateParams: !209, identifier: "c3c2b00b45ebdcb8c181f0e1132d6757")
!209 = !{!210}
!210 = !DITemplateTypeParameter(name: "T", type: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const std::sync::once::Waiter", baseType: !212, size: 64, align: 64, dwarfAddressSpace: 0)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waiter", scope: !8, file: !2, size: 192, align: 64, elements: !213, templateParams: !4, identifier: "efc07f98b00deb8bb66603598063d9b0")
!213 = !{!214, !302, !303}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !212, file: !2, baseType: !215, size: 64, align: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<core::option::Option<std::thread::Thread>>", scope: !37, file: !2, size: 64, align: 64, elements: !216, templateParams: !300, identifier: "8a9a0bfa9cf016e2be9d799965d08825")
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !215, file: !2, baseType: !218, size: 64, align: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<std::thread::Thread>>", scope: !37, file: !2, size: 64, align: 64, elements: !219, templateParams: !300, identifier: "709e37c5b5344a5e2b83899a556cca97")
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !218, file: !2, baseType: !221, size: 64, align: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::thread::Thread>", scope: !15, file: !2, size: 64, align: 64, elements: !222, identifier: "619bd67558624cf3efb50688beae577a")
!222 = !{!223}
!223 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 64, align: 64, elements: !224, templateParams: !227, identifier: "619bd67558624cf3efb50688beae577a_variant_part", discriminator: !194)
!224 = !{!225, !296}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !223, file: !2, baseType: !226, size: 64, align: 64, extraData: i64 0)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !221, file: !2, size: 64, align: 64, elements: !4, templateParams: !227, identifier: "619bd67558624cf3efb50688beae577a::None")
!227 = !{!228}
!228 = !DITemplateTypeParameter(name: "T", type: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !148, file: !2, size: 64, align: 64, elements: !230, templateParams: !4, identifier: "15127dee45bf2be32874e7c7bf7c0ae6")
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !229, file: !2, baseType: !232, size: 64, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner>", scope: !233, file: !2, size: 64, align: 64, elements: !234, templateParams: !290, identifier: "2087bbdc2002c2dee8ab029616542ef3")
!233 = !DINamespace(name: "sync", scope: !164)
!234 = !{!235, !294}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !232, file: !2, baseType: !236, size: 64, align: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner>>", scope: !132, file: !2, size: 64, align: 64, elements: !237, templateParams: !292, identifier: "e91db83023a31648ce50af0b38feaff1")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !236, file: !2, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Inner>", baseType: !240, size: 64, align: 64, dwarfAddressSpace: 0)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !233, file: !2, size: 384, align: 64, elements: !241, templateParams: !290, identifier: "93ca378ddd27e9561e89c3d2506ac2a8")
!241 = !{!242, !243, !244}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !240, file: !2, baseType: !201, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !240, file: !2, baseType: !201, size: 64, align: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !240, file: !2, baseType: !245, size: 256, align: 64, offset: 128)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !148, file: !2, size: 256, align: 64, elements: !246, templateParams: !4, identifier: "ca5c69cf62f3a4d6f1fb008d0d334c3d")
!246 = !{!247, !274, !275}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !245, file: !2, baseType: !248, size: 128, align: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::ffi::c_str::CString>", scope: !15, file: !2, size: 128, align: 64, elements: !249, identifier: "a7f21f128c6692227724ca30f07bf29")
!249 = !{!250}
!250 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 128, align: 64, elements: !251, templateParams: !254, identifier: "a7f21f128c6692227724ca30f07bf29_variant_part", discriminator: !194)
!251 = !{!252, !270}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !250, file: !2, baseType: !253, size: 128, align: 64, extraData: i64 0)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !248, file: !2, size: 128, align: 64, elements: !4, templateParams: !254, identifier: "a7f21f128c6692227724ca30f07bf29::None")
!254 = !{!255}
!255 = !DITemplateTypeParameter(name: "T", type: !256)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !257, file: !2, size: 128, align: 64, elements: !259, templateParams: !4, identifier: "65c3bf023a6b555dfc9cb51543ba37c2")
!257 = !DINamespace(name: "c_str", scope: !258)
!258 = !DINamespace(name: "ffi", scope: !10)
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !256, file: !2, baseType: !261, size: 128, align: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !262, templateParams: !265, identifier: "e4a6a6843d910ea2bc51304fe56862c1")
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !261, file: !2, baseType: !136, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !261, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!265 = !{!266, !185}
!266 = !DITemplateTypeParameter(name: "T", type: !267)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, align: 8, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: -1, lowerBound: 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !250, file: !2, baseType: !271, size: 128, align: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !248, file: !2, size: 128, align: 64, elements: !272, templateParams: !254, identifier: "a7f21f128c6692227724ca30f07bf29::Some")
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !271, file: !2, baseType: !256, size: 128, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !245, file: !2, baseType: !147, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !245, file: !2, baseType: !276, size: 32, align: 32, offset: 192)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !277, file: !2, size: 32, align: 32, elements: !279, templateParams: !4, identifier: "2623f5fbacf1ccb41ebe95392b878648")
!277 = !DINamespace(name: "futex", scope: !278)
!278 = !DINamespace(name: "thread_parker", scope: !57)
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !276, file: !2, baseType: !281, size: 32, align: 32)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicI32", scope: !89, file: !2, size: 32, align: 32, elements: !282, templateParams: !4, identifier: "12669af73a135436b0f8dfc54de2379e")
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !281, file: !2, baseType: !284, size: 32, align: 32)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<i32>", scope: !37, file: !2, size: 32, align: 32, elements: !285, templateParams: !288, identifier: "e8ec75710d5d461ce19362a0145d2da2")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !284, file: !2, baseType: !287, size: 32, align: 32)
!287 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!288 = !{!289}
!289 = !DITemplateTypeParameter(name: "T", type: !287)
!290 = !{!291}
!291 = !DITemplateTypeParameter(name: "T", type: !245)
!292 = !{!293}
!293 = !DITemplateTypeParameter(name: "T", type: !240)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !232, file: !2, baseType: !295, align: 8)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner>>", scope: !141, file: !2, align: 8, elements: !4, templateParams: !292, identifier: "8136fd2d487bcd484aa9276f4931545a")
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !223, file: !2, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !221, file: !2, size: 64, align: 64, elements: !298, templateParams: !227, identifier: "619bd67558624cf3efb50688beae577a::Some")
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !297, file: !2, baseType: !229, size: 64, align: 64)
!300 = !{!301}
!301 = !DITemplateTypeParameter(name: "T", type: !221)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !212, file: !2, baseType: !88, size: 8, align: 8, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !212, file: !2, baseType: !211, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !24, file: !2, baseType: !305, align: 8)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> std::sync::mutex::Mutex<crossbeam_utils::sync::sharded_lock::ThreadIndices>", baseType: !306, align: 8, dwarfAddressSpace: 0)
!306 = !DISubroutineType(types: !307)
!307 = !{!51}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !18, file: !2, baseType: !309, size: 64, align: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !14, file: !2, size: 64, align: 64, elements: !310, templateParams: !22, identifier: "9d1eb7464482142c42d8721a7d21657d::Some")
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !309, file: !2, baseType: !24, size: 64, align: 64)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !315, identifier: "vtable")
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicPayload<&str>", scope: !316, file: !2, size: 128, align: 64, elements: !318, templateParams: !336, identifier: "8f6e4972f9428b6393b96dbb73ba069f")
!316 = !DINamespace(name: "begin_panic", scope: !317)
!317 = !DINamespace(name: "panicking", scope: !10)
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !315, file: !2, baseType: !320, size: 128, align: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !15, file: !2, size: 128, align: 64, elements: !321, identifier: "9130b3267b3090f75854af79e5dc78bd")
!321 = !{!322}
!322 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 128, align: 64, elements: !323, templateParams: !326, identifier: "9130b3267b3090f75854af79e5dc78bd_variant_part", discriminator: !194)
!323 = !{!324, !332}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !322, file: !2, baseType: !325, size: 128, align: 64, extraData: i64 0)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !320, file: !2, size: 128, align: 64, elements: !4, templateParams: !326, identifier: "9130b3267b3090f75854af79e5dc78bd::None")
!326 = !{!327}
!327 = !DITemplateTypeParameter(name: "T", type: !328)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !329, templateParams: !4, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !328, file: !2, baseType: !136, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !328, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !322, file: !2, baseType: !333, size: 128, align: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !320, file: !2, size: 128, align: 64, elements: !334, templateParams: !326, identifier: "9130b3267b3090f75854af79e5dc78bd::Some")
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !333, file: !2, baseType: !328, size: 128, align: 64)
!336 = !{!337}
!337 = !DITemplateTypeParameter(name: "A", type: !328)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !341, identifier: "vtable")
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<crossbeam_utils::sync::sharded_lock::ThreadIndices>>", scope: !85, file: !2, size: 128, align: 64, elements: !342, templateParams: !353, identifier: "5d37b7c720515de2235fd0357bde2d7")
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !341, file: !2, baseType: !344, size: 128, align: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<crossbeam_utils::sync::sharded_lock::ThreadIndices>", scope: !52, file: !2, size: 128, align: 64, elements: !345, templateParams: !188, identifier: "8aaa9b9bedc58659c46b5e03a419e8b9")
!345 = !{!346, !348}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !344, file: !2, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<crossbeam_utils::sync::sharded_lock::ThreadIndices>", baseType: !51, size: 64, align: 64, dwarfAddressSpace: 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !344, file: !2, baseType: !349, size: 8, align: 8, offset: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guard", scope: !85, file: !2, size: 8, align: 8, elements: !350, templateParams: !4, identifier: "4e3c4ca40927284c81be83d26d9ac553")
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "panicking", scope: !349, file: !2, baseType: !352, size: 8, align: 8)
!352 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!353 = !{!354}
!354 = !DITemplateTypeParameter(name: "T", type: !344)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !358, identifier: "vtable")
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<usize>>", scope: !85, file: !2, size: 128, align: 64, elements: !359, templateParams: !371, identifier: "18ecd6df0f198d507c9b8e065824f7e4")
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !358, file: !2, baseType: !361, size: 128, align: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<usize>", scope: !52, file: !2, size: 128, align: 64, elements: !362, templateParams: !178, identifier: "d9bf8692e2d65c7129ca612275d4aa58")
!362 = !{!363, !370}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !361, file: !2, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<usize>", baseType: !365, size: 64, align: 64, dwarfAddressSpace: 0)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<usize>", scope: !52, file: !2, size: 192, align: 64, elements: !366, templateParams: !178, identifier: "921201153a98fe96e4850072306bcc2c")
!366 = !{!367, !368, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !365, file: !2, baseType: !55, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !365, file: !2, baseType: !84, size: 8, align: 8, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !365, file: !2, baseType: !204, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !361, file: !2, baseType: !349, size: 8, align: 8, offset: 64)
!371 = !{!372}
!372 = !DITemplateTypeParameter(name: "T", type: !361)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !376, identifier: "vtable")
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<()>>", scope: !85, file: !2, size: 128, align: 64, elements: !377, templateParams: !395, identifier: "ba2bfad48cdc97f0e56638e4cd17914e")
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !376, file: !2, baseType: !379, size: 128, align: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<()>", scope: !52, file: !2, size: 128, align: 64, elements: !380, templateParams: !392, identifier: "549c5ab499f5f87d7b1de0df066c8041")
!380 = !{!381, !394}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !379, file: !2, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<()>", baseType: !383, size: 64, align: 64, dwarfAddressSpace: 0)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<()>", scope: !52, file: !2, size: 128, align: 64, elements: !384, templateParams: !392, identifier: "b33d38e2d2b7d1e92b7d89d75b602f54")
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !383, file: !2, baseType: !55, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !383, file: !2, baseType: !84, size: 8, align: 8, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !383, file: !2, baseType: !388, align: 8, offset: 72)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<()>", scope: !37, file: !2, align: 8, elements: !389, templateParams: !392, identifier: "e0b18d2a57b2bd5563f6b6fe08e61bad")
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !388, file: !2, baseType: !391, align: 8)
!391 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!392 = !{!393}
!393 = !DITemplateTypeParameter(name: "T", type: !391)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !379, file: !2, baseType: !349, size: 8, align: 8, offset: 64)
!395 = !{!396}
!396 = !DITemplateTypeParameter(name: "T", type: !379)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !400, identifier: "vtable")
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "LayoutError", scope: !401, file: !2, align: 8, elements: !403, templateParams: !4, identifier: "96d34906feb3fe0522c6475f6d4ceae8")
!401 = !DINamespace(name: "layout", scope: !402)
!402 = !DINamespace(name: "alloc", scope: !16)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !400, file: !2, baseType: !391, align: 8)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !408, identifier: "vtable")
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccessError", scope: !409, file: !2, align: 8, elements: !410, templateParams: !4, identifier: "4faea2fb282acb6c59daf1bc20e00db6")
!409 = !DINamespace(name: "local", scope: !148)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !408, file: !2, baseType: !391, align: 8)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !415, identifier: "vtable")
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<(std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)>", scope: !85, file: !2, size: 192, align: 64, elements: !416, templateParams: !426, identifier: "80f24f033ebe59257de1046c691751d4")
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !415, file: !2, baseType: !418, size: 192, align: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "(std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)", file: !2, size: 192, align: 64, elements: !419, templateParams: !4, identifier: "5ba280762f9a363dfe2784249ffeac5a")
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !418, file: !2, baseType: !379, size: 128, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !418, file: !2, baseType: !422, size: 8, align: 8, offset: 128)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "WaitTimeoutResult", scope: !423, file: !2, size: 8, align: 8, elements: !424, templateParams: !4, identifier: "bf1972eda66236d3bea6f68f8ec9b8db")
!423 = !DINamespace(name: "condvar", scope: !9)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !422, file: !2, baseType: !352, size: 8, align: 8)
!426 = !{!427}
!427 = !DITemplateTypeParameter(name: "T", type: !418)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !328, identifier: "vtable")
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !434, identifier: "vtable")
!434 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "LOCKS", linkageName: "_RNvNvNtNtCs48Yq53b35jF_15crossbeam_utils6atomic11atomic_cell4lock5LOCKS", scope: !437, file: !440, line: 652, type: !441, isLocal: false, isDefinition: true, align: 8)
!437 = !DINamespace(name: "lock", scope: !438)
!438 = !DINamespace(name: "atomic_cell", scope: !439)
!439 = !DINamespace(name: "atomic", scope: !105)
!440 = !DIFile(filename: "/home/skeet/.cargo/registry/src/github.com-1ecc6299db9ec823/crossbeam-utils-0.8.1/src/atomic/atomic_cell.rs", directory: "/home/skeet/.cargo/registry/src/github.com-1ecc6299db9ec823/crossbeam-utils-0.8.1", checksumkind: CSK_MD5, checksum: "844c40b5aea229c9af61e6269880ebf4")
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 6208, align: 64, elements: !446)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "SeqLock", scope: !443, file: !2, size: 64, align: 64, elements: !444, templateParams: !4, identifier: "251e4ce36ab4fc36ec8b2a06865888e1")
!443 = !DINamespace(name: "seq_lock", scope: !439)
!444 = !{!445}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !442, file: !2, baseType: !201, size: 64, align: 64)
!446 = !{!447}
!447 = !DISubrange(count: 97, lowerBound: 0)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !451, identifier: "vtable")
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<u32>", scope: !37, file: !2, size: 32, align: 32, elements: !452, templateParams: !457, identifier: "dda884ae4401cc3ba6aa3045ec4e618d")
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !451, file: !2, baseType: !454, size: 32, align: 32)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !37, file: !2, size: 32, align: 32, elements: !455, templateParams: !457, identifier: "e4584502161451ea553a99909900a0a1")
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !454, file: !2, baseType: !434, size: 32, align: 32)
!457 = !{!458}
!458 = !DITemplateTypeParameter(name: "T", type: !434)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !461, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !352, identifier: "vtable")
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !464, isLocal: true, isDefinition: true)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !129, identifier: "vtable")
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "__KEY", linkageName: "_RNvNvNvNtNtCs48Yq53b35jF_15crossbeam_utils4sync12sharded_lock12REGISTRATION7___getit5___KEY", scope: !467, file: !469, line: 169, type: !470, isLocal: true, isDefinition: true, align: 8)
!467 = !DINamespace(name: "__getit", scope: !468)
!468 = !DINamespace(name: "REGISTRATION", scope: !103)
!469 = !DIFile(filename: "/rustc/e38fb306b7f5e65cca34df2dab1f0db15e1defb4/library/std/src/thread/local.rs", directory: "", checksumkind: CSK_MD5, checksum: "5909fe7bd3d4702ff216f804b9508bd2")
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key<crossbeam_utils::sync::sharded_lock::Registration>", scope: !471, file: !2, size: 192, align: 64, elements: !472, templateParams: !487, identifier: "c2504c9945e54363e118d5b6299093cb")
!471 = !DINamespace(name: "fast", scope: !409)
!472 = !{!473, !500}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !470, file: !2, baseType: !474, size: 128, align: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "LazyKeyInner<crossbeam_utils::sync::sharded_lock::Registration>", scope: !475, file: !2, size: 128, align: 64, elements: !476, templateParams: !487, identifier: "d3834642a4ab2b58c93e19d0ee1200b7")
!475 = !DINamespace(name: "lazy", scope: !409)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !474, file: !2, baseType: !478, size: 128, align: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<crossbeam_utils::sync::sharded_lock::Registration>>", scope: !37, file: !2, size: 128, align: 64, elements: !479, templateParams: !498, identifier: "108bdbcbefdd41365281bd578ecfefcb")
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !478, file: !2, baseType: !481, size: 128, align: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<crossbeam_utils::sync::sharded_lock::Registration>", scope: !15, file: !2, size: 128, align: 64, elements: !482, identifier: "9c6b6d95294070a877952068a76d165")
!482 = !{!483}
!483 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 128, align: 64, elements: !484, templateParams: !487, identifier: "9c6b6d95294070a877952068a76d165_variant_part", discriminator: !497)
!484 = !{!485, !493}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !483, file: !2, baseType: !486, size: 128, align: 64, extraData: i64 0)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !481, file: !2, size: 128, align: 64, elements: !4, templateParams: !487, identifier: "9c6b6d95294070a877952068a76d165::None")
!487 = !{!488}
!488 = !DITemplateTypeParameter(name: "T", type: !489)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "Registration", scope: !103, file: !2, size: 128, align: 64, elements: !490, templateParams: !4, identifier: "30e71e6dbc9f82883efdb9a29b73dbac")
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !489, file: !2, baseType: !129, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !489, file: !2, baseType: !147, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !483, file: !2, baseType: !494, size: 128, align: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !481, file: !2, size: 128, align: 64, elements: !495, templateParams: !487, identifier: "9c6b6d95294070a877952068a76d165::Some")
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !494, file: !2, baseType: !489, size: 128, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, scope: !15, file: !2, baseType: !122, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!498 = !{!499}
!499 = !DITemplateTypeParameter(name: "T", type: !481)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dtor_state", scope: !470, file: !2, baseType: !501, size: 8, align: 8, offset: 128)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<std::thread::local::fast::DtorState>", scope: !37, file: !2, size: 8, align: 8, elements: !502, templateParams: !512, identifier: "35fac475ea465198f8aa67ef8113a1d9")
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !501, file: !2, baseType: !504, size: 8, align: 8)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::thread::local::fast::DtorState>", scope: !37, file: !2, size: 8, align: 8, elements: !505, templateParams: !512, identifier: "deab0fd25f1ee0fb52f6e0075b662202")
!505 = !{!506}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !504, file: !2, baseType: !507, size: 8, align: 8)
!507 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DtorState", scope: !471, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !508)
!508 = !{!509, !510, !511}
!509 = !DIEnumerator(name: "Unregistered", value: 0)
!510 = !DIEnumerator(name: "Registered", value: 1)
!511 = !DIEnumerator(name: "RunningOrHasRun", value: 2)
!512 = !{!513}
!513 = !DITemplateTypeParameter(name: "T", type: !507)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !516, isLocal: true, isDefinition: true)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !517, identifier: "vtable")
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&crossbeam_utils::thread::Scope", baseType: !518, size: 64, align: 64, dwarfAddressSpace: 0)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&crossbeam_utils::thread::Scope", baseType: !519, size: 64, align: 64, dwarfAddressSpace: 0)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scope", scope: !520, file: !2, size: 128, align: 64, elements: !521, templateParams: !4, identifier: "675761792fa898e083ef85980e5c6114")
!520 = !DINamespace(name: "thread", scope: !105)
!521 = !{!522, !703, !758}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !519, file: !2, baseType: !523, size: 64, align: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>>", scope: !233, file: !2, size: 64, align: 64, elements: !524, templateParams: !697, identifier: "94b0a0d9a5a2a594a5de5b04f0f5ccdd")
!524 = !{!525, !701}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !523, file: !2, baseType: !526, size: 64, align: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>>>", scope: !132, file: !2, size: 64, align: 64, elements: !527, templateParams: !699, identifier: "27a304c28f1d91bed221f53840dad85")
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !526, file: !2, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>>", baseType: !530, size: 64, align: 64, dwarfAddressSpace: 0)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>>", scope: !233, file: !2, size: 448, align: 64, elements: !531, templateParams: !697, identifier: "69fd8fe0d175bf97b26557e4af231fd")
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !530, file: !2, baseType: !201, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !530, file: !2, baseType: !201, size: 64, align: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !530, file: !2, baseType: !535, size: 320, align: 64, offset: 128)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>", scope: !52, file: !2, size: 320, align: 64, elements: !536, templateParams: !695, identifier: "c5ab3d9150010eafce464b9083ff7299")
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !535, file: !2, baseType: !55, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !535, file: !2, baseType: !84, size: 8, align: 8, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !535, file: !2, baseType: !540, size: 192, align: 64, offset: 128)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>", scope: !37, file: !2, size: 192, align: 64, elements: !541, templateParams: !695, identifier: "5aaa6e400038c4f3c27666af69727a3")
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !540, file: !2, baseType: !543, size: 192, align: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>", scope: !163, file: !2, size: 192, align: 64, elements: !544, templateParams: !693, identifier: "13592408c7aceeb5396379859170831c")
!544 = !{!545, !694}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !543, file: !2, baseType: !546, size: 128, align: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>", scope: !168, file: !2, size: 128, align: 64, elements: !547, templateParams: !693, identifier: "3167d70d5017d8b9608dea2c15bb2a12")
!547 = !{!548, !691, !692}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !546, file: !2, baseType: !549, size: 64, align: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>>", scope: !172, file: !2, size: 64, align: 64, elements: !550, templateParams: !689, identifier: "5b712f686a44f7f85d0c03d54242ecd1")
!550 = !{!551, !687}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !549, file: !2, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>", baseType: !553, size: 64, align: 64, dwarfAddressSpace: 0)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>", scope: !233, file: !2, size: 64, align: 64, elements: !554, templateParams: !681, identifier: "c34170e2b7397ac2b7aa10138acfeaec")
!554 = !{!555, !685}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !553, file: !2, baseType: !556, size: 64, align: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>>", scope: !132, file: !2, size: 64, align: 64, elements: !557, templateParams: !683, identifier: "97188da856a6b178cafd4dbb643855bb")
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !556, file: !2, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>", baseType: !560, size: 64, align: 64, dwarfAddressSpace: 0)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>", scope: !233, file: !2, size: 512, align: 64, elements: !561, templateParams: !681, identifier: "669a4fc78d1e841d31ec44de757b41cb")
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !560, file: !2, baseType: !201, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !560, file: !2, baseType: !201, size: 64, align: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !560, file: !2, baseType: !565, size: 384, align: 64, offset: 128)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<core::option::Option<std::thread::JoinHandle<()>>>", scope: !52, file: !2, size: 384, align: 64, elements: !566, templateParams: !679, identifier: "88f5d84c12b1d925f8c0526533faa393")
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !565, file: !2, baseType: !55, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !565, file: !2, baseType: !84, size: 8, align: 8, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !565, file: !2, baseType: !570, size: 256, align: 64, offset: 128)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<std::thread::JoinHandle<()>>>", scope: !37, file: !2, size: 256, align: 64, elements: !571, templateParams: !679, identifier: "a3a05e3aada23b6e34f61c1de6074804")
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !570, file: !2, baseType: !573, size: 256, align: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::thread::JoinHandle<()>>", scope: !15, file: !2, size: 256, align: 64, elements: !574, identifier: "885b8f095cf62fbae94245c0cde41b5f")
!574 = !{!575}
!575 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 256, align: 64, elements: !576, templateParams: !579, identifier: "885b8f095cf62fbae94245c0cde41b5f_variant_part", discriminator: !194)
!576 = !{!577, !675}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !575, file: !2, baseType: !578, size: 256, align: 64, extraData: i64 2)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !573, file: !2, size: 256, align: 64, elements: !4, templateParams: !579, identifier: "885b8f095cf62fbae94245c0cde41b5f::None")
!579 = !{!580}
!580 = !DITemplateTypeParameter(name: "T", type: !581)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "JoinHandle<()>", scope: !148, file: !2, size: 256, align: 64, elements: !582, templateParams: !392, identifier: "7105ea849023e901e9ff016e54ed4ef2")
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !581, file: !2, baseType: !584, size: 256, align: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "JoinInner<()>", scope: !148, file: !2, size: 256, align: 64, elements: !585, templateParams: !392, identifier: "3ceff58d1fd35a352044c9c981894938")
!585 = !{!586, !603, !604}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "native", scope: !584, file: !2, baseType: !587, size: 128, align: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::sys::unix::thread::Thread>", scope: !15, file: !2, size: 128, align: 64, elements: !588, identifier: "95cf2de7b77abb14442eeeee7cfba55b")
!588 = !{!589}
!589 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 128, align: 64, elements: !590, templateParams: !593, identifier: "95cf2de7b77abb14442eeeee7cfba55b_variant_part", discriminator: !194)
!590 = !{!591, !599}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !589, file: !2, baseType: !592, size: 128, align: 64, extraData: i64 0)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !587, file: !2, size: 128, align: 64, elements: !4, templateParams: !593, identifier: "95cf2de7b77abb14442eeeee7cfba55b::None")
!593 = !{!594}
!594 = !DITemplateTypeParameter(name: "T", type: !595)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !596, file: !2, size: 64, align: 64, elements: !597, templateParams: !4, identifier: "e23938bcdc3b85e56eb075b787625892")
!596 = !DINamespace(name: "thread", scope: !63)
!597 = !{!598}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !595, file: !2, baseType: !122, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !589, file: !2, baseType: !600, size: 128, align: 64, extraData: i64 1)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !587, file: !2, size: 128, align: 64, elements: !601, templateParams: !593, identifier: "95cf2de7b77abb14442eeeee7cfba55b::Some")
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !600, file: !2, baseType: !595, size: 64, align: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !584, file: !2, baseType: !229, size: 64, align: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !584, file: !2, baseType: !605, size: 64, align: 64, offset: 192)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<()>", scope: !148, file: !2, size: 64, align: 64, elements: !606, templateParams: !392, identifier: "14586c47815c9edcd8bbe9c6704fdf9a")
!606 = !{!607}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !605, file: !2, baseType: !608, size: 64, align: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>", scope: !233, file: !2, size: 64, align: 64, elements: !609, templateParams: !669, identifier: "9f69d4a4ef5bfc588f581d4ebf813744")
!609 = !{!610, !673}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !608, file: !2, baseType: !611, size: 64, align: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>>", scope: !132, file: !2, size: 64, align: 64, elements: !612, templateParams: !671, identifier: "deb976d1bb0f133e122a9faf82b49a61")
!612 = !{!613}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !611, file: !2, baseType: !614, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>", baseType: !615, size: 64, align: 64, dwarfAddressSpace: 0)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>", scope: !233, file: !2, size: 320, align: 64, elements: !616, templateParams: !669, identifier: "7d2738a5786756e64da99362bb82acbf")
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !615, file: !2, baseType: !201, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !615, file: !2, baseType: !201, size: 64, align: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !615, file: !2, baseType: !620, size: 192, align: 64, offset: 128)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>", scope: !37, file: !2, size: 192, align: 64, elements: !621, templateParams: !667, identifier: "6a49dbd04fb2d16b9086c9bedbef4dfd")
!621 = !{!622}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !620, file: !2, baseType: !623, size: 192, align: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>", scope: !15, file: !2, size: 192, align: 64, elements: !624, identifier: "dc31879507e16af2bf7b272532e6045f")
!624 = !{!625}
!625 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 192, align: 64, elements: !626, templateParams: !629, identifier: "dc31879507e16af2bf7b272532e6045f_variant_part", discriminator: !194)
!626 = !{!627, !663}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !625, file: !2, baseType: !628, size: 192, align: 64, extraData: i64 0)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !623, file: !2, size: 192, align: 64, elements: !4, templateParams: !629, identifier: "dc31879507e16af2bf7b272532e6045f::None")
!629 = !{!630}
!630 = !DITemplateTypeParameter(name: "T", type: !631)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>", scope: !632, file: !2, size: 128, align: 64, elements: !633, identifier: "28373595b4cd722276284465e2329572")
!632 = !DINamespace(name: "result", scope: !16)
!633 = !{!634}
!634 = !DICompositeType(tag: DW_TAG_variant_part, scope: !632, file: !2, size: 128, align: 64, elements: !635, templateParams: !640, identifier: "28373595b4cd722276284465e2329572_variant_part", discriminator: !662)
!635 = !{!636, !658}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !634, file: !2, baseType: !637, size: 128, align: 64, extraData: i64 0)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !631, file: !2, size: 128, align: 64, elements: !638, templateParams: !640, identifier: "28373595b4cd722276284465e2329572::Ok")
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !637, file: !2, baseType: !391, align: 8)
!640 = !{!393, !641}
!641 = !DITemplateTypeParameter(name: "E", type: !642)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<Any, alloc::alloc::Global>", scope: !643, file: !2, size: 128, align: 64, elements: !644, templateParams: !652, identifier: "7a2d7e7761ee0eb44bd8f9a39c252beb")
!643 = !DINamespace(name: "any", scope: !16)
!644 = !{!645, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !642, file: !2, baseType: !646, size: 64, align: 64, flags: DIFlagArtificial)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !642, file: !2, baseType: !648, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !649, size: 64, align: 64, dwarfAddressSpace: 0)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 192, align: 64, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 3, lowerBound: 0)
!652 = !{!653, !185}
!653 = !DITemplateTypeParameter(name: "T", type: !654)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "Any", scope: !643, file: !2, align: 8, elements: !655, templateParams: !4, identifier: "6a6e53963d294fb9bcb67b6a5aee5592")
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !654, file: !2, baseType: !646, size: 64, align: 64, flags: DIFlagArtificial)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !654, file: !2, baseType: !648, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !634, file: !2, baseType: !659, size: 128, align: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !631, file: !2, size: 128, align: 64, elements: !660, templateParams: !640, identifier: "28373595b4cd722276284465e2329572::Err")
!660 = !{!661}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !659, file: !2, baseType: !642, size: 128, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, scope: !632, file: !2, baseType: !122, size: 64, align: 64, flags: DIFlagArtificial)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !625, file: !2, baseType: !664, size: 192, align: 64, extraData: i64 1)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !623, file: !2, size: 192, align: 64, elements: !665, templateParams: !629, identifier: "dc31879507e16af2bf7b272532e6045f::Some")
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !664, file: !2, baseType: !631, size: 128, align: 64, offset: 64)
!667 = !{!668}
!668 = !DITemplateTypeParameter(name: "T", type: !623)
!669 = !{!670}
!670 = !DITemplateTypeParameter(name: "T", type: !620)
!671 = !{!672}
!672 = !DITemplateTypeParameter(name: "T", type: !615)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !608, file: !2, baseType: !674, align: 8)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>>", scope: !141, file: !2, align: 8, elements: !4, templateParams: !671, identifier: "8affee3a4ee64d6bb58b62b8041baeef")
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !575, file: !2, baseType: !676, size: 256, align: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !573, file: !2, size: 256, align: 64, elements: !677, templateParams: !579, identifier: "885b8f095cf62fbae94245c0cde41b5f::Some")
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !676, file: !2, baseType: !581, size: 256, align: 64)
!679 = !{!680}
!680 = !DITemplateTypeParameter(name: "T", type: !573)
!681 = !{!682}
!682 = !DITemplateTypeParameter(name: "T", type: !565)
!683 = !{!684}
!684 = !DITemplateTypeParameter(name: "T", type: !560)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !553, file: !2, baseType: !686, align: 8)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>>", scope: !141, file: !2, align: 8, elements: !4, templateParams: !683, identifier: "750c4b770718988ecf6a78b2b6108fe6")
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !549, file: !2, baseType: !688, align: 8)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>>", scope: !141, file: !2, align: 8, elements: !4, templateParams: !689, identifier: "fb287aa14eaf90af5554ed592d876168")
!689 = !{!690}
!690 = !DITemplateTypeParameter(name: "T", type: !553)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !546, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !546, file: !2, baseType: !182, align: 8)
!693 = !{!690, !185}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !543, file: !2, baseType: !129, size: 64, align: 64, offset: 128)
!695 = !{!696}
!696 = !DITemplateTypeParameter(name: "T", type: !543)
!697 = !{!698}
!698 = !DITemplateTypeParameter(name: "T", type: !535)
!699 = !{!700}
!700 = !DITemplateTypeParameter(name: "T", type: !530)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !523, file: !2, baseType: !702, align: 8)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<alloc::sync::Arc<std::sync::mutex::Mutex<core::option::Option<std::thread::JoinHandle<()>>>>, alloc::alloc::Global>>>>", scope: !141, file: !2, align: 8, elements: !4, templateParams: !699, identifier: "84332033a45ebc5dac6bc152a354c0d9")
!703 = !DIDerivedType(tag: DW_TAG_member, name: "wait_group", scope: !519, file: !2, baseType: !704, size: 64, align: 64, offset: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "WaitGroup", scope: !705, file: !2, size: 64, align: 64, elements: !706, templateParams: !4, identifier: "2acb2cd667a74e584b0af5cccc27a5e7")
!705 = !DINamespace(name: "wait_group", scope: !104)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !704, file: !2, baseType: !708, size: 64, align: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<crossbeam_utils::sync::wait_group::Inner>", scope: !233, file: !2, size: 64, align: 64, elements: !709, templateParams: !752, identifier: "6f926c18b0122b0fcb77a75a52f38876")
!709 = !{!710, !756}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !708, file: !2, baseType: !711, size: 64, align: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<crossbeam_utils::sync::wait_group::Inner>>", scope: !132, file: !2, size: 64, align: 64, elements: !712, templateParams: !754, identifier: "376012d048d94b8a817cb460e80c5dca")
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !711, file: !2, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<crossbeam_utils::sync::wait_group::Inner>", baseType: !715, size: 64, align: 64, dwarfAddressSpace: 0)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<crossbeam_utils::sync::wait_group::Inner>", scope: !233, file: !2, size: 448, align: 64, elements: !716, templateParams: !752, identifier: "376c33fc7e6cb83981a063c18a4341a7")
!716 = !{!717, !718, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !715, file: !2, baseType: !201, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !715, file: !2, baseType: !201, size: 64, align: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !715, file: !2, baseType: !720, size: 320, align: 64, offset: 128)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !705, file: !2, size: 320, align: 64, elements: !721, templateParams: !4, identifier: "2dec7db462f2692a33bf9b28e4ca4b11")
!721 = !{!722, !751}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "cvar", scope: !720, file: !2, baseType: !723, size: 128, align: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !423, file: !2, size: 128, align: 64, elements: !724, templateParams: !4, identifier: "c8540866219c437de5b41e2316c1433f")
!724 = !{!725}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !723, file: !2, baseType: !726, size: 128, align: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !727, file: !2, size: 128, align: 64, elements: !728, templateParams: !4, identifier: "b3c0c4e16bb2304b107658b8e54b33d6")
!727 = !DINamespace(name: "condvar", scope: !57)
!728 = !{!729, !746}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !726, file: !2, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::sys::unix::condvar::Condvar, alloc::alloc::Global>", baseType: !731, size: 64, align: 64, dwarfAddressSpace: 0)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !732, file: !2, size: 384, align: 64, elements: !733, templateParams: !4, identifier: "b9fa746dd3044c5ec9fd1cd9c76d358e")
!732 = !DINamespace(name: "condvar", scope: !63)
!733 = !{!734}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !731, file: !2, baseType: !735, size: 384, align: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<libc::unix::linux_like::linux::pthread_cond_t>", scope: !37, file: !2, size: 384, align: 64, elements: !736, templateParams: !744, identifier: "6a72a6256ba969b649833968f479da13")
!736 = !{!737}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !735, file: !2, baseType: !738, size: 384, align: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_cond_t", scope: !71, file: !2, size: 384, align: 64, elements: !739, templateParams: !4, identifier: "be881df7d9f03834765f2fd2d1091b08")
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !738, file: !2, baseType: !741, size: 384, align: 8)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 384, align: 8, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 48, lowerBound: 0)
!744 = !{!745}
!745 = !DITemplateTypeParameter(name: "T", type: !738)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !726, file: !2, baseType: !747, size: 64, align: 64, offset: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "SameMutexCheck", scope: !748, file: !2, size: 64, align: 64, elements: !749, templateParams: !4, identifier: "29dd7d84624247479cb3855110d2102b")
!748 = !DINamespace(name: "check", scope: !727)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !747, file: !2, baseType: !201, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !720, file: !2, baseType: !365, size: 192, align: 64, offset: 128)
!752 = !{!753}
!753 = !DITemplateTypeParameter(name: "T", type: !720)
!754 = !{!755}
!755 = !DITemplateTypeParameter(name: "T", type: !715)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !708, file: !2, baseType: !757, align: 8)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<crossbeam_utils::sync::wait_group::Inner>>", scope: !141, file: !2, align: 8, elements: !4, templateParams: !754, identifier: "1fa4da035b486f676501881819b3e52a")
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !519, file: !2, baseType: !759, align: 8)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&mut &()>", scope: !141, file: !2, align: 8, elements: !4, templateParams: !760, identifier: "929453621c01625141f9705b71553a00")
!760 = !{!761}
!761 = !DITemplateTypeParameter(name: "T", type: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &()", baseType: !763, size: 64, align: 64, dwarfAddressSpace: 0)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !391, size: 64, align: 64, dwarfAddressSpace: 0)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !767, identifier: "vtable")
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::thread::Builder", baseType: !768, size: 64, align: 64, dwarfAddressSpace: 0)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "Builder", scope: !148, file: !2, size: 320, align: 64, elements: !769, templateParams: !4, identifier: "b16137263913302cd67d8a5c187f6b38")
!769 = !{!770, !802}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !768, file: !2, baseType: !771, size: 192, align: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::string::String>", scope: !15, file: !2, size: 192, align: 64, elements: !772, identifier: "67027ad9c25424f98f4def2c6ef6fe76")
!772 = !{!773}
!773 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 192, align: 64, elements: !774, templateParams: !777, identifier: "67027ad9c25424f98f4def2c6ef6fe76_variant_part", discriminator: !194)
!774 = !{!775, !798}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !773, file: !2, baseType: !776, size: 192, align: 64, extraData: i64 0)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !771, file: !2, size: 192, align: 64, elements: !4, templateParams: !777, identifier: "67027ad9c25424f98f4def2c6ef6fe76::None")
!777 = !{!778}
!778 = !DITemplateTypeParameter(name: "T", type: !779)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !780, file: !2, size: 192, align: 64, elements: !781, templateParams: !4, identifier: "cfe621014755e10eb2a74f207341053e")
!780 = !DINamespace(name: "string", scope: !164)
!781 = !{!782}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !779, file: !2, baseType: !783, size: 192, align: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !163, file: !2, size: 192, align: 64, elements: !784, templateParams: !796, identifier: "1baa0a848530de80e582b4239f7a797b")
!784 = !{!785, !797}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !783, file: !2, baseType: !786, size: 128, align: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !168, file: !2, size: 128, align: 64, elements: !787, templateParams: !796, identifier: "8280176023313cc19e84c8e31f077db8")
!787 = !{!788, !794, !795}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !786, file: !2, baseType: !789, size: 64, align: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !172, file: !2, size: 64, align: 64, elements: !790, templateParams: !96, identifier: "a00903ff63a043f314860ea41133f85")
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !789, file: !2, baseType: !136, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !789, file: !2, baseType: !793, align: 8)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !141, file: !2, align: 8, elements: !4, templateParams: !96, identifier: "f1af3433f93ab467340e4a9a1f1aa719")
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !786, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !786, file: !2, baseType: !182, align: 8)
!796 = !{!97, !185}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !783, file: !2, baseType: !129, size: 64, align: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !773, file: !2, baseType: !799, size: 192, align: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !771, file: !2, size: 192, align: 64, elements: !800, templateParams: !777, identifier: "67027ad9c25424f98f4def2c6ef6fe76::Some")
!800 = !{!801}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !799, file: !2, baseType: !779, size: 192, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !768, file: !2, baseType: !803, size: 128, align: 64, offset: 192)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !15, file: !2, size: 128, align: 64, elements: !804, identifier: "ea92abe30ac28ff5d83f5e69d0621a6")
!804 = !{!805}
!805 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 128, align: 64, elements: !806, templateParams: !178, identifier: "ea92abe30ac28ff5d83f5e69d0621a6_variant_part", discriminator: !194)
!806 = !{!807, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !805, file: !2, baseType: !808, size: 128, align: 64, extraData: i64 0)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !803, file: !2, size: 128, align: 64, elements: !4, templateParams: !178, identifier: "ea92abe30ac28ff5d83f5e69d0621a6::None")
!809 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !805, file: !2, baseType: !810, size: 128, align: 64, extraData: i64 1)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !803, file: !2, size: 128, align: 64, elements: !811, templateParams: !178, identifier: "ea92abe30ac28ff5d83f5e69d0621a6::Some")
!811 = !{!812}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !810, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "THREAD_INDICES", linkageName: "_RNvNtNtCs48Yq53b35jF_15crossbeam_utils4sync12sharded_lock14THREAD_INDICES", scope: !103, file: !815, line: 161, type: !816, isLocal: true, isDefinition: true, align: 1)
!815 = !DIFile(filename: "/home/skeet/.cargo/registry/src/github.com-1ecc6299db9ec823/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "THREAD_INDICES", scope: !103, file: !2, align: 8, elements: !817, templateParams: !4, identifier: "8365887f94f71f4ab1a28f8875b0ddd6")
!817 = !{!818}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !816, file: !2, baseType: !391, align: 8)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_RNvNvNvXsi_NtNtCs48Yq53b35jF_15crossbeam_utils4sync12sharded_lockNtB9_14THREAD_INDICESNtNtNtCs3p84KrD9aKt_4core3ops5deref5Deref5deref11___stability4LAZY", scope: !821, file: !824, line: 55, type: !33, isLocal: true, isDefinition: true, align: 8)
!821 = !DINamespace(name: "__stability", scope: !822)
!822 = !DINamespace(name: "deref", scope: !823)
!823 = !DINamespace(name: "{{impl}}", scope: !103)
!824 = !DIFile(filename: "/home/skeet/.cargo/registry/src/github.com-1ecc6299db9ec823/lazy_static-1.4.0/src/inline_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "fc5d559d75244cdb0dd66f0094444434")
!825 = !{i32 7, !"PIC Level", i32 2}
!826 = !{i32 2, !"RtLibUseGOT", i32 1}
!827 = !{i32 2, !"Debug Info Version", i32 3}
!828 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !829, producer: "clang LLVM (rustc version 1.51.0-nightly (e38fb306b 2021-01-14))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !830, globals: !862)
!829 = !DIFile(filename: "/home/skeet/.cargo/registry/src/github.com-1ecc6299db9ec823/crossbeam-utils-0.8.1/src/lib.rs", directory: "/home/skeet/Documents/o2_lab/rust/race_examples/waitgroup_test/target/debug/deps")
!830 = !{!831, !835, !839, !507, !848, !855}
!831 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fallibility", scope: !126, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !832)
!832 = !{!833, !834}
!833 = !DIEnumerator(name: "Fallible", value: 0)
!834 = !DIEnumerator(name: "Infallible", value: 1)
!835 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !632, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !836)
!836 = !{!837, !838}
!837 = !DIEnumerator(name: "Ok", value: 0)
!838 = !DIEnumerator(name: "Err", value: 1)
!839 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !840, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !843)
!840 = !DINamespace(name: "v1", scope: !841)
!841 = !DINamespace(name: "rt", scope: !842)
!842 = !DINamespace(name: "fmt", scope: !16)
!843 = !{!844, !845, !846, !847}
!844 = !DIEnumerator(name: "Left", value: 0)
!845 = !DIEnumerator(name: "Right", value: 1)
!846 = !DIEnumerator(name: "Center", value: 2)
!847 = !DIEnumerator(name: "Unknown", value: 3)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !849, file: !2, baseType: !850, size: 8, align: 8, flags: DIFlagEnumClass, elements: !851)
!849 = !DINamespace(name: "cmp", scope: !16)
!850 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!851 = !{!852, !853, !854}
!852 = !DIEnumerator(name: "Less", value: -1)
!853 = !DIEnumerator(name: "Equal", value: 0)
!854 = !DIEnumerator(name: "Greater", value: 1)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !89, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !856)
!856 = !{!857, !858, !859, !860, !861}
!857 = !DIEnumerator(name: "Relaxed", value: 0)
!858 = !DIEnumerator(name: "Release", value: 1)
!859 = !DIEnumerator(name: "Acquire", value: 2)
!860 = !DIEnumerator(name: "AcqRel", value: 3)
!861 = !DIEnumerator(name: "SeqCst", value: 4)
!862 = !{!0, !312, !338, !355, !373, !397, !405, !412, !428, !431, !435, !448, !459, !462, !465, !514, !764, !813, !819}
!863 = distinct !DISubprogram(name: "get_unchecked<u8,usize>", linkageName: "_RINvMNtCs3p84KrD9aKt_4core5sliceSh13get_uncheckedjECs48Yq53b35jF_15crossbeam_utils", scope: !865, file: !864, line: 337, type: !867, scopeLine: 337, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !828, templateParams: !877, retainedNodes: !874)
!864 = !DIFile(filename: "/rustc/e38fb306b7f5e65cca34df2dab1f0db15e1defb4/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f5494adcfbc3c204c13d8f3611aba5e3")
!865 = !DINamespace(name: "{{impl}}", scope: !866)
!866 = !DINamespace(name: "slice", scope: !16)
!867 = !DISubroutineType(types: !868)
!868 = !{!869, !870, !129}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !871, templateParams: !4, identifier: "585202bcfc7dfd1dd72e8befe2491ee4")
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !870, file: !2, baseType: !136, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !870, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!874 = !{!875, !876}
!875 = !DILocalVariable(name: "self", arg: 1, scope: !863, file: !864, line: 337, type: !870)
!876 = !DILocalVariable(name: "index", arg: 2, scope: !863, file: !864, line: 337, type: !129)
!877 = !{!97, !878}
!878 = !DITemplateTypeParameter(name: "I", type: !129)
!879 = !DILocation(line: 337, column: 36, scope: !863)
!880 = !DILocation(line: 337, column: 43, scope: !863)
!881 = !DILocation(line: 344, column: 20, scope: !863)
!882 = !DILocation(line: 345, column: 6, scope: !863)
!883 = distinct !DISubprogram(name: "get_unchecked_mut<u8,usize>", linkageName: "_RINvMNtCs3p84KrD9aKt_4core5sliceSh17get_unchecked_mutjECs48Yq53b35jF_15crossbeam_utils", scope: !865, file: !864, line: 373, type: !884, scopeLine: 373, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !828, templateParams: !877, retainedNodes: !891)
!884 = !DISubroutineType(types: !885)
!885 = !{!886, !887, !129}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u8", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !888, templateParams: !4, identifier: "7596319ecf86f60af9b48d8c05ebf9f7")
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !887, file: !2, baseType: !136, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !887, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!891 = !{!892, !893}
!892 = !DILocalVariable(name: "self", arg: 1, scope: !883, file: !864, line: 373, type: !887)
!893 = !DILocalVariable(name: "index", arg: 2, scope: !883, file: !864, line: 373, type: !129)
!894 = !DILocation(line: 373, column: 40, scope: !883)
!895 = !DILocation(line: 373, column: 51, scope: !883)
!896 = !DILocation(line: 380, column: 24, scope: !883)
!897 = !DILocation(line: 381, column: 6, scope: !883)
!898 = distinct !DISubprogram(name: "ok_or<core::ptr::non_null::NonNull<u8>,core::alloc::AllocError>", linkageName: "_RINvMNtCs3p84KrD9aKt_4core6optionINtB3_6OptionINtNtNtB5_3ptr8non_null7NonNullhEE5ok_orNtNtB5_5alloc10AllocErrorECs48Yq53b35jF_15crossbeam_utils", scope: !900, file: !899, line: 531, type: !912, scopeLine: 531, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !828, templateParams: !922, retainedNodes: !929)
!899 = !DIFile(filename: "/rustc/e38fb306b7f5e65cca34df2dab1f0db15e1defb4/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "bf7fc38cde9f1dd32b300f1d80413818")
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::ptr::non_null::NonNull<u8>>", scope: !15, file: !2, size: 64, align: 64, elements: !901, identifier: "47741a1cc8aeefeeef407fb45e4501fc")
!901 = !{!902}
!902 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 64, align: 64, elements: !903, templateParams: !906, identifier: "47741a1cc8aeefeeef407fb45e4501fc_variant_part", discriminator: !194)
!903 = !{!904, !908}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !902, file: !2, baseType: !905, size: 64, align: 64, extraData: i64 0)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !900, file: !2, size: 64, align: 64, elements: !4, templateParams: !906, identifier: "47741a1cc8aeefeeef407fb45e4501fc::None")
!906 = !{!907}
!907 = !DITemplateTypeParameter(name: "T", type: !131)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !902, file: !2, baseType: !909, size: 64, align: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !900, file: !2, size: 64, align: 64, elements: !910, templateParams: !906, identifier: "47741a1cc8aeefeeef407fb45e4501fc::Some")
!910 = !{!911}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !909, file: !2, baseType: !131, size: 64, align: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!914, !900, !924}
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::ptr::non_null::NonNull<u8>, core::alloc::AllocError>", scope: !632, file: !2, size: 64, align: 64, elements: !915, identifier: "b553386c217f7f01846844a976121d7d")
!915 = !{!916}
!916 = !DICompositeType(tag: DW_TAG_variant_part, scope: !632, file: !2, size: 64, align: 64, elements: !917, templateParams: !922, identifier: "b553386c217f7f01846844a976121d7d_variant_part", discriminator: !662)
!917 = !{!918, !925}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !916, file: !2, baseType: !919, size: 64, align: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !914, file: !2, size: 64, align: 64, elements: !920, templateParams: !922, identifier: "b553386c217f7f01846844a976121d7d::Ok")
!920 = !{!921}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !919, file: !2, baseType: !131, size: 64, align: 64)
!922 = !{!907, !923}
!923 = !DITemplateTypeParameter(name: "E", type: !924)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "AllocError", scope: !402, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "14d25876e94ba59b5e0f166225d2aea7")
!925 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !916, file: !2, baseType: !926, size: 64, align: 64, extraData: i64 0)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !914, file: !2, size: 64, align: 64, elements: !927, templateParams: !922, identifier: "b553386c217f7f01846844a976121d7d::Err")
!927 = !{!928}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !926, file: !2, baseType: !924, align: 8)
!929 = !{!930, !931, !932}
!930 = !DILocalVariable(name: "self", arg: 1, scope: !898, file: !899, line: 531, type: !900)
!931 = !DILocalVariable(name: "err", arg: 2, scope: !898, file: !899, line: 531, type: !924)
!932 = !DILocalVariable(name: "v", scope: !933, file: !899, line: 533, type: !131, align: 8)
!933 = distinct !DILexicalBlock(scope: !898, file: !899, line: 533, column: 13)
!934 = !DILocation(line: 531, column: 21, scope: !898)
!935 = !DILocation(line: 531, column: 27, scope: !898)
!936 = !DILocation(line: 533, column: 13, scope: !898)
!937 = !DILocation(line: 534, column: 25, scope: !898)
!938 = !DILocation(line: 534, column: 21, scope: !898)
!939 = !DILocation(line: 532, column: 9, scope: !898)
!940 = !DILocation(line: 532, column: 15, scope: !898)
!941 = !DILocation(line: 533, column: 18, scope: !898)
!942 = !DILocation(line: 533, column: 18, scope: !933)
!943 = !DILocation(line: 533, column: 24, scope: !933)
!944 = !DILocation(line: 536, column: 5, scope: !898)
!945 = !DILocation(line: 536, column: 6, scope: !898)
!946 = !DILocation(line: 531, column: 5, scope: !898)
!947 = !{i8 0, i8 2}
!948 = distinct !DISubprogram(name: "ok_or<core::alloc::layout::Layout,core::option::NoneError>", linkageName: "_RINvMNtCs3p84KrD9aKt_4core6optionINtB3_6OptionNtNtNtB5_5alloc6layout6LayoutE5ok_orNtB3_9NoneErrorECs48Yq53b35jF_15crossbeam_utils", scope: !949, file: !899, line: 531, type: !968, scopeLine: 531, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !828, templateParams: !978, retainedNodes: !986)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::alloc::layout::Layout>", scope: !15, file: !2, size: 128, align: 64, elements: !950, identifier: "e6c4f658755bfc4cce472426e28bb7fe")
!950 = !{!951}
!951 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 128, align: 64, elements: !952, templateParams: !955, identifier: "e6c4f658755bfc4cce472426e28bb7fe_variant_part", discriminator: !497)
!952 = !{!953, !964}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !951, file: !2, baseType: !954, size: 128, align: 64, extraData: i64 0)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !949, file: !2, size: 128, align: 64, elements: !4, templateParams: !955, identifier: "e6c4f658755bfc4cce472426e28bb7fe::None")
!955 = !{!956}
!956 = !DITemplateTypeParameter(name: "T", type: !957)
