; ModuleID = '4t05ckc08th858ty'
source_filename = "4t05ckc08th858ty"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"[closure@std::thread::Builder::spawn_unchecked<[closure@src/main.rs:25:20: 44:7], ()>::{closure#0}]" = type { [0 x i64], i64*, [0 x i64], i64*, [0 x i64], %"[closure@src/main.rs:25:20: 44:7]", [0 x i64], i64*, [0 x i64] }
%"[closure@src/main.rs:25:20: 44:7]" = type { [0 x i64], i64*, [0 x i64], { i64, i8* }, [0 x i64] }
%"std::io::Error" = type { [0 x i64], %"std::io::error::Repr", [0 x i64] }
%"std::io::error::Repr" = type { [0 x i8], i8, [15 x i8] }
%"std::fmt::Formatter" = type { [0 x i64], { i64, i64 }, [0 x i64], { i64, i64 }, [0 x i64], { {}*, [3 x i64]* }, [0 x i32], i32, [0 x i32], i32, [0 x i8], i8, [7 x i8] }
%"std::sync::mpsc::RecvError" = type {}
%"std::sync::atomic::AtomicUsize" = type { [0 x i64], i64, [0 x i64] }
%"std::result::Result<std::thread::JoinHandle<()>, std::io::Error>" = type { [0 x i64], i64, [4 x i64] }
%"std::thread::Builder" = type { [0 x i64], %"std::option::Option<std::string::String>", [0 x i64], { i64, i64 }, [0 x i64] }
%"std::option::Option<std::string::String>" = type { [0 x i64], {}*, [2 x i64] }
%"std::result::Result<std::sys::unix::thread::Thread, std::io::Error>" = type { [0 x i64], i64, [2 x i64] }
%"std::thread::JoinInner<()>" = type { [0 x i64], { i64, i64 }, [0 x i64], i64*, [0 x i64], i64*, [0 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !5, identifier: "vtable")
!4 = !{}
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !6, file: !2, size: 384, align: 64, elements: !10, templateParams: !4, identifier: "eec4f7a2815de9497fe16afaf993d548")
!6 = !DINamespace(name: "spawn_unchecked", scope: !7)
!7 = !DINamespace(name: "{{impl}}", scope: !8)
!8 = !DINamespace(name: "thread", scope: !9)
!9 = !DINamespace(name: "std", scope: null)
!10 = !{!11, !113, !212, !649}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !5, file: !2, baseType: !12, size: 64, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !8, file: !2, size: 64, align: 64, elements: !13, templateParams: !4, identifier: "15127dee45bf2be32874e7c7bf7c0ae6")
!13 = !{!14}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !12, file: !2, baseType: !15, size: 64, align: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner>", scope: !16, file: !2, size: 64, align: 64, elements: !18, templateParams: !106, identifier: "2087bbdc2002c2dee8ab029616542ef3")
!16 = !DINamespace(name: "sync", scope: !17)
!17 = !DINamespace(name: "alloc", scope: null)
!18 = !{!19, !110}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner>>", scope: !21, file: !2, size: 64, align: 64, elements: !24, templateParams: !108, identifier: "e91db83023a31648ce50af0b38feaff1")
!21 = !DINamespace(name: "non_null", scope: !22)
!22 = !DINamespace(name: "ptr", scope: !23)
!23 = !DINamespace(name: "core", scope: null)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !20, file: !2, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Inner>", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !16, file: !2, size: 384, align: 64, elements: !28, templateParams: !106, identifier: "93ca378ddd27e9561e89c3d2506ac2a8")
!28 = !{!29, !42, !43}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !27, file: !2, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !31, file: !2, size: 64, align: 64, elements: !33, templateParams: !4, identifier: "6111d960802cd765eba1866cb776b357")
!31 = !DINamespace(name: "atomic", scope: !32)
!32 = !DINamespace(name: "sync", scope: !23)
!33 = !{!34}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !30, file: !2, baseType: !35, size: 64, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !36, file: !2, size: 64, align: 64, elements: !37, templateParams: !40, identifier: "fc2aa4ffe8447d5d421ff0563135e87c")
!36 = !DINamespace(name: "cell", scope: !23)
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !35, file: !2, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!40 = !{!41}
!41 = !DITemplateTypeParameter(name: "T", type: !39)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !27, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !27, file: !2, baseType: !44, size: 256, align: 64, offset: 128)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !8, file: !2, size: 256, align: 64, elements: !45, templateParams: !4, identifier: "ca5c69cf62f3a4d6f1fb008d0d334c3d")
!45 = !{!46, !81, !90}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !2, baseType: !47, size: 128, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::ffi::c_str::CString>", scope: !48, file: !2, size: 128, align: 64, elements: !49, identifier: "a7f21f128c6692227724ca30f07bf29")
!48 = !DINamespace(name: "option", scope: !23)
!49 = !{!50}
!50 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 128, align: 64, elements: !51, templateParams: !54, identifier: "a7f21f128c6692227724ca30f07bf29_variant_part", discriminator: !79)
!51 = !{!52, !75}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !50, file: !2, baseType: !53, size: 128, align: 64, extraData: i64 0)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !47, file: !2, size: 128, align: 64, elements: !4, templateParams: !54, identifier: "a7f21f128c6692227724ca30f07bf29::None")
!54 = !{!55}
!55 = !DITemplateTypeParameter(name: "T", type: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !57, file: !2, size: 128, align: 64, elements: !59, templateParams: !4, identifier: "65c3bf023a6b555dfc9cb51543ba37c2")
!57 = !DINamespace(name: "c_str", scope: !58)
!58 = !DINamespace(name: "ffi", scope: !9)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !56, file: !2, baseType: !61, size: 128, align: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !62, templateParams: !67, identifier: "e4a6a6843d910ea2bc51304fe56862c1")
!62 = !{!63, !66}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !61, file: !2, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !61, file: !2, baseType: !39, size: 64, align: 64, offset: 64)
!67 = !{!68, !72}
!68 = !DITemplateTypeParameter(name: "T", type: !69)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: -1, lowerBound: 0)
!72 = !DITemplateTypeParameter(name: "A", type: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !74, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "e4d51af9c1e83fbc6db181ae5bd11b43")
!74 = !DINamespace(name: "alloc", scope: !17)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !50, file: !2, baseType: !76, size: 128, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !47, file: !2, size: 128, align: 64, elements: !77, templateParams: !54, identifier: "a7f21f128c6692227724ca30f07bf29::Some")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !76, file: !2, baseType: !56, size: 128, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, scope: !48, file: !2, baseType: !80, size: 64, align: 64, flags: DIFlagArtificial)
!80 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !44, file: !2, baseType: !82, size: 64, align: 64, offset: 128)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !8, file: !2, size: 64, align: 64, elements: !83, templateParams: !4, identifier: "f6f0259fc13e9ca7ee42c3dba2d790b6")
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !82, file: !2, baseType: !85, size: 64, align: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64", scope: !86, file: !2, size: 64, align: 64, elements: !88, templateParams: !4, identifier: "4cc35938c55db79bf670fe332761a87e")
!86 = !DINamespace(name: "nonzero", scope: !87)
!87 = !DINamespace(name: "num", scope: !23)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !85, file: !2, baseType: !80, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !44, file: !2, baseType: !91, size: 32, align: 32, offset: 192)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !92, file: !2, size: 32, align: 32, elements: !95, templateParams: !4, identifier: "2623f5fbacf1ccb41ebe95392b878648")
!92 = !DINamespace(name: "futex", scope: !93)
!93 = !DINamespace(name: "thread_parker", scope: !94)
!94 = !DINamespace(name: "sys_common", scope: !9)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !91, file: !2, baseType: !97, size: 32, align: 32)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicI32", scope: !31, file: !2, size: 32, align: 32, elements: !98, templateParams: !4, identifier: "12669af73a135436b0f8dfc54de2379e")
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !97, file: !2, baseType: !100, size: 32, align: 32)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<i32>", scope: !36, file: !2, size: 32, align: 32, elements: !101, templateParams: !104, identifier: "e8ec75710d5d461ce19362a0145d2da2")
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !2, baseType: !103, size: 32, align: 32)
!103 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!104 = !{!105}
!105 = !DITemplateTypeParameter(name: "T", type: !103)
!106 = !{!107}
!107 = !DITemplateTypeParameter(name: "T", type: !44)
!108 = !{!109}
!109 = !DITemplateTypeParameter(name: "T", type: !27)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !15, file: !2, baseType: !111, align: 8)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !108, identifier: "8136fd2d487bcd484aa9276f4931545a")
!112 = !DINamespace(name: "marker", scope: !23)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !5, file: !2, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !48, file: !2, size: 64, align: 64, elements: !115, identifier: "3b6a8665413826826b9a4de3e47f2de")
!115 = !{!116}
!116 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 64, align: 64, elements: !117, templateParams: !120, identifier: "3b6a8665413826826b9a4de3e47f2de_variant_part", discriminator: !79)
!117 = !{!118, !208}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !116, file: !2, baseType: !119, size: 64, align: 64, extraData: i64 0)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !114, file: !2, size: 64, align: 64, elements: !4, templateParams: !120, identifier: "3b6a8665413826826b9a4de3e47f2de::None")
!120 = !{!121}
!121 = !DITemplateTypeParameter(name: "T", type: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !16, file: !2, size: 64, align: 64, elements: !123, templateParams: !202, identifier: "c29b7bdbdeda079b91265854d81497cc")
!123 = !{!124, !206}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !122, file: !2, baseType: !125, size: 64, align: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !21, file: !2, size: 64, align: 64, elements: !126, templateParams: !204, identifier: "cc1f269e5b5ddd934da9a40b7040cdd7")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !125, file: !2, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !16, file: !2, size: 448, align: 64, elements: !130, templateParams: !202, identifier: "ebcad4aa09866de8eed60e1ff1f53874")
!130 = !{!131, !132, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !129, file: !2, baseType: !30, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !129, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !129, file: !2, baseType: !134, size: 320, align: 64, offset: 128)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !135, file: !2, size: 320, align: 64, elements: !137, templateParams: !200, identifier: "c4ec2f1661d001d66d537f7f764290b5")
!135 = !DINamespace(name: "mutex", scope: !136)
!136 = !DINamespace(name: "sync", scope: !9)
!137 = !{!138, !165, !178}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !134, file: !2, baseType: !139, size: 64, align: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovableMutex", scope: !140, file: !2, size: 64, align: 64, elements: !141, templateParams: !4, identifier: "2883e54b1a286dd369be8f96b7965cd0")
!140 = !DINamespace(name: "mutex", scope: !94)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !139, file: !2, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::sys::unix::mutex::Mutex, alloc::alloc::Global>", baseType: !144, size: 64, align: 64, dwarfAddressSpace: 0)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !145, file: !2, size: 320, align: 64, elements: !148, templateParams: !4, identifier: "129bcfa7494c9a7f434cb6f79151c373")
!145 = !DINamespace(name: "mutex", scope: !146)
!146 = !DINamespace(name: "unix", scope: !147)
!147 = !DINamespace(name: "sys", scope: !9)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !144, file: !2, baseType: !150, size: 320, align: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<libc::unix::linux_like::linux::pthread_mutex_t>", scope: !36, file: !2, size: 320, align: 64, elements: !151, templateParams: !163, identifier: "63702e9730594c91262bc73577a77ed")
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !150, file: !2, baseType: !153, size: 320, align: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t", scope: !154, file: !2, size: 320, align: 64, elements: !158, templateParams: !4, identifier: "29417aee2c490952729ea37d7fd7956d")
!154 = !DINamespace(name: "linux", scope: !155)
!155 = !DINamespace(name: "linux_like", scope: !156)
!156 = !DINamespace(name: "unix", scope: !157)
!157 = !DINamespace(name: "libc", scope: null)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !153, file: !2, baseType: !160, size: 320, align: 8)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 320, align: 8, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 40, lowerBound: 0)
!163 = !{!164}
!164 = !DITemplateTypeParameter(name: "T", type: !153)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !134, file: !2, baseType: !166, size: 8, align: 8, offset: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !167, file: !2, size: 8, align: 8, elements: !168, templateParams: !4, identifier: "6bfe09f2d6e576f2167d782127901c9c")
!167 = !DINamespace(name: "poison", scope: !94)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !166, file: !2, baseType: !170, size: 8, align: 8)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !31, file: !2, size: 8, align: 8, elements: !171, templateParams: !4, identifier: "9fae9e53727c4d79df9c89c13279ffb8")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !170, file: !2, baseType: !173, size: 8, align: 8)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !36, file: !2, size: 8, align: 8, elements: !174, templateParams: !176, identifier: "2fa8e20d656222adadd60015061cba20")
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !173, file: !2, baseType: !65, size: 8, align: 8)
!176 = !{!177}
!177 = !DITemplateTypeParameter(name: "T", type: !65)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !2, baseType: !179, size: 192, align: 64, offset: 128)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !36, file: !2, size: 192, align: 64, elements: !180, templateParams: !200, identifier: "24e0068c2559bbd99ae1809c0ba20acf")
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !179, file: !2, baseType: !182, size: 192, align: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !183, file: !2, size: 192, align: 64, elements: !184, templateParams: !198, identifier: "1baa0a848530de80e582b4239f7a797b")
!183 = !DINamespace(name: "vec", scope: !17)
!184 = !{!185, !199}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !182, file: !2, baseType: !186, size: 128, align: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !187, file: !2, size: 128, align: 64, elements: !188, templateParams: !198, identifier: "8280176023313cc19e84c8e31f077db8")
!187 = !DINamespace(name: "raw_vec", scope: !17)
!188 = !{!189, !196, !197}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !186, file: !2, baseType: !190, size: 64, align: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !191, file: !2, size: 64, align: 64, elements: !192, templateParams: !176, identifier: "a00903ff63a043f314860ea41133f85")
!191 = !DINamespace(name: "unique", scope: !22)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !190, file: !2, baseType: !64, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !190, file: !2, baseType: !195, align: 8)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !176, identifier: "f1af3433f93ab467340e4a9a1f1aa719")
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !186, file: !2, baseType: !39, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !186, file: !2, baseType: !73, align: 8)
!198 = !{!177, !72}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !182, file: !2, baseType: !39, size: 64, align: 64, offset: 128)
!200 = !{!201}
!201 = !DITemplateTypeParameter(name: "T", type: !182)
!202 = !{!203}
!203 = !DITemplateTypeParameter(name: "T", type: !134)
!204 = !{!205}
!205 = !DITemplateTypeParameter(name: "T", type: !129)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !122, file: !2, baseType: !207, align: 8)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !204, identifier: "10bed538975768c986829c6885a6fb0e")
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !116, file: !2, baseType: !209, size: 64, align: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !114, file: !2, size: 64, align: 64, elements: !210, templateParams: !120, identifier: "3b6a8665413826826b9a4de3e47f2de::Some")
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !209, file: !2, baseType: !122, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !5, file: !2, baseType: !213, size: 192, align: 64, offset: 128)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !214, file: !2, size: 192, align: 64, elements: !216, templateParams: !4, identifier: "1e051f5f1783c5db88a101a672775afe")
!214 = !DINamespace(name: "main", scope: !215)
!215 = !DINamespace(name: "mutex_test", scope: null)
!216 = !{!217, !241}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !213, file: !2, baseType: !218, size: 64, align: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<usize>>", scope: !16, file: !2, size: 64, align: 64, elements: !219, templateParams: !235, identifier: "94ff11edf76b6fb847b877b1875b7fa3")
!219 = !{!220, !239}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !218, file: !2, baseType: !221, size: 64, align: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<usize>>>", scope: !21, file: !2, size: 64, align: 64, elements: !222, templateParams: !237, identifier: "d4666d2fb18ed91e9bff02119e36b2ee")
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !221, file: !2, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<usize>>", baseType: !225, size: 64, align: 64, dwarfAddressSpace: 0)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<usize>>", scope: !16, file: !2, size: 320, align: 64, elements: !226, templateParams: !235, identifier: "2916f10b6d1342a748ab723e11d04657")
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !225, file: !2, baseType: !30, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !225, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !2, baseType: !230, size: 192, align: 64, offset: 128)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<usize>", scope: !135, file: !2, size: 192, align: 64, elements: !231, templateParams: !40, identifier: "921201153a98fe96e4850072306bcc2c")
!231 = !{!232, !233, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !230, file: !2, baseType: !139, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !230, file: !2, baseType: !166, size: 8, align: 8, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !230, file: !2, baseType: !35, size: 64, align: 64, offset: 128)
!235 = !{!236}
!236 = !DITemplateTypeParameter(name: "T", type: !230)
!237 = !{!238}
!238 = !DITemplateTypeParameter(name: "T", type: !225)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !218, file: !2, baseType: !240, align: 8)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<usize>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !237, identifier: "833ee29bc59b6a238a361f8a933bc766")
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !213, file: !2, baseType: !242, size: 128, align: 64, offset: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sender<usize>", scope: !243, file: !2, size: 128, align: 64, elements: !244, templateParams: !40, identifier: "ddc993bf6cd29dd56ada6a03fded229e")
!243 = !DINamespace(name: "mpsc", scope: !136)
!244 = !{!245}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !242, file: !2, baseType: !246, size: 128, align: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::sync::mpsc::Flavor<usize>>", scope: !36, file: !2, size: 128, align: 64, elements: !247, templateParams: !647, identifier: "1547f34c6d7c1bd8aa87e2e9d83879ab")
!247 = !{!248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !246, file: !2, baseType: !249, size: 128, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flavor<usize>", scope: !243, file: !2, size: 128, align: 64, elements: !250, identifier: "8d4a81d5509857aacb473424aa78295f")
!250 = !{!251}
!251 = !DICompositeType(tag: DW_TAG_variant_part, scope: !243, file: !2, size: 128, align: 64, elements: !252, templateParams: !40, identifier: "8d4a81d5509857aacb473424aa78295f_variant_part", discriminator: !646)
!252 = !{!253, !317, !441, !505}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Oneshot", scope: !251, file: !2, baseType: !254, size: 128, align: 64, extraData: i64 0)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Oneshot", scope: !249, file: !2, size: 128, align: 64, elements: !255, templateParams: !40, identifier: "8d4a81d5509857aacb473424aa78295f::Oneshot")
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !254, file: !2, baseType: !257, size: 64, align: 64, offset: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mpsc::oneshot::Packet<usize>>", scope: !16, file: !2, size: 64, align: 64, elements: !258, templateParams: !311, identifier: "d72235cbd40e33e76b7a4a2912d3e6af")
!258 = !{!259, !315}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !257, file: !2, baseType: !260, size: 64, align: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mpsc::oneshot::Packet<usize>>>", scope: !21, file: !2, size: 64, align: 64, elements: !261, templateParams: !313, identifier: "3e682612cc59547a6baf26d5514af0c6")
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !260, file: !2, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mpsc::oneshot::Packet<usize>>", baseType: !264, size: 64, align: 64, dwarfAddressSpace: 0)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mpsc::oneshot::Packet<usize>>", scope: !16, file: !2, size: 448, align: 64, elements: !265, templateParams: !311, identifier: "f9cf747486b52ed1fde560cd0e810814")
!265 = !{!266, !267, !268}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !264, file: !2, baseType: !30, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !264, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !264, file: !2, baseType: !269, size: 320, align: 64, offset: 128)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<usize>", scope: !270, file: !2, size: 320, align: 64, elements: !271, templateParams: !40, identifier: "6badcd3ff651106f634329879f132871")
!270 = !DINamespace(name: "oneshot", scope: !243)
!271 = !{!272, !273, !289}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !269, file: !2, baseType: !30, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !2, baseType: !274, size: 128, align: 64, offset: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<usize>>", scope: !36, file: !2, size: 128, align: 64, elements: !275, templateParams: !287, identifier: "8aa993f1f6938e6a931d06eedb520b5c")
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !274, file: !2, baseType: !277, size: 128, align: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !48, file: !2, size: 128, align: 64, elements: !278, identifier: "ea92abe30ac28ff5d83f5e69d0621a6")
!278 = !{!279}
!279 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 128, align: 64, elements: !280, templateParams: !40, identifier: "ea92abe30ac28ff5d83f5e69d0621a6_variant_part", discriminator: !79)
!280 = !{!281, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !279, file: !2, baseType: !282, size: 128, align: 64, extraData: i64 0)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !277, file: !2, size: 128, align: 64, elements: !4, templateParams: !40, identifier: "ea92abe30ac28ff5d83f5e69d0621a6::None")
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !279, file: !2, baseType: !284, size: 128, align: 64, extraData: i64 1)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !277, file: !2, size: 128, align: 64, elements: !285, templateParams: !40, identifier: "ea92abe30ac28ff5d83f5e69d0621a6::Some")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !284, file: !2, baseType: !39, size: 64, align: 64, offset: 64)
!287 = !{!288}
!288 = !DITemplateTypeParameter(name: "T", type: !277)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade", scope: !269, file: !2, baseType: !290, size: 128, align: 64, offset: 192)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::sync::mpsc::oneshot::MyUpgrade<usize>>", scope: !36, file: !2, size: 128, align: 64, elements: !291, templateParams: !309, identifier: "67d18bad1df5622d99db2dcab6185d4f")
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !290, file: !2, baseType: !293, size: 128, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyUpgrade<usize>", scope: !270, file: !2, size: 128, align: 64, elements: !294, identifier: "2214d3f2b7f4e829fd936fd7bc13b953")
!294 = !{!295}
!295 = !DICompositeType(tag: DW_TAG_variant_part, scope: !270, file: !2, size: 128, align: 64, elements: !296, templateParams: !40, identifier: "2214d3f2b7f4e829fd936fd7bc13b953_variant_part", discriminator: !308)
!296 = !{!297, !299, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "NothingSent", scope: !295, file: !2, baseType: !298, size: 128, align: 64, extraData: i64 4)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "NothingSent", scope: !293, file: !2, size: 128, align: 64, elements: !4, templateParams: !40, identifier: "2214d3f2b7f4e829fd936fd7bc13b953::NothingSent")
!299 = !DIDerivedType(tag: DW_TAG_member, name: "SendUsed", scope: !295, file: !2, baseType: !300, size: 128, align: 64, extraData: i64 5)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "SendUsed", scope: !293, file: !2, size: 128, align: 64, elements: !4, templateParams: !40, identifier: "2214d3f2b7f4e829fd936fd7bc13b953::SendUsed")
!301 = !DIDerivedType(tag: DW_TAG_member, name: "GoUp", scope: !295, file: !2, baseType: !302, size: 128, align: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "GoUp", scope: !293, file: !2, size: 128, align: 64, elements: !303, templateParams: !40, identifier: "2214d3f2b7f4e829fd936fd7bc13b953::GoUp")
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !302, file: !2, baseType: !305, size: 128, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Receiver<usize>", scope: !243, file: !2, size: 128, align: 64, elements: !306, templateParams: !40, identifier: "cd05513697b7ca64575489016bebfe6a")
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !305, file: !2, baseType: !246, size: 128, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, scope: !270, file: !2, baseType: !80, size: 64, align: 64, flags: DIFlagArtificial)
!309 = !{!310}
!310 = !DITemplateTypeParameter(name: "T", type: !293)
!311 = !{!312}
!312 = !DITemplateTypeParameter(name: "T", type: !269)
!313 = !{!314}
!314 = !DITemplateTypeParameter(name: "T", type: !264)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !257, file: !2, baseType: !316, align: 8)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mpsc::oneshot::Packet<usize>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !313, identifier: "b1beaacd77f83b50174f01a33ab2e4af")
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Stream", scope: !251, file: !2, baseType: !318, size: 128, align: 64, extraData: i64 1)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stream", scope: !249, file: !2, size: 128, align: 64, elements: !319, templateParams: !40, identifier: "8d4a81d5509857aacb473424aa78295f::Stream")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !318, file: !2, baseType: !321, size: 64, align: 64, offset: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mpsc::stream::Packet<usize>>", scope: !16, file: !2, size: 64, align: 64, elements: !322, templateParams: !435, identifier: "56724637c038b04b570d8cee186a3740")
!322 = !{!323, !439}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !321, file: !2, baseType: !324, size: 64, align: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mpsc::stream::Packet<usize>>>", scope: !21, file: !2, size: 64, align: 64, elements: !325, templateParams: !437, identifier: "d4311ef5cfec41e3820f642fa91dfbf")
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !324, file: !2, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mpsc::stream::Packet<usize>>", baseType: !328, size: 64, align: 64, dwarfAddressSpace: 0)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mpsc::stream::Packet<usize>>", scope: !16, file: !2, size: 1536, align: 512, elements: !329, templateParams: !435, identifier: "62c47a95710228a651a201beecb06be9")
!329 = !{!330, !331, !332}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !328, file: !2, baseType: !30, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !328, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !328, file: !2, baseType: !333, size: 1024, align: 512, offset: 512)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<usize>", scope: !334, file: !2, size: 1024, align: 512, elements: !335, templateParams: !40, identifier: "dce2a7fc019a9031da21a0f4e918993")
!334 = !DINamespace(name: "stream", scope: !243)
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !333, file: !2, baseType: !337, size: 1024, align: 512)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "Queue<std::sync::mpsc::stream::Message<usize>, std::sync::mpsc::stream::ProducerAddition, std::sync::mpsc::stream::ConsumerAddition>", scope: !338, file: !2, size: 1024, align: 512, elements: !339, templateParams: !432, identifier: "5bb8e54e1df8aa6d73bbb681bf5f83ec")
!338 = !DINamespace(name: "spsc_queue", scope: !243)
!339 = !{!340, !409}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "consumer", scope: !337, file: !2, baseType: !341, size: 512, align: 512)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "CacheAligned<std::sync::mpsc::spsc_queue::Consumer<std::sync::mpsc::stream::Message<usize>, std::sync::mpsc::stream::ConsumerAddition>>", scope: !342, file: !2, size: 512, align: 512, elements: !343, templateParams: !407, identifier: "c996d34dae1813a291ac5afccd812012")
!342 = !DINamespace(name: "cache_aligned", scope: !243)
!343 = !{!344, !405}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !341, file: !2, baseType: !345, size: 320, align: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Consumer<std::sync::mpsc::stream::Message<usize>, std::sync::mpsc::stream::ConsumerAddition>", scope: !338, file: !2, size: 320, align: 64, elements: !346, templateParams: !403, identifier: "5ab1dfa89850de9b8a6a8aea772975b9")
!346 = !{!347, !390, !391, !392, !393}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !345, file: !2, baseType: !348, size: 64, align: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut std::sync::mpsc::spsc_queue::Node<std::sync::mpsc::stream::Message<usize>>>", scope: !36, file: !2, size: 64, align: 64, elements: !349, templateParams: !388, identifier: "b5078dc8e3679a18e34073c01b5f783b")
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !348, file: !2, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::sync::mpsc::spsc_queue::Node<std::sync::mpsc::stream::Message<usize>>", baseType: !352, size: 64, align: 64, dwarfAddressSpace: 0)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node<std::sync::mpsc::stream::Message<usize>>", scope: !338, file: !2, size: 320, align: 64, elements: !353, templateParams: !361, identifier: "91da848a0ca032025d29478251d6300")
!353 = !{!354, !380, !382}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !352, file: !2, baseType: !355, size: 192, align: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::sync::mpsc::stream::Message<usize>>", scope: !48, file: !2, size: 192, align: 64, elements: !356, identifier: "167836c4f78b6527a2d7f9b24416a0b7")
!356 = !{!357}
!357 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 192, align: 64, elements: !358, templateParams: !361, identifier: "167836c4f78b6527a2d7f9b24416a0b7_variant_part", discriminator: !79)
!358 = !{!359, !376}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !357, file: !2, baseType: !360, size: 192, align: 64, extraData: i64 2)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !355, file: !2, size: 192, align: 64, elements: !4, templateParams: !361, identifier: "167836c4f78b6527a2d7f9b24416a0b7::None")
!361 = !{!362}
!362 = !DITemplateTypeParameter(name: "T", type: !363)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message<usize>", scope: !334, file: !2, size: 192, align: 64, elements: !364, identifier: "68db408af7ad7835b0e6a13bf812bf53")
!364 = !{!365}
!365 = !DICompositeType(tag: DW_TAG_variant_part, scope: !334, file: !2, size: 192, align: 64, elements: !366, templateParams: !40, identifier: "68db408af7ad7835b0e6a13bf812bf53_variant_part", discriminator: !375)
!366 = !{!367, !371}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !365, file: !2, baseType: !368, size: 192, align: 64, extraData: i64 0)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "Data", scope: !363, file: !2, size: 192, align: 64, elements: !369, templateParams: !40, identifier: "68db408af7ad7835b0e6a13bf812bf53::Data")
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !368, file: !2, baseType: !39, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "GoUp", scope: !365, file: !2, baseType: !372, size: 192, align: 64, extraData: i64 1)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "GoUp", scope: !363, file: !2, size: 192, align: 64, elements: !373, templateParams: !40, identifier: "68db408af7ad7835b0e6a13bf812bf53::GoUp")
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !372, file: !2, baseType: !305, size: 128, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, scope: !334, file: !2, baseType: !80, size: 64, align: 64, flags: DIFlagArtificial)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !357, file: !2, baseType: !377, size: 192, align: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !355, file: !2, size: 192, align: 64, elements: !378, templateParams: !361, identifier: "167836c4f78b6527a2d7f9b24416a0b7::Some")
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !377, file: !2, baseType: !363, size: 192, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !352, file: !2, baseType: !381, size: 8, align: 8, offset: 256)
!381 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !352, file: !2, baseType: !383, size: 64, align: 64, offset: 192)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<std::sync::mpsc::spsc_queue::Node<std::sync::mpsc::stream::Message<usize>>>", scope: !31, file: !2, size: 64, align: 64, elements: !384, templateParams: !386, identifier: "918e3e92bc0d4b9ce37611b95d20a5af")
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !383, file: !2, baseType: !348, size: 64, align: 64)
!386 = !{!387}
!387 = !DITemplateTypeParameter(name: "T", type: !352)
!388 = !{!389}
!389 = !DITemplateTypeParameter(name: "T", type: !351)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tail_prev", scope: !345, file: !2, baseType: !383, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bound", scope: !345, file: !2, baseType: !39, size: 64, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "cached_nodes", scope: !345, file: !2, baseType: !30, size: 64, align: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "addition", scope: !345, file: !2, baseType: !394, size: 64, align: 64, offset: 256)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConsumerAddition", scope: !334, file: !2, size: 64, align: 64, elements: !395, templateParams: !4, identifier: "f75a3d17c30f8377b774e7a6ed45fe8")
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "steals", scope: !394, file: !2, baseType: !397, size: 64, align: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<isize>", scope: !36, file: !2, size: 64, align: 64, elements: !398, templateParams: !401, identifier: "95fa66467a0b4bdd25cf4279d4e4c53a")
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !397, file: !2, baseType: !400, size: 64, align: 64)
!400 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!401 = !{!402}
!402 = !DITemplateTypeParameter(name: "T", type: !400)
!403 = !{!362, !404}
!404 = !DITemplateTypeParameter(name: "Addition", type: !394)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !341, file: !2, baseType: !406, align: 512)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Aligner", scope: !342, file: !2, align: 512, elements: !4, templateParams: !4, identifier: "161964abd7890a41d99b32ae9b1bee03")
!407 = !{!408}
!408 = !DITemplateTypeParameter(name: "T", type: !345)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "producer", scope: !337, file: !2, baseType: !410, size: 512, align: 512, offset: 512)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "CacheAligned<std::sync::mpsc::spsc_queue::Producer<std::sync::mpsc::stream::Message<usize>, std::sync::mpsc::stream::ProducerAddition>>", scope: !342, file: !2, size: 512, align: 512, elements: !411, templateParams: !430, identifier: "f4c2282544c617a1439b5a16baaf38aa")
!411 = !{!412, !429}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !410, file: !2, baseType: !413, size: 384, align: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Producer<std::sync::mpsc::stream::Message<usize>, std::sync::mpsc::stream::ProducerAddition>", scope: !338, file: !2, size: 384, align: 64, elements: !414, templateParams: !427, identifier: "469e2201317f35f7f97063eacea27aaf")
!414 = !{!415, !416, !417, !418}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !413, file: !2, baseType: !348, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !413, file: !2, baseType: !348, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tail_copy", scope: !413, file: !2, baseType: !348, size: 64, align: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "addition", scope: !413, file: !2, baseType: !419, size: 192, align: 64, offset: 192)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProducerAddition", scope: !334, file: !2, size: 192, align: 64, elements: !420, templateParams: !4, identifier: "eca797c155823be6f440065b44a349c6")
!420 = !{!421, !425, !426}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !419, file: !2, baseType: !422, size: 64, align: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicIsize", scope: !31, file: !2, size: 64, align: 64, elements: !423, templateParams: !4, identifier: "26150e1a65695978f91e479c6e45437b")
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !422, file: !2, baseType: !397, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "to_wake", scope: !419, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "port_dropped", scope: !419, file: !2, baseType: !170, size: 8, align: 8, offset: 128)
!427 = !{!362, !428}
!428 = !DITemplateTypeParameter(name: "Addition", type: !419)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !410, file: !2, baseType: !406, align: 512)
!430 = !{!431}
!431 = !DITemplateTypeParameter(name: "T", type: !413)
!432 = !{!362, !433, !434}
!433 = !DITemplateTypeParameter(name: "ProducerAddition", type: !419)
!434 = !DITemplateTypeParameter(name: "ConsumerAddition", type: !394)
!435 = !{!436}
!436 = !DITemplateTypeParameter(name: "T", type: !333)
!437 = !{!438}
!438 = !DITemplateTypeParameter(name: "T", type: !328)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !321, file: !2, baseType: !440, align: 8)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mpsc::stream::Packet<usize>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !437, identifier: "497de9161a98d9b46d608ce291eec338")
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Shared", scope: !251, file: !2, baseType: !442, size: 128, align: 64, extraData: i64 2)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "Shared", scope: !249, file: !2, size: 128, align: 64, elements: !443, templateParams: !40, identifier: "8d4a81d5509857aacb473424aa78295f::Shared")
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !442, file: !2, baseType: !445, size: 64, align: 64, offset: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mpsc::shared::Packet<usize>>", scope: !16, file: !2, size: 64, align: 64, elements: !446, templateParams: !499, identifier: "a5b627425bc3ce4975344ce82b95df3f")
!446 = !{!447, !503}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !445, file: !2, baseType: !448, size: 64, align: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mpsc::shared::Packet<usize>>>", scope: !21, file: !2, size: 64, align: 64, elements: !449, templateParams: !501, identifier: "c2010fef3ad93406b56dd23354524f64")
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !448, file: !2, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mpsc::shared::Packet<usize>>", baseType: !452, size: 64, align: 64, dwarfAddressSpace: 0)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mpsc::shared::Packet<usize>>", scope: !16, file: !2, size: 768, align: 64, elements: !453, templateParams: !499, identifier: "b2cb3c0e2ea79efd3a317772ded679d2")
!453 = !{!454, !455, !456}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !452, file: !2, baseType: !30, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !452, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !452, file: !2, baseType: !457, size: 640, align: 64, offset: 128)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<usize>", scope: !458, file: !2, size: 640, align: 64, elements: !459, templateParams: !40, identifier: "f4f3ecd927fa9da01f1b57a26cb5c7c")
!458 = !DINamespace(name: "shared", scope: !243)
!459 = !{!460, !481, !482, !483, !484, !485, !486, !487}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !457, file: !2, baseType: !461, size: 128, align: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "Queue<usize>", scope: !462, file: !2, size: 128, align: 64, elements: !463, templateParams: !40, identifier: "b2e9dc10c92a593c24c2d447b796a989")
!462 = !DINamespace(name: "mpsc_queue", scope: !243)
!463 = !{!464, !480}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !461, file: !2, baseType: !465, size: 64, align: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<std::sync::mpsc::mpsc_queue::Node<usize>>", scope: !31, file: !2, size: 64, align: 64, elements: !466, templateParams: !478, identifier: "2983e179faae00e9359bd0781c7f8aa0")
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !465, file: !2, baseType: !468, size: 64, align: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut std::sync::mpsc::mpsc_queue::Node<usize>>", scope: !36, file: !2, size: 64, align: 64, elements: !469, templateParams: !476, identifier: "5e5d0e527196094a8dd2c470ecb7dda6")
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !468, file: !2, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::sync::mpsc::mpsc_queue::Node<usize>", baseType: !472, size: 64, align: 64, dwarfAddressSpace: 0)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node<usize>", scope: !462, file: !2, size: 192, align: 64, elements: !473, templateParams: !40, identifier: "d7d699f187c52d2f6cfd485a679029a9")
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !472, file: !2, baseType: !465, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !472, file: !2, baseType: !277, size: 128, align: 64, offset: 64)
!476 = !{!477}
!477 = !DITemplateTypeParameter(name: "T", type: !471)
!478 = !{!479}
!479 = !DITemplateTypeParameter(name: "T", type: !472)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !461, file: !2, baseType: !468, size: 64, align: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !457, file: !2, baseType: !422, size: 64, align: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "steals", scope: !457, file: !2, baseType: !397, size: 64, align: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "to_wake", scope: !457, file: !2, baseType: !30, size: 64, align: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !457, file: !2, baseType: !30, size: 64, align: 64, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "port_dropped", scope: !457, file: !2, baseType: !170, size: 8, align: 8, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sender_drain", scope: !457, file: !2, baseType: !422, size: 64, align: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "select_lock", scope: !457, file: !2, baseType: !488, size: 128, align: 64, offset: 448)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<()>", scope: !135, file: !2, size: 128, align: 64, elements: !489, templateParams: !497, identifier: "b33d38e2d2b7d1e92b7d89d75b602f54")
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !488, file: !2, baseType: !139, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !488, file: !2, baseType: !166, size: 8, align: 8, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !488, file: !2, baseType: !493, align: 8, offset: 72)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<()>", scope: !36, file: !2, align: 8, elements: !494, templateParams: !497, identifier: "e0b18d2a57b2bd5563f6b6fe08e61bad")
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !493, file: !2, baseType: !496, align: 8)
!496 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!497 = !{!498}
!498 = !DITemplateTypeParameter(name: "T", type: !496)
!499 = !{!500}
!500 = !DITemplateTypeParameter(name: "T", type: !457)
!501 = !{!502}
!502 = !DITemplateTypeParameter(name: "T", type: !452)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !445, file: !2, baseType: !504, align: 8)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mpsc::shared::Packet<usize>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !501, identifier: "f3667f99766988f1f5d20cf457a9545c")
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Sync", scope: !251, file: !2, baseType: !506, size: 128, align: 64, extraData: i64 3)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sync", scope: !249, file: !2, size: 128, align: 64, elements: !507, templateParams: !40, identifier: "8d4a81d5509857aacb473424aa78295f::Sync")
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !506, file: !2, baseType: !509, size: 64, align: 64, offset: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mpsc::sync::Packet<usize>>", scope: !16, file: !2, size: 64, align: 64, elements: !510, templateParams: !640, identifier: "7a8ab659df80f11c460bcc0621d81272")
!510 = !{!511, !644}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !509, file: !2, baseType: !512, size: 64, align: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mpsc::sync::Packet<usize>>>", scope: !21, file: !2, size: 64, align: 64, elements: !513, templateParams: !642, identifier: "ca52e0cd930e882c7676dadc377456f0")
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !512, file: !2, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mpsc::sync::Packet<usize>>", baseType: !516, size: 64, align: 64, dwarfAddressSpace: 0)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mpsc::sync::Packet<usize>>", scope: !16, file: !2, size: 1088, align: 64, elements: !517, templateParams: !640, identifier: "f39883f6e409cc06dd4b802cd852217b")
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !516, file: !2, baseType: !30, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !516, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !516, file: !2, baseType: !521, size: 960, align: 64, offset: 128)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<usize>", scope: !522, file: !2, size: 960, align: 64, elements: !523, templateParams: !40, identifier: "fa2e9ee7e1200b15786c969c07aa416c")
!522 = !DINamespace(name: "sync", scope: !243)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !521, file: !2, baseType: !30, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !521, file: !2, baseType: !526, size: 896, align: 64, offset: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<std::sync::mpsc::sync::State<usize>>", scope: !135, file: !2, size: 896, align: 64, elements: !527, templateParams: !638, identifier: "a6d68208a28bba206cbd707e6a99677f")
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !526, file: !2, baseType: !139, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !526, file: !2, baseType: !166, size: 8, align: 8, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !526, file: !2, baseType: !531, size: 768, align: 64, offset: 128)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::sync::mpsc::sync::State<usize>>", scope: !36, file: !2, size: 768, align: 64, elements: !532, templateParams: !638, identifier: "c980c7fc2f591b58907b297e91a34f60")
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !531, file: !2, baseType: !534, size: 768, align: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "State<usize>", scope: !522, file: !2, size: 768, align: 64, elements: !535, templateParams: !40, identifier: "32a85f15c7bd6f3c755d89a1079f8f59")
!535 = !{!536, !537, !585, !601, !623, !624}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !534, file: !2, baseType: !381, size: 8, align: 8, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !534, file: !2, baseType: !538, size: 128, align: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "Queue", scope: !522, file: !2, size: 128, align: 64, elements: !539, templateParams: !4, identifier: "6837522e40164adf12ff9de70ffe5c19")
!539 = !{!540, !584}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !538, file: !2, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::sync::mpsc::sync::Node", baseType: !542, size: 64, align: 64, dwarfAddressSpace: 0)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", scope: !522, file: !2, size: 128, align: 64, elements: !543, templateParams: !4, identifier: "edf063ef007f95cb8070e7584c6403c")
!543 = !{!544, !583}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !542, file: !2, baseType: !545, size: 64, align: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::sync::mpsc::blocking::SignalToken>", scope: !48, file: !2, size: 64, align: 64, elements: !546, identifier: "d4a85c5a35b1321b90902d0bd7764b8a")
!546 = !{!547}
!547 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 64, align: 64, elements: !548, templateParams: !551, identifier: "d4a85c5a35b1321b90902d0bd7764b8a_variant_part", discriminator: !79)
!548 = !{!549, !579}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !547, file: !2, baseType: !550, size: 64, align: 64, extraData: i64 0)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !545, file: !2, size: 64, align: 64, elements: !4, templateParams: !551, identifier: "d4a85c5a35b1321b90902d0bd7764b8a::None")
!551 = !{!552}
!552 = !DITemplateTypeParameter(name: "T", type: !553)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "SignalToken", scope: !554, file: !2, size: 64, align: 64, elements: !555, templateParams: !4, identifier: "9d6852c587e57670e45f6fe46752f687")
!554 = !DINamespace(name: "blocking", scope: !243)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !553, file: !2, baseType: !557, size: 64, align: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mpsc::blocking::Inner>", scope: !16, file: !2, size: 64, align: 64, elements: !558, templateParams: !573, identifier: "952ea8bf2e54aa2d6cac63572c1def40")
!558 = !{!559, !577}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !557, file: !2, baseType: !560, size: 64, align: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mpsc::blocking::Inner>>", scope: !21, file: !2, size: 64, align: 64, elements: !561, templateParams: !575, identifier: "8a2cb51d9aaac8a1edcb2b52aff741e7")
!561 = !{!562}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !560, file: !2, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mpsc::blocking::Inner>", baseType: !564, size: 64, align: 64, dwarfAddressSpace: 0)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mpsc::blocking::Inner>", scope: !16, file: !2, size: 256, align: 64, elements: !565, templateParams: !573, identifier: "1fba61dbf15aa93b425d6b07d00b0403")
!565 = !{!566, !567, !568}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !564, file: !2, baseType: !30, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !564, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !564, file: !2, baseType: !569, size: 128, align: 64, offset: 128)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !554, file: !2, size: 128, align: 64, elements: !570, templateParams: !4, identifier: "8ae59fefc0d791d8839478a3dcd1e93")
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !569, file: !2, baseType: !12, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "woken", scope: !569, file: !2, baseType: !170, size: 8, align: 8, offset: 64)
!573 = !{!574}
!574 = !DITemplateTypeParameter(name: "T", type: !569)
!575 = !{!576}
!576 = !DITemplateTypeParameter(name: "T", type: !564)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !557, file: !2, baseType: !578, align: 8)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mpsc::blocking::Inner>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !575, identifier: "f992da02b3da9f81bc8ce554d3984e63")
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !547, file: !2, baseType: !580, size: 64, align: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !545, file: !2, size: 64, align: 64, elements: !581, templateParams: !551, identifier: "d4a85c5a35b1321b90902d0bd7764b8a::Some")
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !580, file: !2, baseType: !553, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !542, file: !2, baseType: !541, size: 64, align: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !538, file: !2, baseType: !541, size: 64, align: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "blocker", scope: !534, file: !2, baseType: !586, size: 128, align: 64, offset: 128)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blocker", scope: !522, file: !2, size: 128, align: 64, elements: !587, identifier: "41c48357f24f129dbbaa9cbde4ebe2f8")
!587 = !{!588}
!588 = !DICompositeType(tag: DW_TAG_variant_part, scope: !522, file: !2, size: 128, align: 64, elements: !589, templateParams: !4, identifier: "41c48357f24f129dbbaa9cbde4ebe2f8_variant_part", discriminator: !600)
!589 = !{!590, !594, !598}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "BlockedSender", scope: !588, file: !2, baseType: !591, size: 128, align: 64, extraData: i64 0)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "BlockedSender", scope: !586, file: !2, size: 128, align: 64, elements: !592, templateParams: !4, identifier: "41c48357f24f129dbbaa9cbde4ebe2f8::BlockedSender")
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !591, file: !2, baseType: !553, size: 64, align: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "BlockedReceiver", scope: !588, file: !2, baseType: !595, size: 128, align: 64, extraData: i64 1)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "BlockedReceiver", scope: !586, file: !2, size: 128, align: 64, elements: !596, templateParams: !4, identifier: "41c48357f24f129dbbaa9cbde4ebe2f8::BlockedReceiver")
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !595, file: !2, baseType: !553, size: 64, align: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "NoneBlocked", scope: !588, file: !2, baseType: !599, size: 128, align: 64, extraData: i64 2)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoneBlocked", scope: !586, file: !2, size: 128, align: 64, elements: !4, templateParams: !4, identifier: "41c48357f24f129dbbaa9cbde4ebe2f8::NoneBlocked")
!600 = !DIDerivedType(tag: DW_TAG_member, scope: !522, file: !2, baseType: !80, size: 64, align: 64, flags: DIFlagArtificial)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !534, file: !2, baseType: !602, size: 320, align: 64, offset: 256)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer<usize>", scope: !522, file: !2, size: 320, align: 64, elements: !603, templateParams: !40, identifier: "b633678125aff6f2b4e387a42583879e")
!603 = !{!604, !621, !622}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !602, file: !2, baseType: !605, size: 192, align: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<core::option::Option<usize>, alloc::alloc::Global>", scope: !183, file: !2, size: 192, align: 64, elements: !606, templateParams: !619, identifier: "2323bede42ee3ec8b6e8c9686fe9c808")
!606 = !{!607, !620}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !605, file: !2, baseType: !608, size: 128, align: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<core::option::Option<usize>, alloc::alloc::Global>", scope: !187, file: !2, size: 128, align: 64, elements: !609, templateParams: !619, identifier: "f7d8b723c96921d221c60c30a53963f7")
!609 = !{!610, !617, !618}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !608, file: !2, baseType: !611, size: 64, align: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<core::option::Option<usize>>", scope: !191, file: !2, size: 64, align: 64, elements: !612, templateParams: !287, identifier: "7e94b52d550944c3d74ebdde452ec4ef")
!612 = !{!613, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !611, file: !2, baseType: !614, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::option::Option<usize>", baseType: !277, size: 64, align: 64, dwarfAddressSpace: 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !611, file: !2, baseType: !616, align: 8)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<core::option::Option<usize>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !287, identifier: "14a694b334f13296f732d4c216651025")
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !608, file: !2, baseType: !39, size: 64, align: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !608, file: !2, baseType: !73, align: 8)
!619 = !{!288, !72}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !605, file: !2, baseType: !39, size: 64, align: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !602, file: !2, baseType: !39, size: 64, align: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !602, file: !2, baseType: !39, size: 64, align: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !534, file: !2, baseType: !39, size: 64, align: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "canceled", scope: !534, file: !2, baseType: !625, size: 64, align: 64, offset: 640)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&mut bool>", scope: !48, file: !2, size: 64, align: 64, elements: !626, identifier: "8552cf83b90daad3de7addc5bc2c028d")
!626 = !{!627}
!627 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 64, align: 64, elements: !628, templateParams: !631, identifier: "8552cf83b90daad3de7addc5bc2c028d_variant_part", discriminator: !79)
!628 = !{!629, !634}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !627, file: !2, baseType: !630, size: 64, align: 64, extraData: i64 0)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !625, file: !2, size: 64, align: 64, elements: !4, templateParams: !631, identifier: "8552cf83b90daad3de7addc5bc2c028d::None")
!631 = !{!632}
!632 = !DITemplateTypeParameter(name: "T", type: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut bool", baseType: !381, size: 64, align: 64, dwarfAddressSpace: 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !627, file: !2, baseType: !635, size: 64, align: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !625, file: !2, size: 64, align: 64, elements: !636, templateParams: !631, identifier: "8552cf83b90daad3de7addc5bc2c028d::Some")
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !635, file: !2, baseType: !633, size: 64, align: 64)
!638 = !{!639}
!639 = !DITemplateTypeParameter(name: "T", type: !534)
!640 = !{!641}
!641 = !DITemplateTypeParameter(name: "T", type: !521)
!642 = !{!643}
!643 = !DITemplateTypeParameter(name: "T", type: !516)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !509, file: !2, baseType: !645, align: 8)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mpsc::sync::Packet<usize>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !642, identifier: "41f217c643ba775416087d41b85fb4dc")
!646 = !DIDerivedType(tag: DW_TAG_member, scope: !243, file: !2, baseType: !80, size: 64, align: 64, flags: DIFlagArtificial)
!647 = !{!648}
!648 = !DITemplateTypeParameter(name: "T", type: !249)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !5, file: !2, baseType: !650, size: 64, align: 64, offset: 320)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>", scope: !16, file: !2, size: 64, align: 64, elements: !651, templateParams: !711, identifier: "9f69d4a4ef5bfc588f581d4ebf813744")
!651 = !{!652, !715}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !650, file: !2, baseType: !653, size: 64, align: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>>", scope: !21, file: !2, size: 64, align: 64, elements: !654, templateParams: !713, identifier: "deb976d1bb0f133e122a9faf82b49a61")
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !653, file: !2, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>", baseType: !657, size: 64, align: 64, dwarfAddressSpace: 0)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>", scope: !16, file: !2, size: 320, align: 64, elements: !658, templateParams: !711, identifier: "7d2738a5786756e64da99362bb82acbf")
!658 = !{!659, !660, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !657, file: !2, baseType: !30, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !657, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !657, file: !2, baseType: !662, size: 192, align: 64, offset: 128)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>", scope: !36, file: !2, size: 192, align: 64, elements: !663, templateParams: !709, identifier: "6a49dbd04fb2d16b9086c9bedbef4dfd")
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !662, file: !2, baseType: !665, size: 192, align: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>", scope: !48, file: !2, size: 192, align: 64, elements: !666, identifier: "dc31879507e16af2bf7b272532e6045f")
!666 = !{!667}
!667 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 192, align: 64, elements: !668, templateParams: !671, identifier: "dc31879507e16af2bf7b272532e6045f_variant_part", discriminator: !79)
!668 = !{!669, !705}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !667, file: !2, baseType: !670, size: 192, align: 64, extraData: i64 0)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !665, file: !2, size: 192, align: 64, elements: !4, templateParams: !671, identifier: "dc31879507e16af2bf7b272532e6045f::None")
!671 = !{!672}
!672 = !DITemplateTypeParameter(name: "T", type: !673)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>", scope: !674, file: !2, size: 128, align: 64, elements: !675, identifier: "28373595b4cd722276284465e2329572")
!674 = !DINamespace(name: "result", scope: !23)
!675 = !{!676}
!676 = !DICompositeType(tag: DW_TAG_variant_part, scope: !674, file: !2, size: 128, align: 64, elements: !677, templateParams: !682, identifier: "28373595b4cd722276284465e2329572_variant_part", discriminator: !704)
!677 = !{!678, !700}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !676, file: !2, baseType: !679, size: 128, align: 64, extraData: i64 0)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !673, file: !2, size: 128, align: 64, elements: !680, templateParams: !682, identifier: "28373595b4cd722276284465e2329572::Ok")
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !679, file: !2, baseType: !496, align: 8)
!682 = !{!498, !683}
!683 = !DITemplateTypeParameter(name: "E", type: !684)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<Any, alloc::alloc::Global>", scope: !685, file: !2, size: 128, align: 64, elements: !686, templateParams: !694, identifier: "7a2d7e7761ee0eb44bd8f9a39c252beb")
!685 = !DINamespace(name: "any", scope: !23)
!686 = !{!687, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !684, file: !2, baseType: !688, size: 64, align: 64, flags: DIFlagArtificial)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !684, file: !2, baseType: !690, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !691, size: 64, align: 64, dwarfAddressSpace: 0)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, align: 64, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 3, lowerBound: 0)
!694 = !{!695, !72}
!695 = !DITemplateTypeParameter(name: "T", type: !696)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "Any", scope: !685, file: !2, align: 8, elements: !697, templateParams: !4, identifier: "6a6e53963d294fb9bcb67b6a5aee5592")
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !696, file: !2, baseType: !688, size: 64, align: 64, flags: DIFlagArtificial)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !696, file: !2, baseType: !690, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !676, file: !2, baseType: !701, size: 128, align: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !673, file: !2, size: 128, align: 64, elements: !702, templateParams: !682, identifier: "28373595b4cd722276284465e2329572::Err")
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !701, file: !2, baseType: !684, size: 128, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, scope: !674, file: !2, baseType: !80, size: 64, align: 64, flags: DIFlagArtificial)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !667, file: !2, baseType: !706, size: 192, align: 64, extraData: i64 1)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !665, file: !2, size: 192, align: 64, elements: !707, templateParams: !671, identifier: "dc31879507e16af2bf7b272532e6045f::Some")
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !706, file: !2, baseType: !673, size: 128, align: 64, offset: 64)
!709 = !{!710}
!710 = !DITemplateTypeParameter(name: "T", type: !665)
!711 = !{!712}
!712 = !DITemplateTypeParameter(name: "T", type: !662)
!713 = !{!714}
!714 = !DITemplateTypeParameter(name: "T", type: !657)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !650, file: !2, baseType: !716, align: 8)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<Any, alloc::alloc::Global>>>>>>", scope: !112, file: !2, align: 8, elements: !4, templateParams: !713, identifier: "8affee3a4ee64d6bb58b62b8041baeef")
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !720, identifier: "vtable")
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !721, file: !2, size: 64, align: 64, elements: !723, templateParams: !4, identifier: "45a67288d5b86a44fe74bb43f5c1fa66")
!721 = !DINamespace(name: "lang_start", scope: !722)
!722 = !DINamespace(name: "rt", scope: !9)
!723 = !{!724}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !720, file: !2, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !726, size: 64, align: 64, dwarfAddressSpace: 0)
!726 = !DISubroutineType(types: !727)
!727 = !{null}
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !731, identifier: "vtable")
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicPayload<&str>", scope: !732, file: !2, size: 128, align: 64, elements: !734, templateParams: !752, identifier: "8f6e4972f9428b6393b96dbb73ba069f")
!732 = !DINamespace(name: "begin_panic", scope: !733)
!733 = !DINamespace(name: "panicking", scope: !9)
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !731, file: !2, baseType: !736, size: 128, align: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !48, file: !2, size: 128, align: 64, elements: !737, identifier: "9130b3267b3090f75854af79e5dc78bd")
!737 = !{!738}
!738 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 128, align: 64, elements: !739, templateParams: !742, identifier: "9130b3267b3090f75854af79e5dc78bd_variant_part", discriminator: !79)
!739 = !{!740, !748}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !738, file: !2, baseType: !741, size: 128, align: 64, extraData: i64 0)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !736, file: !2, size: 128, align: 64, elements: !4, templateParams: !742, identifier: "9130b3267b3090f75854af79e5dc78bd::None")
!742 = !{!743}
!743 = !DITemplateTypeParameter(name: "T", type: !744)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !745, templateParams: !4, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !744, file: !2, baseType: !64, size: 64, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !744, file: !2, baseType: !39, size: 64, align: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !738, file: !2, baseType: !749, size: 128, align: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !736, file: !2, size: 128, align: 64, elements: !750, templateParams: !742, identifier: "9130b3267b3090f75854af79e5dc78bd::Some")
!750 = !{!751}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !749, file: !2, baseType: !744, size: 128, align: 64)
!752 = !{!753}
!753 = !DITemplateTypeParameter(name: "A", type: !744)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !757, identifier: "vtable")
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !758, file: !2, size: 128, align: 64, elements: !760, templateParams: !4, identifier: "5a17b0ef287fbce5f29d1ac12e27ed3d")
!758 = !DINamespace(name: "error", scope: !759)
!759 = !DINamespace(name: "io", scope: !9)
!760 = !{!761}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !757, file: !2, baseType: !762, size: 128, align: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !758, file: !2, size: 128, align: 64, elements: !763, identifier: "6bac17bb1ce229d75eed89e4a55bfcf4")
!763 = !{!764}
!764 = !DICompositeType(tag: DW_TAG_variant_part, scope: !758, file: !2, size: 128, align: 64, elements: !765, templateParams: !4, identifier: "6bac17bb1ce229d75eed89e4a55bfcf4_variant_part", discriminator: !814)
!765 = !{!766, !770, !794}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !764, file: !2, baseType: !767, size: 128, align: 64, extraData: i64 0)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !762, file: !2, size: 128, align: 64, elements: !768, templateParams: !4, identifier: "6bac17bb1ce229d75eed89e4a55bfcf4::Os")
!768 = !{!769}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !767, file: !2, baseType: !103, size: 32, align: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !764, file: !2, baseType: !771, size: 128, align: 64, extraData: i64 1)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !762, file: !2, size: 128, align: 64, elements: !772, templateParams: !4, identifier: "6bac17bb1ce229d75eed89e4a55bfcf4::Simple")
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !771, file: !2, baseType: !774, size: 8, align: 8, offset: 8)
!774 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !758, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!776 = !DIEnumerator(name: "NotFound", value: 0)
!777 = !DIEnumerator(name: "PermissionDenied", value: 1)
!778 = !DIEnumerator(name: "ConnectionRefused", value: 2)
!779 = !DIEnumerator(name: "ConnectionReset", value: 3)
!780 = !DIEnumerator(name: "ConnectionAborted", value: 4)
!781 = !DIEnumerator(name: "NotConnected", value: 5)
!782 = !DIEnumerator(name: "AddrInUse", value: 6)
!783 = !DIEnumerator(name: "AddrNotAvailable", value: 7)
!784 = !DIEnumerator(name: "BrokenPipe", value: 8)
!785 = !DIEnumerator(name: "AlreadyExists", value: 9)
!786 = !DIEnumerator(name: "WouldBlock", value: 10)
!787 = !DIEnumerator(name: "InvalidInput", value: 11)
!788 = !DIEnumerator(name: "InvalidData", value: 12)
!789 = !DIEnumerator(name: "TimedOut", value: 13)
!790 = !DIEnumerator(name: "WriteZero", value: 14)
!791 = !DIEnumerator(name: "Interrupted", value: 15)
!792 = !DIEnumerator(name: "Other", value: 16)
!793 = !DIEnumerator(name: "UnexpectedEof", value: 17)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !764, file: !2, baseType: !795, size: 128, align: 64, extraData: i64 2)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !762, file: !2, size: 128, align: 64, elements: !796, templateParams: !4, identifier: "6bac17bb1ce229d75eed89e4a55bfcf4::Custom")
!796 = !{!797}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !795, file: !2, baseType: !798, size: 64, align: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !799, size: 64, align: 64, dwarfAddressSpace: 0)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !758, file: !2, size: 192, align: 64, elements: !800, templateParams: !4, identifier: "4305bec694781162c6b0aa19d9e116f2")
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !799, file: !2, baseType: !774, size: 8, align: 8, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !799, file: !2, baseType: !803, size: 128, align: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<Error, alloc::alloc::Global>", scope: !804, file: !2, size: 128, align: 64, elements: !805, templateParams: !808, identifier: "35b35d15944c826bd8cb869652d3c7e7")
!804 = !DINamespace(name: "error", scope: !9)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !803, file: !2, baseType: !688, size: 64, align: 64, flags: DIFlagArtificial)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !803, file: !2, baseType: !690, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!808 = !{!809, !72}
!809 = !DITemplateTypeParameter(name: "T", type: !810)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !804, file: !2, align: 8, elements: !811, templateParams: !4, identifier: "959a42dde6f89d186f860f7442dc331e")
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !810, file: !2, baseType: !688, size: 64, align: 64, flags: DIFlagArtificial)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !810, file: !2, baseType: !690, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!814 = !DIDerivedType(tag: DW_TAG_member, scope: !758, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagArtificial)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !817, isLocal: true, isDefinition: true)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !818, identifier: "vtable")
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<std::sync::mpsc::sync::State<usize>>>", scope: !167, file: !2, size: 128, align: 64, elements: !819, templateParams: !829, identifier: "f7492de39c58b27e5c9015a9291d174b")
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !818, file: !2, baseType: !821, size: 128, align: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<std::sync::mpsc::sync::State<usize>>", scope: !135, file: !2, size: 128, align: 64, elements: !822, templateParams: !638, identifier: "c797633edbef4ca521047c2d31f2d7cb")
!822 = !{!823, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !821, file: !2, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<std::sync::mpsc::sync::State<usize>>", baseType: !526, size: 64, align: 64, dwarfAddressSpace: 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !821, file: !2, baseType: !826, size: 8, align: 8, offset: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guard", scope: !167, file: !2, size: 8, align: 8, elements: !827, templateParams: !4, identifier: "4e3c4ca40927284c81be83d26d9ac553")
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "panicking", scope: !826, file: !2, baseType: !381, size: 8, align: 8)
!829 = !{!830}
!830 = !DITemplateTypeParameter(name: "T", type: !821)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !833, isLocal: true, isDefinition: true)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !834, identifier: "vtable")
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<usize>>", scope: !167, file: !2, size: 128, align: 64, elements: !835, templateParams: !842, identifier: "18ecd6df0f198d507c9b8e065824f7e4")
!835 = !{!836}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !834, file: !2, baseType: !837, size: 128, align: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<usize>", scope: !135, file: !2, size: 128, align: 64, elements: !838, templateParams: !40, identifier: "d9bf8692e2d65c7129ca612275d4aa58")
!838 = !{!839, !841}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !837, file: !2, baseType: !840, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<usize>", baseType: !230, size: 64, align: 64, dwarfAddressSpace: 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !837, file: !2, baseType: !826, size: 8, align: 8, offset: 64)
!842 = !{!843}
!843 = !DITemplateTypeParameter(name: "T", type: !837)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !846, isLocal: true, isDefinition: true)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !847, identifier: "vtable")
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<()>>", scope: !167, file: !2, size: 128, align: 64, elements: !848, templateParams: !855, identifier: "ba2bfad48cdc97f0e56638e4cd17914e")
!848 = !{!849}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !847, file: !2, baseType: !850, size: 128, align: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<()>", scope: !135, file: !2, size: 128, align: 64, elements: !851, templateParams: !497, identifier: "549c5ab499f5f87d7b1de0df066c8041")
!851 = !{!852, !854}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !850, file: !2, baseType: !853, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<()>", baseType: !488, size: 64, align: 64, dwarfAddressSpace: 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !850, file: !2, baseType: !826, size: 8, align: 8, offset: 64)
!855 = !{!856}
!856 = !DITemplateTypeParameter(name: "T", type: !850)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !859, isLocal: true, isDefinition: true)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !860, identifier: "vtable")
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "RecvError", scope: !243, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "27385fe062c422ae1ee3c15221971ced")
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !863, isLocal: true, isDefinition: true)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !864, identifier: "vtable")
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "SendError<usize>", scope: !243, file: !2, size: 64, align: 64, elements: !865, templateParams: !40, identifier: "c2fbc4bc1928084d2e4bb81b259be360")
!865 = !{!866}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !864, file: !2, baseType: !39, size: 64, align: 64)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !869, isLocal: true, isDefinition: true)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !744, identifier: "vtable")
!870 = !{i32 7, !"PIC Level", i32 2}
!871 = !{i32 7, !"PIE Level", i32 2}
!872 = !{i32 2, !"RtLibUseGOT", i32 1}
!873 = !{i32 2, !"Debug Info Version", i32 3}
!874 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !875, producer: "clang LLVM (rustc version 1.51.0-nightly (e38fb306b 2021-01-14))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !876, globals: !917)
!875 = !DIFile(filename: "src/main.rs", directory: "/home/skeet/Documents/o2_lab/rust/race_examples/mutex_test/target/debug/deps")
!876 = !{!774, !877, !881, !885, !894, !901, !908, !912, !913}
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Failure", scope: !522, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !878)
!878 = !{!879, !880}
!879 = !DIEnumerator(name: "Empty", value: 0)
!880 = !DIEnumerator(name: "Disconnected", value: 1)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !674, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !882)
!882 = !{!883, !884}
!883 = !DIEnumerator(name: "Ok", value: 0)
!884 = !DIEnumerator(name: "Err", value: 1)
!885 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !886, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !889)
!886 = !DINamespace(name: "v1", scope: !887)
!887 = !DINamespace(name: "rt", scope: !888)
!888 = !DINamespace(name: "fmt", scope: !23)
!889 = !{!890, !891, !892, !893}
!890 = !DIEnumerator(name: "Left", value: 0)
!891 = !DIEnumerator(name: "Right", value: 1)
!892 = !DIEnumerator(name: "Center", value: 2)
!893 = !DIEnumerator(name: "Unknown", value: 3)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !895, file: !2, baseType: !896, size: 8, align: 8, flags: DIFlagEnumClass, elements: !897)
!895 = !DINamespace(name: "cmp", scope: !23)
!896 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!897 = !{!898, !899, !900}
!898 = !DIEnumerator(name: "Less", value: -1)
!899 = !DIEnumerator(name: "Equal", value: 0)
!900 = !DIEnumerator(name: "Greater", value: 1)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !31, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !902)
!902 = !{!903, !904, !905, !906, !907}
!903 = !DIEnumerator(name: "Relaxed", value: 0)
!904 = !DIEnumerator(name: "Release", value: 1)
!905 = !DIEnumerator(name: "Acquire", value: 2)
!906 = !DIEnumerator(name: "AcqRel", value: 3)
!907 = !DIEnumerator(name: "SeqCst", value: 4)
!908 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Option", scope: !48, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !909)
!909 = !{!910, !911}
!910 = !DIEnumerator(name: "None", value: 0)
!911 = !DIEnumerator(name: "Some", value: 1)
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Failure", scope: !458, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !878)
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "StartResult", scope: !458, file: !2, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !914)
!914 = !{!915, !916}
!915 = !DIEnumerator(name: "Installed", value: 0)
!916 = !DIEnumerator(name: "Abort", value: 1)
!917 = !{!0, !717, !728, !754, !815, !831, !844, !857, !861, !867}
!918 = distinct !DISubprogram(name: "spawn_unchecked<closure-0,()>", linkageName: "_RINvMNtCs2bNvlddUlXM_3std6threadNtB3_7Builder15spawn_uncheckedNCNvCseoN0Z986GuA_10mutex_test4main0uEB12_", scope: !920, file: !919, line: 443, type: !940, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !874, templateParams: !1008, retainedNodes: !984)
!919 = !DIFile(filename: "/rustc/e38fb306b7f5e65cca34df2dab1f0db15e1defb4/library/std/src/thread/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f26192c994bf4f410829d52b5e501e96")
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "Builder", scope: !8, file: !2, size: 320, align: 64, elements: !921, templateParams: !4, identifier: "b16137263913302cd67d8a5c187f6b38")
!921 = !{!922, !939}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !920, file: !2, baseType: !923, size: 192, align: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::string::String>", scope: !48, file: !2, size: 192, align: 64, elements: !924, identifier: "67027ad9c25424f98f4def2c6ef6fe76")
!924 = !{!925}
!925 = !DICompositeType(tag: DW_TAG_variant_part, scope: !48, file: !2, size: 192, align: 64, elements: !926, templateParams: !929, identifier: "67027ad9c25424f98f4def2c6ef6fe76_variant_part", discriminator: !79)
!926 = !{!927, !935}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !925, file: !2, baseType: !928, size: 192, align: 64, extraData: i64 0)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !923, file: !2, size: 192, align: 64, elements: !4, templateParams: !929, identifier: "67027ad9c25424f98f4def2c6ef6fe76::None")
!929 = !{!930}
!930 = !DITemplateTypeParameter(name: "T", type: !931)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !932, file: !2, size: 192, align: 64, elements: !933, templateParams: !4, identifier: "cfe621014755e10eb2a74f207341053e")
!932 = !DINamespace(name: "string", scope: !17)
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !931, file: !2, baseType: !182, size: 192, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !925, file: !2, baseType: !936, size: 192, align: 64)
